document.addEventListener("DOMContentLoaded", function () {
    const calendarContainer = document.getElementById("calendar-container");
    const modal = document.getElementById("modal");
    const modalDetails = document.getElementById("modal-details");
    const modalClose = document.getElementById("modal-close");
    const yearSelect = document.getElementById("year");
    const monthSelect = document.getElementById("month");
    const totalExpenditureDisplay = document.getElementById("total-expenditure");

    // 示例数据
    const expensesData = {
        "2022-04-24": [
            {
                "shop": "企",
                "note": "拾柒同学",
                "items": [
                    { "name": "polo翻领打底衫 白色;均码", "price": 21.98 },
                    { "name": "polo翻领打底衫 蓝色;均码", "price": 21.98 },
                    { "name": "polo翻领打底衫 黑色;均码", "price": 21.98 }
                ]
            }
        ],
        "2022-06-06": [
            {
                "shop": "企",
                "note": "明哲放心食品",
                "items": [
                    { "name": "双汇火腿肠 玉米+鸡肉+鱼肉+泡面肠▲30支装", "price": 27.80 }
                ]
            }, {
                "shop": "企",
                "note": "吃货食品零食店",
                "items": [
                    { "name": "卫龙亲嘴烧100片整盒 三口味混合30片", "price": 8.90 }
                ]
            }, {
                "shop": "淘宝",
                "note": "悠然自得零食商贸",
                "items": [
                    { "name": "卫龙魔芋爽2斤约60包 (香辣+麻辣)1斤约28-30包", "price": 19.8 }
                ]
            }, {
                "shop": "淘宝",
                "note": "寒态旗舰店",
                "items": [
                    { "name": "东北特产黑木耳干货500g*2", "price": 72.60 }
                ]
            }, {
                "shop": "天猫",
                "note": "渝冬来旗舰店",
                "items": [
                    { "name": "重庆火锅底料500g", "price": 23.80 },
                    { "name": "渝冬来正宗重庆牛油火锅底料256gx2袋", "price": 24.80 },
                    { "name": "店铺优惠", "price": -11.00 },
                    { "name": "跨店满减", "price": -7.86 }
                ]
            }, {
                "shop": "天猫",
                "note": "味巴哥旗舰店",
                "items": [
                    { "name": "味巴哥猪肉脯300g 原味100g+孜然100g+蜜汁100g", "price": 11.74 }
                ]
            }, {
                "shop": "天猫",
                "note": "恋实多旗舰店",
                "items": [
                    { "name": "农家日晒特级小香菇干货500g*2", "price": 64.35 }
                ]
            }, {
                "shop": "天猫",
                "note": "草原红太阳旗舰店",
                "items": [
                    { "name": "草原红太阳火锅蘸料110g*6袋(三原 三辣)", "price": 20.87 }
                ]
            }, {
                "shop": "天猫",
                "note": "渔知乐旗舰店",
                "items": [
                    { "name": "渔知乐淡干虾皮特级500g", "price": 27.58 }
                ]
            }, {
                "shop": "天猫",
                "note": "比比赞旗舰店",
                "items": [
                    { "name": "比比赞精武鸭脖 甜辣味10个送麻辣味10个", "price": 12.17 }
                ]
            }, {
                "shop": "天猫",
                "note": "朱小二旗舰店",
                "items": [
                    { "name": "绿豆糕板栗酥饼 500q送500g", "price": 11.57 }
                ]
            }, {
                "shop": "天猫",
                "note": "食尚物语食品专营店",
                "items": [
                    { "name": "双汇火腿肠 鸡肉肠60g*40支", "price": 29.17 }
                ]
            }, {
                "shop": "天猫",
                "note": "紫晨食品专营店",
                "items": [
                    { "name": "食大能东北老式牛筋面版360g*5袋", "price": 21.63 }
                ]
            }
        ],
        "2022-06-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "白象方便面*1，整箱24包（原汁猪骨+香辣猪骨）各12包", "price": 21.78 },
                    { "name": "王守义 花椒 55g", "price": 18.00 },
                    { "name": "王守义 十三香 45g*3", "price": 12.90 },
                    { "name": "王守义 麻辣鲜 90g*3", "price": 10.90 },
                    { "name": "王守义 十三香 调味品 烧烤料 100g", "price": 12.90 },
                    { "name": "王守义 精选肉桂 55g*2", "price": 16.90 },
                    { "name": "王守义 八角 55g*2", "price": 18.80 },
                    { "name": "王守义 调味品 包子饺子调味料 35g*2", "price": 10.50 },
                    { "name": "优惠券", "price": -1.00 }
                ]
            }
        ],
        "2022-09-20": [
            {
                "shop": "天猫",
                "note": "如乐教育服务专营店",
                "items": [
                    { "name": "Turnitin英文论文查重sci国际版", "price": 38.00 }
                ]
            }
        ],
        "2022-09-22": [
            {
                "shop": "天猫",
                "note": "如乐教育服务专营店",
                "items": [
                    { "name": "Turnitin英文论文查重sci国际版", "price": 25.00 }
                ]
            }
        ],
        "2023-01-03": [
            {
                "shop": "天猫",
                "note": "美的生活电器旗舰店",
                "items": [
                    { "name": "美的电磁炉 裸配-曜石黑", "price": 139.01 }
                ]
            }
        ],
        "2023-01-04": [
            {
                "shop": "美团",
                "items": [
                    { "name": "海鲜烤肉自助晚餐*2", "price": 124.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "风瓷阁旗舰店",
                "items": [
                    { "name": "热水瓶家用不锈钢保温瓶 钢本色3.2升平盖(包含内胆)送瓶塞", "price": 32.89 }
                ]
            }, {
                "shop": "天猫",
                "note": "美的生活电器旗舰店",
                "items": [
                    { "name": "美的电热水壶 [珍珠白]", "price": 68.73 }
                ]
            }, {
                "shop": "天猫",
                "note": "居家家您身边的居家伴侣",
                "items": [
                    { "name": "居家家垃圾桶【加厚2件大号】绿+粉", "price": 11.25 }
                ]
            }
        ],
        "2023-01-05": [
            {
                "shop": "天猫",
                "note": "客小街旗舰店",
                "items": [
                    { "name": "全实木床架子无床头榻榻米 30高裸床:1800mm*2000mm", "price": 270.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "多乐都乐旗舰店",
                "items": [
                    { "name": "电竞椅电脑椅 黑灰(耐磨皮)(内置乳胶)(定型绵)", "price": 239.00 },
                    { "name": "电竞椅电脑椅 粉白(耐磨皮)(内置乳胶)(定型绵)", "price": 239.00 },
                    { "name": "店铺优惠", "price": -10 },
                    { "name": "官方立减", "price": -47.80 }
                ]
            }
        ],
        "2023-01-06": [
            {
                "shop": "天猫",
                "note": "妮维雅倾颜专卖店",
                "items": [
                    { "name": "妮维雅洗面奶男士 300g", "price": 39.91 }
                ]
            }, {
                "shop": "淘宝",
                "note": "傻妞一口价",
                "items": [
                    { "name": "innisfree悦诗风吟绿茶保湿洁面乳 150ml", "price": 22.50 }
                ]
            }, {
                "shop": "天猫",
                "note": "蔓斯菲尔旗舰店",
                "items": [
                    { "name": "电脑桌 120x60拉丝橡木【升级斜撑加固】", "price": 85.30 }
                ]
            }, {
                "shop": "天猫",
                "note": "吉度旗舰店",
                "items": [
                    { "name": "吉度高汤锅304钢 特厚高汤锅26cm+蒸笼", "price": 102.6 }
                ]
            }, {
                "shop": "天猫",
                "note": "派莱斯旗舰店",
                "items": [
                    { "name": "刀具厨房套装组合 龙泉锻打切片刀 19cm", "price": 33.22 }
                ]
            }, {
                "shop": "天猫",
                "note": "好管家旗舰店",
                "items": [
                    { "name": "好管家切菜板 45*32*18cm送十双竹筷+砧板架", "price": 22.01 }
                ]
            }, {
                "shop": "天猫",
                "note": "帝途旗舰店",
                "items": [
                    { "name": "美菱电饭煲 美菱智能煲-3升球釜胆", "price": 76.00 }
                ]
            }, {
                "shop": "企",
                "note": "景德镇云鸿陶瓷",
                "items": [
                    { "name": "碗碟套装陶瓷 4碗4盘4勺4筷2面碗(纯白)", "price": 19.8 }
                ]
            }, {
                "shop": "天猫",
                "note": "恒暖祥旗舰店",
                "items": [
                    { "name": "电热毯单双人电褥子 舒适绒爱心款180*90四档单控", "price": 32.76 }
                ]
            }, {
                "shop": "天猫",
                "note": "恒暖祥旗舰店",
                "items": [
                    { "name": "电热毯单双人电褥子 舒适绒小雏菊180*90四档单控", "price": 32.76 }
                ]
            }, {
                "shop": "天猫",
                "note": "巧恋家居旗舰店",
                "items": [
                    { "name": "马桶坐垫 2件【灰色】针织", "price": 12.91 }
                ]
            }, {
                "shop": "企",
                "note": "南极人睡衣逸品棉官方企业店",
                "items": [
                    { "name": "南极人情侣睡衣珊瑚绒 女XL送男3XL", "price": 97.90 }
                ]
            }
        ],
        "2023-01-07": [
            {
                "shop": "淘宝",
                "note": "爱生活优家居",
                "items": [
                    { "name": "加深洗脸盆 家用塑料盆洗漱盆 小号粉", "price": 4.78 }
                ]
            }, {
                "shop": "淘宝",
                "note": "爱美家居家生活馆",
                "items": [
                    { "name": "洗碗手套 透白【混色】5双[送2条抹布] L", "price": 10.10 }
                ]
            }, {
                "shop": "企",
                "note": "中胜气柱包装",
                "items": [
                    { "name": "气柱袋气泡柱 60cm 50米小卷", "price": 34.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "益伟家居旗舰店",
                "items": [
                    { "name": "泡澡桶大人可折叠 1.2米【无盖+置物篮】", "price": 139.20 }
                ]
            }
        ],
        "2023-01-08": [
            {
                "shop": "天猫",
                "note": "GIANXI旗舰店",
                "items": [
                    { "name": "多功能厨房剪刀家用 鸡骨剪(黑色)", "price": 6.21 }
                ]
            }, {
                "shop": "淘宝",
                "note": "中益家居",
                "items": [
                    { "name": "挂钩强力粘胶免打孔【透明-加厚】20个(承重50斤)", "price": 5.79 }
                ]
            }, {
                "shop": "天猫",
                "note": "grace洁丽雅瑞华泽专卖店",
                "items": [
                    { "name": "洁丽雅浴巾 太空灰升级加大款【1浴巾】(送同款毛巾)", "price": 20.51 }
                ]
            }, {
                "shop": "天猫",
                "note": "南极人樱玛专卖店",
                "items": [
                    { "name": "诸暨袜子男士 2浅灰+2米色+2深灰+2藏青+2黑色;C110763纯色男长袜", "price": 17.91 }
                ]
            }, {
                "shop": "企",
                "note": "苏菲卫生巾官方品牌店",
                "items": [
                    { "name": "苏菲卫生巾姨妈巾棉柔日用夜用420整箱", "price": 34.55 }
                ]
            }
        ],
        "2023-01-09": [
            {
                "shop": "天猫",
                "note": "烤乐仕旗舰店",
                "items": [
                    { "name": "烤乐仕锡纸烤箱家用 经典款【拍1发2】长10米*宽30cm*15微米(送10米)", "price": 12.22 }
                ]
            }, {
                "shop": "天猫",
                "note": "美的生活电器旗舰店",
                "items": [
                    { "name": "美的空气炸锅 黑色-5.8L双旋钮", "price": 298.23 }
                ]
            }, {
                "shop": "天猫",
                "note": "高睿家纺旗舰店",
                "items": [
                    { "name": "隔断帘免打孔安装 牛油果【挂环款】送大环扣+安装绳;宽1.8x高2.25m", "price": 14.32 }
                ]
            }, {
                "shop": "天猫",
                "note": "高睿家纺旗舰店",
                "items": [
                    { "name": "隔断帘免打孔安装 浅蓝白花【挂环款】送大环扣+安装绳;宽2.5x高2.25m", "price": 19.04 }
                ]
            }, {
                "shop": "天猫",
                "note": "霏彩旗舰店",
                "items": [
                    { "name": "遮光窗帘 加密加厚【送粘钩】宽1.0高1.4*2", "price": 19.60 },
                    { "name": "遮光窗帘 加密加厚【送粘钩】宽1.7高1.6*1", "price": 24.00 },
                    { "name": "店铺优惠", "price": -2.00 },
                    { "name": "官方立减", "price": -4.36 }
                ]
            }, {
                "shop": "天猫",
                "note": "立白岚起专卖店",
                "items": [
                    { "name": "立白 超洁薰衣香粉2斤【一袋】", "price": 8.81 }
                ]
            }, {
                "shop": "天猫",
                "note": "立白壹品专卖店",
                "items": [
                    { "name": "立白西柚洗洁精小瓶 套餐五", "price": 8.90 }
                ]
            }, {
                "shop": "天猫",
                "note": "海麦斯居家日用专营店",
                "items": [
                    { "name": "清扬洗发水沐浴露 洗发水500g+沐浴露700g(350gx2瓶)+送浴球", "price": 36.61 }
                ]
            }, {
                "shop": "天猫",
                "note": "海静居家日用专营店",
                "items": [
                    { "name": "潘婷洗发水 乳液修护洗发水500ml", "price": 25.81 }
                ]
            }, {
                "shop": "天猫",
                "note": "线橙旗舰店",
                "items": [
                    { "name": "3盒牙签家用竹制", "price": 7.82 }
                ]
            }
        ],
        "2023-01-10": [
            {
                "shop": "天猫",
                "note": "米恋家居专营店",
                "items": [
                    { "name": "木浆棉洗碗海绵百洁布【不粘锅专用】木浆棉4片", "price": 6.49 }
                ]
            }, {
                "shop": "天猫",
                "note": "九阳厨具旗舰店",
                "items": [
                    { "name": "九阳大铁锅炒锅家用 32CM-送盖<送钢铲>-精铁", "price": 79.2 }
                ]
            }
        ],
        "2023-01-11": [
            {
                "shop": "天猫",
                "note": "渝里香旗舰店",
                "items": [
                    { "name": "辣椒面贵州特产 微辣特细500g", "price": 14.60 }
                ]
            }
        ],
        "2023-01-12": [
            {
                "shop": "天猫",
                "note": "pissa旗舰店",
                "items": [
                    { "name": "除甲醛果冻 薄荷香型 3x1x200g", "price": 21.80 }
                ]
            }
        ],
        "2023-01-13": [
            {
                "shop": "天猫",
                "note": "衣炫旗舰店",
                "items": [
                    { "name": "不锈钢落地晾衣架 双杆款1.6米【可伸缩】“送30挂钩", "price": 23.82 }
                ]
            }, {
                "shop": "天猫",
                "note": "蓝云天旗舰店",
                "items": [
                    { "name": "刀削面5斤一箱整", "price": 22.8 }
                ]
            }, {
                "shop": "淘宝",
                "note": "SONMI星美管业",
                "items": [
                    { "name": "PVC管 塑料管 给水管20mm*壁厚2.0【白】1m*3", "price": 5.67 },
                    { "name": "PVC管 塑料管 给水管25mm*壁厚2.0【白】1m*2", "price": 5.36 },
                    { "name": "淘金币抵扣", "price": -0.33 }
                ]
            }
        ],
        "2023-01-14": [
            {
                "shop": "天猫",
                "note": "飞利浦个人护理旗舰店",
                "items": [
                    { "name": "飞利浦理发器电推剪理发神器 深蓝色", "price": 97.00 }
                ]
            }
        ],
        "2023-01-30": [
            {
                "shop": "PDD",
                "note": "喜浴益智官方旗舰店",
                "items": [
                    { "name": "3D搓澡巾 强力去污【蓝色+粉色】澡巾", "price": 6.99 }
                ]
            }
        ],
        "2023-02-01": [
            {
                "shop": "PDD",
                "note": "沉默的日用",
                "items": [
                    { "name": "马桶刷子 圆形款【深海蓝】带底座1个装", "price": 4.76 }
                ]
            }
        ],
        "2023-02-02": [
            {
                "shop": "PDD",
                "note": "老管家官方旗舰店",
                "items": [
                    { "name": "老管家水垢清洁剂【1盒装】", "price": 8.55 }
                ]
            }
        ],
        "2023-02-03": [
            {
                "shop": "PDD",
                "note": "纳美互美专卖店",
                "items": [
                    { "name": "纳美小苏打牙膏 2支320g", "price": 15.04 }
                ]
            }, {
                "shop": "PDD",
                "note": "倍加洁家居旗舰店",
                "items": [
                    { "name": "倍加洁日系宽头牙刷 10支装", "price": 13.57 }
                ]
            }, {
                "shop": "PDD",
                "note": "远航家居专营店",
                "items": [
                    { "name": "心相印卷纸 27卷整箱", "price": 35.63 }
                ]
            }
        ],
        "2023-02-16": [
            {
                "shop": "天猫",
                "note": "奥克斯宇田专卖店",
                "items": [
                    { "name": "奥克斯吸尘器湿拖一体家用小型【标配版】白色", "price": 119.00 },
                    { "name": "店铺优惠", "price": -20.00 },
                    { "name": "红包", "price": -87.20 },
                    { "name": "支付宝红包", "price": -0.1 }
                ]
            }
        ],
        "2023-03-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "洁丽雅（Grace）亲肤四件套 1.5米床【被套200*230cm】", "price": 99.90 },
                    { "name": "陶华碧老干妈风味鸡油辣椒酱 280g", "price": 16.90 },
                    { "name": "优惠券", "price": -42.38 }
                ]
            }
        ],
        "2023-03-07": [
            {
                "shop": "京东",
                "items": [
                    { "name": "NASA GISS重磅260g纯棉短袖，炭灰色，3XL体重190-230斤", "price": 16.89 },
                    { "name": "乖媳妇 柠檬泡凤爪 600g", "price": 36.90 },
                    { "name": "金锣 尚清斋 清真鸡肉肠 52g*40", "price": 39.20 },
                    { "name": "比比赞 黑麦手撕面包", "price": 19.90 },
                    { "name": "富昌 腐竹 500g", "price": 28.80 },
                    { "name": "比比赞 手撕面包", "price": 21.90 },
                    { "name": "八荒 古田珍珠香菇 250g", "price": 29.90 },
                    { "name": "八荒 东北特产黑木耳 206g", "price": 24.80 },
                    { "name": "优惠券", "price": -24.26 },
                    { "name": "金龙鱼 东北长粒香 5kg", "price": 26.01 }
                ]
            }
        ],
        "2023-03-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "梦庭 衣架夹子 10支装", "price": 10.44 },
                    { "name": "秉优 不锈钢大号夹子 10个装", "price": 10.73 },
                    { "name": "稳健（Winner）医用外科口罩50只", "price": 10.10 },
                    { "name": "舒可曼 白砂糖400g", "price": 6.30 },
                    { "name": "海露玻璃酸钠滴眼液*1【单盒尝鲜】护眼爆品 无防腐剂", "price": 67.78 },
                    { "name": "福临门 食用油 非转基因大豆油1.8L 中粮出品", "price": 29.90 },
                    { "name": "维福佳 维生素B1片 10mg*100片 1盒", "price": 1.00 }
                ]
            }
        ],
        "2023-03-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "回力女鞋2023春夏季百搭 米棕红，38", "price": 70.05 },
                    { "name": "金龙鱼 蟹稻共生盘锦大米 5kg*4", "price": 103.88 },
                    { "name": "拾画 创意日式合金筷子5双", "price": 8.90 },
                    { "name": "陶华碧老干妈风味豆鼓油制辣椒 280g", "price": 12.90 },
                    { "name": "陶华碧老干妈风味鸡油辣椒酱 280g", "price": 16.90 },
                    { "name": "优惠券", "price": -6.96 }
                ]
            }
        ],
        "2023-03-18": [
            {
                "shop": "京东",
                "items": [
                    { "name": "忍者（storc）指甲刀套装 美甲12件套经典款", "price": 18.71 },
                    { "name": "双汇 火腿肠 鸡肉肠65g*50整箱装", "price": 52.00 },
                    { "name": "紫林 醋 3.5度山西陈醋820ml", "price": 9.60 },
                    { "name": "麻辣王子 550g/盒（30小包）", "price": 29.90 },
                    { "name": "优惠券", "price": -7.30 }
                ]
            }
        ],
        "2023-03-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "TP-LINK 大道AX3000满血Wi-Fi6", "price": 248.92 }
                ]
            }
        ],
        "2023-03-27": [
            {
                "shop": "PDD",
                "note": "比比赞食品旗舰店",
                "items": [
                    { "name": "比比赞雪媚娘【绿豆饼原味】496g", "price": 6.40 }
                ]
            }, {
                "shop": "PDD",
                "note": "千丝旗舰店",
                "items": [
                    { "name": "千丝肉松饼990g【约26个】", "price": 12.24 }
                ]
            }, {
                "shop": "PDD",
                "note": "盐津铺子食品旗舰店",
                "items": [
                    { "name": "盐津铺子手撕素牛排 约30包", "price": 7.61 }
                ]
            }, {
                "shop": "PDD",
                "note": "千丝旗舰店",
                "items": [
                    { "name": "千丝 奶香蒸蛋糕498g", "price": 7.75 }
                ]
            }, {
                "shop": "PDD",
                "note": "源氏食品官方旗舰店",
                "items": [
                    { "name": "源氏老式大辣片 68g大辣片*2+200g豆筋*2", "price": 13.52 }
                ]
            }, {
                "shop": "PDD",
                "note": "盐津铺子食品旗舰店",
                "items": [
                    { "name": "盐津铺子手撕蟹柳 约60根蟹柳混合", "price": 19.69 }
                ]
            }, {
                "shop": "PDD",
                "note": "比比赞食品旗舰店",
                "items": [
                    { "name": "比比 豆乳威化饼干 237g*2箱", "price": 11.02 }
                ]
            }
        ],
        "2023-03-30": [
            {
                "shop": "京东",
                "items": [
                    { "name": "康师傅方便面 经典西红柿炖牛腩 5连包", "price": 13.90 },
                    { "name": "康师傅方便面 经典香辣*5+肥牛*1", "price": 13.90 },
                    { "name": "优惠券", "price": -6.00 },
                    { "name": "香雪 麦香擀面 3kg", "price": 16.80 },
                    { "name": "金锣 鸡肉火腿肠 60g*50支", "price": 49.90 },
                    { "name": "陶华碧 老干妈 牛肉豆豉油辣椒酱 210g", "price": 13.90 },
                    { "name": "陶华碧 老干妈 辣三丁油辣椒酱 280g", "price": 15.90 },
                    { "name": "优惠券", "price": -23.81 }
                ]
            }
        ],
        "2023-03-31": [
            {
                "shop": "京东",
                "items": [
                    { "name": "广西联通手机话费充值100元 快充", "price": 96.99 }
                ]
            }
        ],
        "2023-04-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "领臣一次性防尘膜防尘布数量x1,3米*20米 带定位贴", "price": 10.83 }
                ]
            }
        ],
        "2023-04-06": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 东北黑木耳,500g", "price": 44.87 }
                ]
            }
        ],
        "2023-04-07": [
            {
                "shop": "京东",
                "items": [
                    { "name": "华田禾邦零添加 东北油豆皮1.5kg", "price": 13.01 },
                    { "name": "比比赞 紫薯芋泥饼 500g", "price": 12.90 },
                    { "name": "比比赞 肉松饼 1035g", "price": 21.90 },
                    { "name": "比比赞 日式蒸蛋糕 400g", "price": 11.90 },
                    { "name": "优惠券", "price": -11.25 },
                    { "name": "拜杰(Baijie）菜板塑料 39.7*24*0.6cm", "price": 22.41 },
                    { "name": "福临门 食用油 葵花籽清香食用植物调和油5L", "price": 57.89 }
                ]
            }
        ],
        "2023-04-08": [
            {
                "shop": "天猫",
                "note": "好意诗旗舰店",
                "items": [
                    { "name": "三脚架【2.1m加粗支架】单机位+收纳袋+抖音遥控器", "price": 23.33 }
                ]
            }, {
                "shop": "天猫",
                "note": "茜茜公主玩具旗舰店",
                "items": [
                    { "name": "迷你小厨房 皇家御厨+烧烤套装【送防护6件套】", "price": 83.1 }
                ]
            }, {
                "shop": "PDD",
                "note": "洁丽雅GRACE博祁专卖店",
                "items": [
                    { "name": "洁丽雅抗菌毛巾 2条装【蓝色+粉色】", "price": 10.83 }
                ]
            }
        ],
        "2023-04-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "拜杰硅胶揉面垫 食品级 60*40cm", "price": 25.18 },
                    { "name": "安琪高活性干酵母 20袋", "price": 15.70 },
                    { "name": "王守义十三香 黑胡椒粉30g+白胡椒粉25g", "price": 10.44 },
                    { "name": "吉得利 五香粉 100g", "price": 8.10 },
                    { "name": "吉得利 花椒粉 100g", "price": 18.00 },
                    { "name": "优惠券", "price": -4.30 },
                    { "name": "王守义 烧烤料100g", "price": 11.39 },
                    { "name": "王守义 炖鸡料24g*2", "price": 11.50 },
                    { "name": "王守义 肉桂55g*2", "price": 16.90 },
                    { "name": "王守义 八角55g*2", "price": 18.61 },
                    { "name": "优惠券", "price": -4.00 },
                    { "name": "美厨（maxcook）不锈钢刀具2件套", "price": 8.90 },
                    { "name": "舒可曼 食用小苏打200g", "price": 2.80 },
                    { "name": "优惠券", "price": -0.44 },
                    { "name": "香雪面粉 美味富强粉面粉5kg", "price": 20.90 },
                ]
            }, {
                "shop": "天猫",
                "note": "缦呼吸旗舰店",
                "items": [
                    { "name": "风景背景布ins简约 DM-1:[11.5米*2.0米(送6米星星灯+送安装包)", "price": 32.88 }
                ]
            }, {
                "shop": "天猫",
                "note": "南极人贝扬专卖店",
                "items": [
                    { "name": "南极人迷你小型洗衣机 4.5KG升级款 白色", "price": 124.23 }
                ]
            }, {
                "shop": "天猫",
                "note": "旱龙旗舰店",
                "items": [
                    { "name": "围裙【可擦手】(小熊-丹青蓝+小鹿-卡其粉)", "price": 15.3 }
                ]
            }, {
                "shop": "天猫",
                "note": "怡沁园旗舰店",
                "items": [
                    { "name": "桌布 菱格少女粉(买1送1);80*120cm", "price": 18.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "长虹思彤专卖店",
                "items": [
                    { "name": "长虹电饼铛 珍珠白【升级滑杆调温】30CM", "price": 118.33 }
                ]
            }, {
                "shop": "天猫",
                "note": "carote卡罗特官方旗舰店",
                "items": [
                    { "name": "卡罗特麦饭石不粘锅2件套(煎炒锅+汤锅)", "price": 200.57 },
                    { "name": "卡罗特硅胶铲子家用炒勺 2件套(菜铲+汤勺)", "price": 41.41 }
                ]
            }, {
                "shop": "天猫",
                "note": "耐家旗舰店",
                "items": [
                    { "name": "可折叠电脑桌 黑胡桃色120x60", "price": 68.6 }
                ]
            }
        ],
        "2023-04-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "广意 厨房秤", "price": 15.02 },
                    { "name": "英科医疗（INTCO）一次性手套食品级黑色丁腈，S小号 100只/盒", "price": 22.40 },
                    { "name": "飞利浦（PHILIPS）插座 多国通用+2USB（蓝色）", "price": 87.21 },
                    { "name": "妙洁 一次性保鲜膜 经济装60米*30cm", "price": 10.89 },
                    { "name": "英科医疗（INTCO）一次性手套食品级黑色丁腈，L大号 100只/盒", "price": 25.40 },
                    { "name": "优惠券", "price": -2.08 }
                ]
            }, {
                "shop": "天猫",
                "note": "米爱数码专营店",
                "items": [
                    { "name": "【500W高亮补光灯】+落地俯拍支架", "price": 83.09 }
                ]
            }
        ],
        "2023-04-13": [
            {
                "shop": "京东",
                "items": [
                    { "name": "防蚊纱窗", "price": 18.24 },
                    { "name": "维芙WEFV屋顶丁基胶防水胶带*2,水泥顶铁皮顶专用，宽5厘米*长5米", "price": 29.77 }
                ]
            }
        ],
        "2023-04-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "鲁班神工 丁基胶防水胶带 数量x1,宽5cm*长爆5m", "price": 11.88 }
                ]
            }
        ],
        "2023-04-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "有家良品塑料凳子 加厚防滑1只装", "price": 21.79 }
                ]
            }, {
                "shop": "PDD",
                "note": "维达官方旗舰店",
                "items": [
                    { "name": "维达卷纸 130节30卷(柔软亲肤)", "price": 41.76 }
                ]
            }, {
                "shop": "PDD",
                "note": "雅馨娜家居服专营店",
                "items": [
                    { "name": "情侣睡衣【2套价】女L送男3XL", "price": 75.65 }
                ]
            }
        ],
        "2023-04-18": [
            {
                "shop": "京东",
                "items": [
                    { "name": "realme真我GT Neo5 240W 16+1T 圣境白", "price": 3464.00 },
                    { "name": "九洲鹿 坐床式 蚊帐 道奇蓝 180*200cm", "price": 177.10 }
                ]
            }
        ],
        "2023-04-23": [
            {
                "shop": "美团",
                "items": [
                    { "name": "[通用]单人自助烤肉套餐*2", "price": 153.00 }
                ]
            }
        ],
        "2023-04-28": [
            {
                "shop": "京东",
                "items": [
                    { "name": "香袖小镇 防雨鞋套 防水加绒 棕色43-45码", "price": 29.90 },
                    { "name": "IQGD 拖鞋 女地板拖 简约粉色38-39 [适合37-38]", "price": 8.90 },
                    { "name": "雨航（YUHANG）单层夜光 藏青-牛津布-双帽-4XL", "price": 45.50 },
                    { "name": "优惠券", "price": -29.00 },
                    { "name": "雨航（YUHANG）电动车雨衣 天蓝-无镜套-双帽檐可视仪表盘", "price": 31.46 },
                    { "name": "洁丽雅 毛巾 A类长绒棉单条装-灰", "price": 9.40 },
                    { "name": "洁丽雅 毛巾 A类长绒棉单条装-粉", "price": 9.40 },
                    { "name": "优惠券", "price": -5.94 },
                    { "name": "闲鸟 3C认证头盔电动车 炫酷黑", "price": 59.4 },
                    { "name": "IQGD 拖鞋 女地板拖 简约灰色44-45 [适合43-44]", "price": 5.90 }
                ]
            }
        ],
        "2023-04-29": [
            {
                "shop": "京东",
                "items": [
                    { "name": "小米（MI）Redmi Buds 4 晴雪白", "price": 138.98 },
                    { "name": "俞兆林【10双装】袜子男士 混色中筒袜", "price": 17.91 },
                    { "name": "红豆内衣男士秋衣秋裤 铁灰185/110", "price": 56.70 },
                    { "name": "南极人抑菌男士内裤男冰丝 短裤头4条 3XL", "price": 35.88 },
                    { "name": "骑兵连（cavalry）自行车半指手套", "price": 12.40 }
                ]
            }
        ],
        "2023-05-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "小熊（Bear）电煮锅 蒸煮一体 DRG-E12L3", "price": 43.26 }
                ]
            }
        ],
        "2023-05-02": [
            {
                "shop": "京东",
                "items": [
                    { "name": "杰士爱堡罗（Jieshiaibaoluo）电动车挡风被", "price": 49.90 },
                    { "name": "摩多狼（MOTOWOLF）摩托车护膝护肘", "price": 126.39 }
                ]
            }
        ],
        "2023-05-07": [
            {
                "shop": "京东",
                "items": [
                    { "name": "妙馨思防盗门缝密封条", "price": 19.90 },
                    { "name": "南极人抗菌枕头枕芯一对装（2只）", "price": 37.80 },
                    { "name": "一三五八镂空垃圾桶 纸篓 9L 0326", "price": 5.90 },
                    { "name": "洁丽雅（Grace）床单单件 2*2.3米", "price": 30.00 },
                    { "name": "优惠券", "price": -11.36 },
                    { "name": "安可新一次性马桶垫50片 40*60cm", "price": 19.28 }
                ]
            }
        ],
        "2023-05-12": [
            {
                "shop": "京东",
                "items": [
                    { "name": "得力(deli)打包胶带 60mm*100y*50um(91.4m/卷)", "price": 10.35 },
                    { "name": "伊娃之恋 加厚气泡膜50米*30CM", "price": 31.90 },
                    { "name": "毕亚兹搬家纸箱无扣手60*40*50cm5个装", "price": 69.90 },
                    { "name": "优惠券", "price": -8.49 }
                ]
            }
        ],
        "2023-05-19": [
            {
                "shop": "京东",
                "items": [
                    { "name": "PLUS家电家居特权季卡", "price": 9.90 },
                    { "name": "苏泊尔（SUPOR）电饭煲电饭锅家用3-4人4L", "price": 248.98 },
                    { "name": "西昊M56 人体工学椅电脑椅", "price": 325.92 },
                    { "name": "黑白调P1人体工学椅电脑椅", "price": 326.00 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "单人素食自助", "price": 49.31 }
                ]
            }
        ],
        "2023-05-21": [
            {
                "shop": "京东",
                "items": [
                    { "name": "星骑侠裂行pcx160摩托车尾箱 45L", "price": 287.84 }
                ]
            }
        ],
        "2023-05-24": [
            {
                "shop": "京东",
                "items": [
                    { "name": "金士顿(Kingston) 1TB SSD固态硬盘", "price": 278.99 },
                    { "name": "七彩虹（Colorful）iGame GeForce RTX 3070 Ti Ultra W OC 8G 电脑显卡", "price": 3828.81 },
                    { "name": "雅浚（ProArtist） EA5/3二代升级款白色系列一体式240/360水冷散热器", "price": 318.00 },
                    { "name": "长城（Great Wall）海王星T7黑色海景房机箱", "price": 228.00 }
                ]
            }
        ],
        "2023-05-26": [
            {
                "shop": "京东",
                "items": [
                    { "name": "锐能钳子钢丝钳7英寸", "price": 9.49 }
                ]
            }
        ],
        "2023-05-28": [
            {
                "shop": "京东",
                "items": [
                    { "name": "漫步者（EDIFIER）M30 电脑音响音箱 蓝牙5.3", "price": 160.19 }
                ]
            }, {
                "shop": "淘宝",
                "note": "办公软件安装维护",
                "items": [
                    { "name": "11专业永久使用 10/11企业版【支持重装】", "price": 4.26 }
                ]
            }
        ],
        "2023-05-30": [
            {
                "shop": "京东",
                "items": [
                    { "name": "炊大皇 厨房家用不锈钢切菜刀", "price": 29.90 },
                    { "name": "爱仕达（ASD）菜板3cm加厚加大竹砧板", "price": 39.90 },
                    { "name": "优惠券", "price": -23.09 },
                    { "name": "运费", "price": 6.00 }
                ]
            }
        ],
        "2023-06-06": [
            {
                "shop": "京东",
                "items": [
                    { "name": "陶华碧老干妈 辣三丁油辣椒 280g", "price": 9.04 },
                    { "name": "金龙鱼 寒地东北大米 10斤*2", "price": 40.25 }
                ]
            }
        ],
        "2023-06-12": [
            {
                "shop": "PDD",
                "note": "天亿个护清洁专营店",
                "items": [
                    { "name": "飘柔 清爽去屑洗发露1kg", "price": 20.23 }
                ]
            }
        ],
        "2023-06-16": [
            {
                "shop": "PDD",
                "note": "智烁家居生活专营店",
                "items": [
                    { "name": "纳美小苏打牙膏 160g海盐*2支", "price": 14.37 }
                ]
            }
        ],
        "2023-06-17": [
            {
                "shop": "PDD",
                "note": "袋鼠医生官方旗舰店",
                "items": [
                    { "name": "袋鼠医生 啵啵巾婴儿湿巾【80抽/包】,5包装", "price": 19.47 }
                ]
            }, {
                "shop": "PDD",
                "note": "心相相印家居生活馆",
                "items": [
                    { "name": "心相印厨房纸【整箱8卷共600节】", "price": 21.52 }
                ]
            }, {
                "shop": "PDD",
                "note": "盐津铺子食品旗舰店",
                "items": [
                    { "name": "盐津铺子 60包荤素零食大礼包", "price": 14.60 }
                ]
            }
        ],
        "2023-06-19": [
            {
                "shop": "京东",
                "items": [
                    { "name": "陶华碧老干妈 干煸肉丝油辣椒260g", "price": 11.56 },
                    { "name": "电动车把小挂物包", "price": 11.27 },
                    { "name": "海天辣黄豆酱800g*1瓶", "price": 9.99 }
                ]
            }
        ],
        "2023-06-23": [
            {
                "shop": "美团",
                "items": [
                    { "name": "M级和牛畅吃", "price": 378.00 }
                ]
            }
        ],
        "2023-06-26": [
            {
                "shop": "PDD",
                "note": "美伊家女装",
                "items": [
                    { "name": "撞色纯棉女士t恤 蓝插肩 包包熊 M 98-110斤", "price": 19.65 }
                ]
            }, {
                "shop": "PDD",
                "note": "NASAOVER潮服官方旗舰店",
                "items": [
                    { "name": "NASA草莓熊短袖 克莱因蓝 NASA-215-M", "price": 23.38 }
                ]
            }
        ],
        "2023-06-29": [
            {
                "shop": "京东",
                "items": [
                    { "name": "福临门 非转基因一级大豆油1.8L", "price": 29.87 }
                ]
            }, {
                "shop": "PDD",
                "note": "犇淼家居专营店",
                "items": [
                    { "name": "维达卷纸 27卷【净重7.56斤】", "price": 48.79 }
                ]
            }
        ],
        "2023-07-01": [
            {
                "shop": "PDD",
                "note": "HOLDFREE旗舰店",
                "items": [
                    { "name": "冰丝运动裤 黑色+深灰色,3XL160-175斤", "price": 62.67 }
                ]
            }, {
                "shop": "PDD",
                "note": "鸿星尔克巨普专卖店",
                "items": [
                    { "name": "鸿星尔克防晒袖 光束冰袖 白+黑", "price": 11.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "禾沙运动专营店",
                "items": [
                    { "name": "361°黑色挂耳冰丝面罩", "price": 18.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "瑾绣衣坊",
                "items": [
                    { "name": "情侣睡衣 女L送男3XL", "price": 58.50 }
                ]
            }
        ],
        "2023-07-03": [
            {
                "shop": "PDD",
                "note": "电摩防雨罩直供",
                "items": [
                    { "name": "电动车防雨罩 双耳2.4米密码锁+钢丝绳", "price": 12.28 }
                ]
            }
        ],
        "2023-07-06": [
            {
                "shop": "淘宝",
                "note": "小韩家 轻熟套装",
                "items": [
                    { "name": "夏款 西装+裤子+衬衫(可系腰)XL[建议120-129斤]", "price": 137.52 }
                ]
            }
        ],
        "2023-07-15": [
            {
                "shop": "京东",
                "items": [
                    { "name": "福临门 特选东北长粒香大米 10斤/袋", "price": 20.59 }
                ]
            }
        ],
        "2023-07-20": [
            {
                "shop": "淘宝",
                "note": "ROMON罗蒙男装总店",
                "items": [
                    { "name": "罗蒙西服套装男士 两扣无白边黑色 西装+裤子+衬衫 4XL(建议165-185斤穿)", "price": 309.48 }
                ]
            }
        ],
        "2023-07-23": [
            {
                "shop": "京东",
                "items": [
                    { "name": "海澜之家HLA男鞋休闲皮鞋HAAXXM1EBF037 黑色44", "price": 188.92 }
                ]
            }
        ],
        "2023-07-24": [
            {
                "shop": "京东",
                "items": [
                    { "name": "澳柯玛（AUCMA）加湿冷风扇", "price": 179.36 }
                ]
            }
        ],
        "2023-07-26": [
            {
                "shop": "美团",
                "items": [
                    { "name": "甘食记成都肥肠粉单人餐", "price": 21.97 }
                ]
            }
        ],
        "2023-07-30": [
            {
                "shop": "美团",
                "items": [
                    { "name": "龍歌自助双人餐", "price": 119.80 }
                ]
            }
        ],
        "2023-08-01": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单人自助套餐", "price": 35.60 }
                ]
            }
        ],
        "2023-08-06": [
            {
                "shop": "美团",
                "items": [
                    { "name": "素满香·素食自助餐2人餐", "price": 59.00 }
                ]
            }
        ],
        "2023-08-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "realme真我GT Neo5 SE 16+1TB", "price": 2182.87 }
                ]
            }
        ],
        "2023-08-13": [
            {
                "shop": "京东",
                "items": [
                    { "name": "伊娃之恋 加厚气泡膜50米*30CM", "price": 31.90 },
                    { "name": "毕亚兹搬家纸箱无扣手60*40*50cm5个装", "price": 58.00 },
                    { "name": "优惠券", "price": -7.95 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "得力(deli)透明封箱胶带60mm*100y*50um(91.4m/卷)*3", "price": 27.46 }
                ]
            }
        ],
        "2023-08-14": [
            {
                "shop": "美团",
                "items": [
                    { "name": "大茶缸麻辣烫2人餐", "price": 32.71 }
                ]
            }
        ],
        "2023-08-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "贵宾花花（GUIBINPLAY）拖鞋 白色38-39", "price": 9.90 },
                    { "name": "贵宾花花（GUIBINPLAY）拖鞋 黑色44-45", "price": 9.90 },
                    { "name": "优惠券", "price": -0.98 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "九洲鹿A类抑菌被子可机洗水洗双人儿童被子180×200cm", "price": 48.90 },
                    { "name": "南极人枕套 一对装枕芯套枕头套 48*74cm", "price": 19.90 },
                    { "name": "南极人抗菌枕头枕芯一对装（2只）", "price": 49.90 },
                    { "name": "优惠券", "price": -35.03 }
                ]
            }, {
                "shop": "PDD",
                "note": "洁丽雅君仕专卖店_902973",
                "items": [
                    { "name": "洁丽雅毛巾 4条装【粉+蓝+米+灰】", "price": 25.90 }
                ]
            }
        ],
        "2023-08-17": [
            {
                "shop": "京东",
                "items": [
                    { "name": "宝迪妮（Baodini）全自动雨伞便携折叠 48骨梦幻黑", "price": 14.71 }
                ]
            }
        ],
        "2023-08-19": [
            {
                "shop": "京东",
                "items": [
                    { "name": "VICTORIATOURIST双肩包 17.3英寸 黑色", "price": 134.98 }
                ]
            }, {
                "shop": "天猫",
                "note": "挑枣儿官方旗舰店",
                "items": [
                    { "name": "陕西黄金蜜瓜4.5斤装 3斤:500g+", "price": 0.01 }
                ]
            }, {
                "shop": "天猫",
                "note": "FLYCO飞科官方旗舰店",
                "items": [
                    { "name": "飞科剃须刀 FS903黑色", "price": 154.44 }
                ]
            }, {
                "shop": "PDD",
                "note": "爱丽玛家居卫浴用品",
                "items": [
                    { "name": "马桶坐垫圈【2只装】春夏条绒-粉色+灰色", "price": 8.80 }
                ]
            }, {
                "shop": "PDD",
                "note": "广粤家居专营店",
                "items": [
                    { "name": "舒肤佳沐浴露 青瓜400g", "price": 9.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "涵妆居家日用专营店",
                "items": [
                    { "name": "力士洗发水 奢养黑亮 330mL", "price": 15.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "杨树先生家居生活专营店",
                "items": [
                    { "name": "正品清扬洗发水 劲爽控油570g1瓶", "price": 25.50 }
                ]
            }, {
                "shop": "PDD",
                "note": "相宜本草宜妆专卖店",
                "items": [
                    { "name": "相宜本草洗面奶 洗颜泥100g", "price": 9.80 }
                ]
            }, {
                "shop": "PDD",
                "note": "EHD官方旗舰店",
                "items": [
                    { "name": "EHD美白防晒霜60g*1支装", "price": 69.00 }
                ]
            }
        ],
        "2023-08-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "京东京造东北大米2.5kg*1", "price": 9.89 }
                ]
            }
        ],
        "2023-09-05": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 2.5kg*2", "price": 27.96 }
                ]
            }
        ],
        "2023-09-10": [
            {
                "shop": "美团",
                "items": [
                    { "name": "晚餐周末节假日通用餐", "price": 170.00 }
                ]
            }
        ],
        "2023-09-13": [
            {
                "shop": "PDD",
                "note": "GLM时尚男装旗舰店",
                "items": [
                    { "name": "森马男裤冰丝 黑色+深灰【两件装】3XL", "price": 52.66 }
                ]
            }, {
                "shop": "PDD",
                "note": "高洁丝旗舰店",
                "items": [
                    { "name": "高洁丝卫生巾【日夜42片】", "price": 21.74 }
                ]
            }
        ],
        "2023-09-14": [
            {
                "shop": "PDD",
                "note": "盛祥亿都旗舰店",
                "items": [
                    { "name": "三本针 半袖打底衫 白色 XXL", "price": 18.20 }
                ]
            }
        ],
        "2023-09-23": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 2.5kg", "price": 18.78 }
                ]
            }
        ],
        "2023-09-24": [
            {
                "shop": "京东",
                "items": [
                    { "name": "凤起德州脱骨扒鸡500g", "price": 15.95 }
                ]
            }
        ],
        "2023-09-26": [
            {
                "shop": "美团",
                "items": [
                    { "name": "大玩居VR·PS5·解压游乐场（奉化银泰）", "price": 38.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "miiow猫人洋翊专卖店",
                "items": [
                    { "name": "猫人袜子 深灰+浅灰+藏青+白色+黑色【5双装】均码(39-44码)", "price": 20.21 }
                ]
            }, {
                "shop": "企",
                "note": "玲珑阁品质好袜",
                "items": [
                    { "name": "白色袜子女中筒袜 奶白+卡其+浅咖+深咖+黑色[5双组合J]", "price": 11.77 }
                ]
            }, {
                "shop": "天猫",
                "note": "黛尔佳人旗舰店",
                "items": [
                    { "name": "女士内裤女 天气D组【加送2条，实发7条】XL(适合110-130斤)", "price": 25.9 }
                ]
            }
        ],
        "2023-09-27": [
            {
                "shop": "PDD",
                "note": "维达VINDA云力专卖店",
                "items": [
                    { "name": "维达卷纸 1提12卷【1440节】", "price": 17.69 }
                ]
            }
        ],
        "2023-09-28": [
            {
                "shop": "PDD",
                "note": "卓诗尼诗源专卖店",
                "items": [
                    { "name": "卓诗尼甜酷乐福鞋女 黑色 39", "price": 70.00 }
                ]
            }
        ],
        "2023-09-30": [
            {
                "shop": "PDD",
                "note": "维达官方旗舰店",
                "items": [
                    { "name": "维达厨房专用卷纸4卷【可水洗共300节】", "price": 12.70 }
                ]
            }, {
                "shop": "PDD",
                "note": "妍恩琪服饰箱包专营店",
                "items": [
                    { "name": "乐福鞋后跟贴 黑色圆头可裁剪/防掉跟,39", "price": 4.58 }
                ]
            }
        ],
        "2023-10-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "手机支架 石墨黑 360旋转自由升降折叠便携", "price": 4.41 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "古松 火锅川粉220g", "price": 3.90 },
                    { "name": "富昌 腐竹500g", "price": 28.90 },
                    { "name": "优惠券", "price": -15.69 },
                    { "name": "运费", "price": 6.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "美居优品家居生活馆_821592",
                "items": [
                    { "name": "土豆丝擦丝器【优质304不锈钢】", "price": 7.90 }
                ]
            }
        ],
        "2023-10-02": [
            {
                "shop": "企",
                "note": "味千寻",
                "items": [
                    { "name": "正宗好欢螺螺蛳粉【9月日期】加辣加臭400g*3袋", "price": 30.10 }
                ]
            }
        ],
        "2023-10-03": [
            {
                "shop": "淘宝",
                "note": "食品零食店",
                "items": [
                    { "name": "卫龙亲嘴烧100片整盒 三口味各一盒【共120片】", "price": 32.99 }
                ]
            }
        ],
        "2023-10-12": [
            {
                "shop": "盒马",
                "items": [
                    { "name": "NB哈尔滨风味红肠 240g/袋", "price": 10.90 }
                ]
            }
        ],
        "2023-10-13": [
            {
                "shop": "美团",
                "items": [
                    { "name": "王大铲铁锅炖2人餐", "price": 118.00 }
                ]
            }
        ],
        "2023-10-17": [
            {
                "shop": "美团",
                "items": [
                    { "name": "锦里巷·美蛙自助火锅2人餐", "price": 168.00 }
                ]
            }
        ],
        "2023-10-18": [
            {
                "shop": "美团",
                "items": [
                    { "name": "老妈米线单人餐", "price": 25.90 }
                ]
            }
        ],
        "2023-10-19": [
            {
                "shop": "美团",
                "items": [
                    { "name": "素满香·全民素食自助单人素食自助餐", "price": 57.80 }
                ]
            }
        ],
        "2023-10-25": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 16:01 时长:15分33秒", "price": 1.50 }
                ]
            }
        ],
        "2023-10-26": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 18:27 时长:12分19秒", "price": 1.50 },
                    { "name": "单车 14:40 时长:5分42秒", "price": 1.50 },
                    { "name": "单车 11:26 时长:23分17秒", "price": 2.50 }
                ]
            }
        ],
        "2023-10-27": [
            {
                "shop": "京东",
                "items": [
                    { "name": "山东联通手机话费充值100元", "price": 96.98 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "单车 08:07 时长:5分15秒", "price": 1.50 }
                ]
            }
        ],
        "2023-10-28": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 14:35 时长:11分7秒", "price": 1.50 },
                    { "name": "单车 12:54 时长:21分44秒", "price": 2.50 },
                    { "name": "单车 11:25 时长:5分11秒", "price": 1.50 }
                ]
            }
        ],
        "2023-10-29": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 15:46 时长:9分37秒", "price": 1.50 },
                    { "name": "单车 15:13 时长:8分54秒", "price": 1.50 }
                ]
            }
        ],
        "2023-10-31": [
            {
                "shop": "美团",
                "items": [
                    { "name": "华莱士·全鸡汉堡[招牌]脆皮全鸡", "price": 15.70 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "单车 09:33 时长:8分4秒", "price": 1.50 }
                ]
            }
        ],
        "2023-11-02": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 150.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3304.00 }
                ]
            }
        ],
        "2023-11-03": [
            {
                "shop": "京东",
                "items": [
                    { "name": "IQGD拖鞋 灰色 44-45", "price": 9.90 },
                    { "name": "IQGD拖鞋 粉色 38-39", "price": 9.90 },
                    { "name": "优惠券", "price": -7.96 },
                    { "name": "运费", "price": 4.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "Sodolike 尚岛 150只装 垃圾袋50*65cm*5卷", "price": 11.80 },
                    { "name": "西玛易嘉11L 黑色拉级捅篓", "price": 7.50 },
                    { "name": "优惠券", "price": -6.72 },
                    { "name": "运费", "price": 2.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "气泡柱 打包膜 25cm高 50米【默认赠送打气筒】", "price": 35.00 },
                    { "name": "伊娃之恋 加厚气泡膜50米*30CM", "price": 28.50 },
                    { "name": "QDZX搬家纸箱无扣手 80*50*60（5个大号)", "price": 133.00 },
                    { "name": "得力(deli)透明封箱胶带 60mm*100y*50um(91.4m/卷)", "price": 19.40 }
                ]
            }
        ],
        "2023-11-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "第六感避孕套 超薄情趣72只", "price": 33.99 },
                    { "name": "名流 避孕套超薄 72只", "price": 22.53 }
                ]
            }
        ],
        "2023-11-05": [
            {
                "shop": "PDD",
                "note": "安怡家居专营店",
                "items": [
                    { "name": "撑衣杆不锈钢可伸缩 冰魄蓝,总长1.14米铝叉", "price": 8.24 }
                ]
            }, {
                "shop": "顺丰",
                "note": "顺丰速运",
                "items": [
                    { "name": "宁波奉化区锦屏街道河头路132-6号欧姆乐公寓→嘉定区菊园新区陈家山路1601号路劲隽寓19号楼B座", "price": 208.00 }
                ]
            }
        ],
        "2023-11-06": [
            {
                "shop": "京东",
                "items": [
                    { "name": "双枪（Suncha）天然竹砧板 33*23*1.8cm", "price": 17.88 },
                    { "name": "苏泊尔（SUPOR）电饭煲饭勺汤勺量杯食品PP塑料不粘3件套", "price": 19.93 },
                    { "name": "十月稻田 长粒香大米 2.5kg", "price": 17.96 }
                ]
            }, {
                "shop": "天猫",
                "note": "carote卡罗特官方旗舰店",
                "items": [
                    { "name": "卡罗特硅胶铲子 木柄硅胶菜铲(白)", "price": 15.73 }
                ]
            }, {
                "shop": "PDD",
                "note": "金羚家居官方旗舰店",
                "items": [
                    { "name": "马桶垫 可爱熊zy【蓝色+黄色】", "price": 14.00 }
                ]
            }
        ],
        "2023-11-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "妙洁 海绵百洁布 四色分用 8片装", "price": 7.72 }
                ]
            }, {
                "shop": "天猫",
                "note": "澳宝化妆品旗舰店",
                "items": [
                    { "name": "【超值购】澳宝沐浴露橙花补水500ml;橙花白茶沐浴露", "price": 7.99 }
                ]
            }
        ],
        "2023-11-11": [
            {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）厨房卷纸 可水洗75节*8卷", "price": 21.89 },
                    { "name": "十月稻田 长粒香大米 5kg", "price": 26.90 }
                ]
            }, {
                "shop": "天猫",
                "note": "力东鸣居家日用专营店",
                "items": [
                    { "name": "舒蕾洗发水 蚕丝顺滑去屑洗发露600ml", "price": 18.6 }
                ]
            }
        ],
        "2023-11-12": [
            {
                "shop": "PDD",
                "note": "卡其服饰店",
                "items": [
                    { "name": "高腰德绒秋裤女,XL适合100-125斤,黑色+玫红色", "price": 23.76 }
                ]
            }
        ],
        "2023-11-13": [
            {
                "shop": "天猫",
                "note": "fzt旗舰店",
                "items": [
                    { "name": "踩屎感男士棉拖鞋男 48-49【适合47-48】深灰【羽绒升级款】", "price": 16.83 }
                ]
            }
        ],
        "2023-11-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "卫龙辣条大面筋650g", "price": 11.81 },
                    { "name": "暖火暖宝宝暖贴通用20片", "price": 7.16 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "舒客成人软毛牙刷舒克炭丝能量 备长炭4支装", "price": 3.72 }
                ]
            }
        ],
        "2023-11-19": [
            {
                "shop": "PDD",
                "note": "哈蜜蜜童装店_296103",
                "items": [
                    { "name": "Mardi玛尔蒂卫衣女x刺绣燕麦绿花 均码", "price": 79.00 }
                ]
            }
        ],
        "2023-11-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "艺姿平板拖把 2块布38cm", "price": 14.82 }
                ]
            }
        ],
        "2023-11-24": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3360.00 }
                ]
            }
        ],
        "2023-11-25": [
            {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "十月稻田 长粒香米 2.5kg; 1件", "price": 11.96 }
                ]
            }
        ],
        "2023-11-28": [
            {
                "shop": "美团",
                "items": [
                    { "name": "茶百道现蒸超厚芋泥奶茶/奶绿2选1", "price": 13.20 }
                ]
            }, {
                "shop": "企",
                "note": "啊鲤鱼潮流店",
                "items": [
                    { "name": "Kakao可拆卸线1万毫安充电宝10000mAh;屁桃款[1台]", "price": 1.00 }
                ]
            }
        ],
        "2023-12-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 5kg", "price": 21.04 }
                ]
            }
        ],
        "2023-12-02": [
            {
                "shop": "京东",
                "items": [
                    { "name": "金龙鱼 食用油 900mL", "price": 16.43 }
                ]
            }, {
                "shop": "淘宝",
                "note": "0I0I线上店",
                "items": [
                    { "name": "【正品】韩国潮牌rose朴彩英oioi卫衣 oioi藏青色【加绒加厚】M", "price": 91.47 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 100.00 }
                ]
            }
        ],
        "2023-12-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "塑料布加厚透明塑料薄膜 3米宽3米长 厚度8s", "price": 12.00 }
                ]
            }
        ],
        "2023-12-08": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2023-12-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "洁柔有芯卷纸 蓝面子加厚4层140g*12卷", "price": 18.88 },
                    { "name": "双枪红檀木筷子天然抗菌木筷 10双", "price": 19.82 }
                ]
            }, {
                "shop": "天猫",
                "note": "骆驼官方旗舰店",
                "items": [
                    { "name": "骆驼行者小红书同款卫衣 亚麻棕(男女同款);2XL[160-180斤]", "price": 125.43 }
                ]
            }
        ],
        "2023-12-14": [
            {
                "shop": "天猫",
                "note": "恒安生活馆",
                "items": [
                    { "name": "心相印厨房用纸吸油吸水厨房纸 套餐三", "price": 10.51 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2023-12-17": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 28.83 }
                ]
            }
        ],
        "2023-12-20": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2023-12-21": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2023-12-23": [
            {
                "shop": "PDD",
                "note": "橙晴防护专营店",
                "items": [
                    { "name": "一次性手套 丁腈 白色【100只装】", "price": 12.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "小丫头de店铺_748474",
                "items": [
                    { "name": "门窗密封条1.5厘米宽【灰色】2卷4米", "price": 3.41 }
                ]
            }, {
                "shop": "PDD",
                "note": "兴利天兴家居用品店",
                "items": [
                    { "name": "强力EVA白色海绵门窗密封胶条1.5cm宽【单面胶】5mm厚【2m长】", "price": 4.47 }
                ]
            }
        ],
        "2023-12-24": [
            {
                "shop": "京东",
                "items": [
                    { "name": "马应龙麝香痔疮膏4g*6支/盒", "price": 20.12 },
                    { "name": "维达（Vinda）蓝色经典4层140克*24卷", "price": 30.15 }
                ]
            }, {
                "shop": "PDD",
                "note": "天天惠家居折扣馆",
                "items": [
                    { "name": "可折叠伸缩盆【大中小】三件套", "price": 9.30 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2023-12-25": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3360.00 }
                ]
            }
        ],
        "2023-12-26": [
            {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 100.00元", "price": 99.01 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "[感康]复方氨酚烷胺片6片*2板/盒", "price": 1.59 },
                    { "name": "[都乐]金嗓子喉片2g*6片*2板/盒", "price": 7.82 },
                    { "name": "[日康]对乙酰氨基酚片0.3g*12片*2板/盒", "price": 5.49 },
                    { "name": "配送费", "price": 2.00 }
                ]
            }
        ],
        "2023-12-27": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2023-12-30": [
            {
                "shop": "京东",
                "items": [
                    { "name": "洁婷 日夜用卫生巾组合樱花透气双U姨妈巾10包68片", "price": 24.12 }
                ]
            }
        ],
        "2023-12-31": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 100.00 }
                ]
            }
        ],
        "2024-01-01": [
            {
                "shop": "PDD",
                "note": "连云港鲁花粮油米面专卖店",
                "items": [
                    { "name": "鲁花 花生油,1L*1瓶", "price": 30.40 }
                ]
            }, {
                "shop": "PDD",
                "note": "纳美居家日用旗舰店",
                "items": [
                    { "name": "纳美小苏打牙膏 海盐160g+龙井160g", "price": 14.45 }
                ]
            }
        ],
        "2024-01-02": [
            {
                "shop": "PDD",
                "note": "龙游天虾食品旗舰店",
                "items": [
                    { "name": "四川特产 红花椒250g", "price": 15.65 }
                ]
            }
        ],
        "2024-01-03": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 33.90 },
                    { "name": "陶华碧老干妈 风味鸡油辣椒 280g", "price": 12.71 }
                ]
            }
        ],
        "2024-01-07": [
            {
                "shop": "天猫",
                "note": "五月花官方旗舰店",
                "items": [
                    { "name": "五月花厨房纸 套餐一", "price": 7.40 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-01-10": [
            {
                "shop": "PDD",
                "note": "顺心日化天天",
                "items": [
                    { "name": "牙刷,家庭装【陆支装】", "price": 4.80 }
                ]
            }
        ],
        "2024-01-12": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-01-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 29.76 },
                    { "name": "陶华碧老干妈 辣三丁油辣椒 280g", "price": 10.48 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3147.59 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 115.86 }
                ]
            }
        ],
        "2024-01-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "双立人（ZWILLING）炒锅不粘锅 Enjoy30cm电磁炉燃气灶通用", "price": 398.98 }
                ]
            }
        ],
        "2024-01-17": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-01-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "手擀面", "price": 2.51 },
                    { "name": "鸡胸肉", "price": 3.74 },
                    { "name": "杏鲍菇", "price": 2.54 },
                    { "name": "鸡翅中", "price": 11.91 },
                    { "name": "大葱", "price": 1.97 },
                    { "name": "五香干", "price": 2.33 },
                    { "name": "大蒜", "price": 4.24 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 3.83 },
                    { "name": "木鲜子松花鸭皮蛋6枚 375g", "price": 11.35 },
                    { "name": "新鲜猪小排 约400g", "price": 12.98 },
                    { "name": "三红胡萝卜 约600g", "price": 2.03 },
                    { "name": "白萝卜 约1kg", "price": 2.03 },
                    { "name": "香菜 约100g", "price": 1.62 },
                    { "name": "土豆 约600g", "price": 1.81 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "小平菇 200g/份", "price": 3.92 },
                    { "name": "蒜苔（白帽）约300g", "price": 5.66 },
                    { "name": "茄子（精选）约800g", "price": 5.81 },
                    { "name": "黄瓜 约600g", "price": 3.26 },
                    { "name": "鲜活优养优饲虎背鲈鱼 约450g", "price": 10.11 },
                    { "name": "优质番茄 约500g", "price": 3.36 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "康师傅 西红柿牛腩 85g*5", "price": 13.90 },
                    { "name": "康师傅 双萝卜牛腩面 104g*5", "price": 13.90 },
                    { "name": "优惠券", "price": -11.57 },
                    { "name": "运费", "price": 6.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "面包新语breadtalk牛乳厚切吐司 400g", "price": 12.11 },
                    { "name": "维达（Vinda）厨房卷纸 可水洗75节*8卷", "price": 19.05 }
                ]
            }, {
                "shop": "天猫",
                "note": "黛尔佳人旗舰店",
                "items": [
                    { "name": "内裤女士 纯色D组【加送2条，实发7条】XL[(适合110-130斤)", "price": 27.70 }
                ]
            }
        ],
        "2024-01-23": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-01-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "宽面", "price": 3.13 },
                    { "name": "老干妈", "price": 11.97 },
                    { "name": "白象方便面", "price": 11.97 },
                    { "name": "挂面", "price": 7.15 },
                    { "name": "鸡蛋", "price": 14.88 },
                    { "name": "小葱", "price": 0.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "三全猪肉芹菜水饺 1kg/袋", "price": 11.76 },
                    { "name": "三全韭菜鸡蛋素水饺 500g/袋", "price": 14.04 },
                    { "name": "三全三鲜水饺 1kg/袋", "price": 11.78 }
                ]
            }
        ],
        "2024-01-25": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-01-26": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 5kg", "price": 35.89 }
                ]
            }
        ],
        "2024-01-27": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-01-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "皱皮辣椒", "price": 2.64 },
                    { "name": "撒尿牛丸", "price": 17.49 },
                    { "name": "大白菜", "price": 2.64 },
                    { "name": "大葱", "price": 2.46 },
                    { "name": "土豆", "price": 3.25 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 2.5kg", "price": 18.84 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "0T男茶【当季草莓】经典回归2", "price": 24.80 },
                    { "name": "PHO MI粉迷越南粉2人餐", "price": 108.00 }
                ]
            }
        ],
        "2024-01-29": [
            {
                "shop": "天猫",
                "note": "三只松鼠旗舰店",
                "items": [
                    { "name": "三只松鼠大礼包【9袋/1465g】4袋坚果 2袋炒货", "price": 45.35 }
                ]
            }
        ],
        "2024-01-30": [
            {
                "shop": "京东",
                "items": [
                    { "name": "海天 生抽 1.9L", "price": 10.04 },
                    { "name": "麦格萌 姨妈月经防水垫 50*70cm", "price": 17.80 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "双汇 Q趣香肠 香辣风味 80g*5支", "price": 14.00 },
                    { "name": "双汇 Q趣香肠 孜然风味 80g*5支", "price": 14.00 },
                    { "name": "优惠券", "price": -0.18 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "水塔陈醋4° 420ml", "price": 6.90 },
                    { "name": "水塔老陈醋6° 420ml", "price": 7.50 },
                    { "name": "优惠券", "price": -4.37 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "利得一次性手撕保鲜膜30cm*100m", "price": 4.78 }
                ]
            }
        ],
        "2024-02-01": [
            {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 200.00元", "price": 197.21 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 100.00 }
                ]
            }
        ],
        "2024-02-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "呷哺蘸料", "price": 3.70 },
                    { "name": "土鸡蛋", "price": 0.00 },
                    { "name": "叮咚牛肉酱", "price": 3.20 },
                    { "name": "海底捞蘸料", "price": 3.70 },
                    { "name": "冷冻肥牛卷", "price": 27.15 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "土鸡蛋8枚 440g", "price": 0.00 },
                    { "name": "螺丝椒 约300g", "price": 3.58 },
                    { "name": "雪榕金针菇 150g", "price": 1.35 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.39 },
                    { "name": "香菜 约100g", "price": 1.99 },
                    { "name": "冷冻牛腩块 1kg", "price": 35.89 },
                    { "name": "安心绿豆芽 300g/份", "price": 2.39 },
                    { "name": "新土豆 约600g", "price": 2.31 },
                    { "name": "三红胡萝卜 约600g", "price": 1.93 },
                    { "name": "小葱 20g", "price": 0.00 }
                ]
            }
        ],
        "2024-02-05": [
            {
                "shop": "京东",
                "items": [
                    { "name": "金锣 精制哈尔滨风味红肠 135g", "price": 5.98 },
                    { "name": "卫龙香辣小鱼仔150g/袋", "price": 10.93 },
                    { "name": "鲁花 花生油 1L", "price": 32.14 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "新边界（new boundaries）无核白葡萄干500g", "price": 12.90 },
                    { "name": "比比赞（BIBIZAN）日式秋刀鱼香辣味100g", "price": 8.90 },
                    { "name": "比比赞（BIBIZAN）小鱼仔混合味70g", "price": 6.90 },
                    { "name": "周黑鸭 甜辣卤鸭脖215g", "price": 18.60 },
                    { "name": "比比赞（BIBIZAN）虎皮凤爪【卤香味】105g", "price": 15.90 },
                    { "name": "优惠券", "price": -19.35 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "凤起德州脱骨扒鸡500g", "price": 14.63 }
                ]
            }
        ],
        "2024-02-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "西兰花", "price": 5.19 },
                    { "name": "番茄", "price": 6.29 },
                    { "name": "土鸡蛋", "price": 0.00 },
                    { "name": "香糟凤爪", "price": 11.94 },
                    { "name": "虎皮凤爪", "price": 11.88 },
                    { "name": "螺丝椒", "price": 4.19 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "马应龙麝香痔疮膏4g*12支/盒", "price": 35.70 }
                ]
            }
        ],
        "2024-02-08": [
            {
                "shop": "京东",
                "items": [
                    { "name": "得力(deli)高透明封箱胶带 60mm*100y*50um(91.4m/卷)", "price": 8.40 }
                ]
            }
        ],
        "2024-02-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "水磨糯米粉", "price": 11.61 },
                    { "name": "三全牛肉大葱水饺", "price": 7.66 },
                    { "name": "三全大黄米黑芝麻汤圆", "price": 6.67 },
                    { "name": "旺仔复原乳牛奶", "price": 9.89 },
                    { "name": "娃哈哈AD钙奶", "price": 8.50 },
                    { "name": "思念手打天下姬松茸素三鲜水饺", "price": 14.33 },
                    { "name": "新西兰小公牛天萃庭冷鲜牛腩", "price": 27.13 },
                    { "name": "皱皮青椒", "price": 2.71 },
                    { "name": "新土豆", "price": 4.16 },
                    { "name": "优质番茄", "price": 5.61 },
                    { "name": "海南皱皮蜜宝红心火龙果", "price": 13.52 },
                    { "name": "有豆志手工攸县香干", "price": 4.80 },
                    { "name": "有豆志中百页", "price": 4.99 },
                    { "name": "去根松花菜", "price": 3.53 },
                    { "name": "正大优选鸭腿", "price": 9.89 },
                    { "name": "深海大虾", "price": 10.85 },
                    { "name": "一点小葱", "price": 0.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜活优养溪泉草鱼 1条 约1.5kg", "price": 26.95 },
                    { "name": "蔡长青吮指鸭锁骨 160g (微辣)", "price": 8.74 },
                    { "name": "低盐有豆志腐竹 210g/袋", "price": 8.74 },
                    { "name": "白萝卜 约1kg", "price": 2.28 },
                    { "name": "螺丝椒 约300g", "price": 3.52 },
                    { "name": "小平菇 200g/份", "price": 3.79 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 7.46 },
                    { "name": "海欣火锅优选包 400g/袋", "price": 17.58 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 13.16 },
                    { "name": "三全大黄米黑芝麻汤圆 400g/袋", "price": 6.55 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }
        ],
        "2024-02-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "英科医疗（INTCO）一次性手套食品级丁腈 L大码100只/盒", "price": 17.32 }
                ]
            }
        ],
        "2024-02-11": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 100.00 }
                ]
            }
        ],
        "2024-02-12": [
            {
                "shop": "京东",
                "items": [
                    { "name": "绿伞洁厕宝 马桶洁厕块 50g*5块", "price": 9.90 },
                    { "name": "巨奇严选 下水道除臭剂 500ml*1", "price": 19.90 },
                    { "name": "优惠券", "price": -14.98 },
                    { "name": "运费", "price": 6.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "嘟咔熊手口湿巾 80抽*3包", "price": 8.91 }
                ]
            }
        ],
        "2024-02-13": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-02-15": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "精选单冻鸡琵琶腿 500g", "price": 8.96 },
                    { "name": "冷鲜鸡翅中 400g", "price": 15.30 },
                    { "name": "澳洲冷鲜牛腿肉 400g", "price": 27.08 },
                    { "name": "优养溪泉草鱼 约1.5kg", "price": 30.34 },
                    { "name": "三红胡萝卜 约600g", "price": 2.16 },
                    { "name": "白萝卜 约1kg", "price": 3.07 },
                    { "name": "鲍汁烩明虾味薯片 60g", "price": 6.29 },
                    { "name": "皱皮青椒 约300g", "price": 3.34 },
                    { "name": "紫皮大蒜 约350g", "price": 5.42 },
                    { "name": "大白菜 约1.6kg", "price": 3.07 },
                    { "name": "新土豆 约1kg", "price": 4.15 },
                    { "name": "优质番茄 约500g", "price": 5.60 },
                    { "name": "鸡肉火腿肠 30g*9/袋", "price": 6.29 },
                    { "name": "三全猪肉芹菜水饺 1kg/袋", "price": 13.56 },
                    { "name": "小葱 20g", "price": 0.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝矿泉水 6L*3", "price": 26.40 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "陶华碧老干妈 风味鸡油辣椒280g", "price": 11.51 },
                    { "name": "海天 黄豆酱 340g", "price": 7.30 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "康师傅 牛尾汤面五连包109g*5", "price": 17.50 },
                    { "name": "康师傅 日式豚骨面 五连包", "price": 17.50 },
                    { "name": "优惠券", "price": -11.47 },
                    { "name": "运费", "price": 3.54 }
                ]
            }
        ],
        "2024-02-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 33.91 }
                ]
            }
        ],
        "2024-02-19": [
            {
                "shop": "京东",
                "items": [
                    { "name": "猫人【100%纯棉袜5双】男士袜子", "price": 24.89 }
                ]
            }
        ],
        "2024-02-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "今麦郎 番茄牛肉拉面五连包*2", "price": 20.42 },
                    { "name": "CP正大食品(CP) 台湾烤肠 500g", "price": 14.39 },
                    { "name": "克拉古斯 270g 哈尔滨风味红肠3支装", "price": 8.90 },
                    { "name": "克拉古斯 850g 蒜香烤肠85g*10袋", "price": 27.90 },
                    { "name": "优惠券", "price": -0.31 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "大希地火山石烤肠 肉肠1016g/20根", "price": 24.70 }
                ]
            }
        ],
        "2024-02-21": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-02-22": [
            {
                "shop": "京东",
                "items": [
                    { "name": "得力（deli）除胶剂", "price": 8.28 },
                    { "name": "心相印 75节*8卷纸", "price": 20.07 },
                    { "name": "温氏 供港三黄鸡 1kg*2", "price": 53.80 },
                    { "name": "天乐优选麻阳冰糖橙 5斤 单果60-65mm", "price": 9.90 },
                    { "name": "蒙牛优牧 布丁牛奶口味雪糕 40g*20支/盒", "price": 18.75 },
                    { "name": "鲜京采 鸡琵琶腿 1kg*3", "price": 48.00 }
                ]
            }
        ],
        "2024-02-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水", "price": 23.40 }
                ]
            },
            {
                "shop": "叮咚",
                "items": [
                    { "name": "思念大黄米小小汤圆", "price": 12.90 },
                    { "name": "蒙牛低脂高钙风味酸牛奶", "price": 14.90 },
                    { "name": "海底捞火锅蘸料原味", "price": 7.90 },
                    { "name": "去根松花菜", "price": 4.19 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "千禾白醋5度 500mL", "price": 6.00 },
                    { "name": "中盐  精制盐500g", "price": 3.00 },
                    { "name": "优惠券", "price": -7.35 },
                    { "name": "运费", "price": 6.00 },
                    { "name": "华都食品奥尔良腿排1kg", "price": 39.90 },
                    { "name": "温氏 生鲜鸭全腿1kg", "price": 34.90 },
                    { "name": "优惠券", "price": -37.34 },
                    { "name": "草原红太阳火锅蘸料（美味）165g*3", "price": 19.50 },
                    { "name": "草原红太阳火锅蘸料（香辣）165g*3", "price": 19.50 },
                    { "name": "优惠券", "price": -14.62 },
                    { "name": "云山半0脂肪玉米面条挂面250g", "price": 9.36 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "臻牛倌正宗潮汕手打牛肉丸250g*1", "price": 22.00 },
                    { "name": "潮兴记 黄金鱼豆腐250g*1", "price": 20.50 },
                    { "name": "潮夫道牛筋丸250g*4", "price": 86.40 },
                    { "name": "潮夫道牛肉丸潮汕手打250g*3", "price": 64.80 },
                    { "name": "潮味码头潮汕手打牛肉丸150g*2", "price": 32.00 },
                    { "name": "优惠券", "price": -115.86 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3260.00 }
                ]
            }
        ],
        "2024-02-24": [
            {
                "shop": "京东",
                "items": [
                    { "name": "佳驰 一次性牙签 1000支", "price": 4.62 },
                    { "name": "利得大号垃圾袋 150只 50cm*60cm", "price": 5.87 },
                    { "name": "尚烤佳（Suncojia） 铝箔纸 锡纸20米", "price": 6.54 }
                ]
            }
        ],
        "2024-02-25": [
            {
                "shop": "京东",
                "items": [
                    { "name": "米德恩 气囊梳【茉莉粉】带清洁刷", "price": 5.80 },
                    { "name": "静闲居粘钩 透明挂钩10个装", "price": 2.80 }
                ]
            }
        ],
        "2024-02-26": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-02-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "非转基因大豆有豆志中百页", "price": 5.50 },
                    { "name": "三红胡萝卜", "price": 2.19 },
                    { "name": "北大荒有机酸菜丝", "price": 12.50 },
                    { "name": "白萝卜", "price": 2.99 },
                    { "name": "大白菜", "price": 3.99 },
                    { "name": "新土豆", "price": 4.79 },
                    { "name": "优质番茄", "price": 5.89 },
                    { "name": "老姜", "price": 5.79 },
                    { "name": "统一汤达人酸酸辣辣豚骨拉面", "price": 19.90 },
                    { "name": "精选冷冻肥牛卷", "price": 28.53 },
                    { "name": "白象招牌猪骨汤面", "price": 13.90 },
                    { "name": "无抗保洁鲜鸡蛋", "price": 17.97 },
                    { "name": "统一老坛酸菜面", "price": 12.50 },
                    { "name": "叮咚好食汇红薯粉条", "price": 12.90 },
                    { "name": "杏鲍菇", "price": 3.29 },
                    { "name": "大葱", "price": 3.49 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "卫龙辣条大面筋香辣味65g", "price": 18.89 },
                    { "name": "川娃子 速食火锅宽粉240g*3", "price": 9.57 },
                    { "name": "云山半东北酸菜丝500g*2", "price": 17.20 },
                    { "name": "优惠券", "price": -4.97 },
                    { "name": "华田禾邦上都烤面筋串800g 20串", "price": 17.28 }
                ]
            }
        ],
        "2024-02-28": [
            {
                "shop": "京东",
                "items": [
                    { "name": "三全 三鲜口味饺子 1kg约54只*3", "price": 30.00 },
                    { "name": "思念玉米蔬菜猪肉蒸煎饺 1kg52只*3", "price": 29.70 },
                    { "name": "思念 猪肉芹菜花边水饺 500g29只*3", "price": 18.24 }
                ]
            }
        ],
        "2024-03-02": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 27.95 },
                    { "name": "PLUS京典年卡 PLUS会员卡", "price": 99.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 100.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-03-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "老管家 管道除臭剂 1L", "price": 14.17 }
                ]
            }, {
                "shop": "天猫",
                "note": "联合利华官方旗舰店",
                "items": [
                    { "name": "多芬巴西莓果滋润保湿沐浴露【特惠装】深层滋养400g", "price": 18.74 }
                ]
            }
        ],
        "2024-03-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "动物奶油牛奶萌萌软蛋糕", "price": 9.90 },
                    { "name": "金锣肉粒多特级火腿肠", "price": 10.90 },
                    { "name": "超值番茄", "price": 8.99 },
                    { "name": "陈克明鸡蛋龙须挂面", "price": 6.90 },
                    { "name": "精选冷冻肥牛卷", "price": 15.80 },
                    { "name": "怡宝纯净水", "price": 23.40 }
                ]
            }, {
                "shop": "PDD",
                "note": "VERO MODA官方奥莱店",
                "items": [
                    { "name": "Vero Moda奥莱毛呢大衣 SC2浅丛林绿色,L", "price": 342.30 }
                ]
            }
        ],
        "2024-03-06": [
            {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 100.00元", "price": 98.22 }
                ]
            }
        ],
        "2024-03-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "西兰花 约600g", "price": 5.49 },
                    { "name": "火锅蘸酱 叮咚定制川崎瑶柱香菇酱 80g/袋", "price": 2.90 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "鲜活净化黑鱼1条 约550g", "price": 14.90 },
                    { "name": "螺丝椒 约300g", "price": 4.39 }
                ]
            }
        ],
        "2024-03-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "千禾葱姜料酒 10度 500mL", "price": 7.90 },
                    { "name": "水塔老陈醋6° 420ml", "price": 15.00 },
                    { "name": "优惠券", "price": -11.93 },
                    { "name": "运费", "price": 6.00 }
                ]
            }
        ],
        "2024-03-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "良芯匠人土豆粉 180g/袋", "price": 0.00 },
                    { "name": "大葱 约500g", "price": 3.28 },
                    { "name": "紫皮大蒜 约350g", "price": 5.63 },
                    { "name": "螺丝椒 约300g", "price": 4.13 },
                    { "name": "新土豆 约600g", "price": 2.62 },
                    { "name": "新鲜猪带肉汤骨（汤小排）约400g", "price": 7.23 },
                    { "name": "三红胡萝卜 约600g", "price": 1.68 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.62 },
                    { "name": "鲜鸡蛋30枚", "price": 20.60 },
                    { "name": "叮咚定制麦苗芋泥青青青糕 200g/份", "price": 10.16 },
                    { "name": "去根松花菜半颗 约500g", "price": 3.94 },
                    { "name": "小米椒 约50g", "price": 1.92 }
                ]
            }
        ],
        "2024-03-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "温氏 供港黄油鸡 1kg*2", "price": 63.70 },
                    { "name": "乐畅纯正辣椒粉30g", "price": 3.90 },
                    { "name": "卡比兽辣椒粉30g/瓶*2", "price": 7.80 },
                    { "name": "吉得利 油泼辣子200g*2", "price": 27.80 },
                    { "name": "优惠券", "price": -12.46 },
                    { "name": "双汇 Q趣香肠 80g*5支", "price": 12.39 },
                    { "name": "稻稻熊红花椒100g", "price": 14.78 },
                    { "name": "十月稻田 辽河长粒香大米 5kg", "price": 33.72 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-03-15": [
            {
                "shop": "京东",
                "items": [
                    { "name": "正宗陕西绿心猕猴桃 大果20枚", "price": 23.90 },
                    { "name": "京鲜生 泰国金枕头冷冻榴莲肉1000g", "price": 103.88 }
                ]
            }
        ],
        "2024-03-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "白象辣牛肉汤面 111.5g*5/袋", "price": 13.04 },
                    { "name": "白象招牌猪骨汤面 106g*5/袋", "price": 13.98 },
                    { "name": "统一老坛酸菜面 121g*5袋/包 (2包)", "price": 18.77 },
                    { "name": "叮咚买菜×农夫山泉桶装水 5L/桶", "price": 7.97 },
                    { "name": "内蒙羔羊肉卷 200g", "price": 12.39 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 15.86 },
                    { "name": "冷鲜小白鲳鱼 4条 300g", "price": 9.89 }
                ]
            }
        ],
        "2024-03-19": [
            {
                "shop": "京东",
                "items": [
                    { "name": "味好美（McCormicK）番茄沙司挤挤装 330g*2", "price": 10.36 },
                    { "name": "高洁丝【胖东来同款系列】卫生巾10包66片", "price": 34.36 }
                ]
            }
        ],
        "2024-03-20": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-03-22": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3260.00 }
                ]
            }
        ],
        "2024-03-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "迷你甜甜圈 100g", "price": 5.77 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.85 },
                    { "name": "一点小葱 20g", "price": 0.00 },
                    { "name": "三全猪肉芹菜水饺 1kg/袋", "price": 13.90 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 24.72 },
                    { "name": "全麦黑椒牛肉三明治 155g", "price": 12.13 },
                    { "name": "青菜 约500g", "price": 1.48 },
                    { "name": "进口香蕉 约900g", "price": 8.29 },
                    { "name": "优质番茄 约500g", "price": 3.62 }
                ]
            }
        ],
        "2024-03-25": [
            {
                "shop": "PDD",
                "note": "舒客旗舰店",
                "items": [
                    { "name": "舒客 软毛牙刷*2", "price": 12.16 }
                ]
            }, {
                "shop": "PDD",
                "note": "云淼纺织",
                "items": [
                    { "name": "雪花布枕巾 太阳花,一对", "price": 12.69 }
                ]
            }, {
                "shop": "PDD",
                "note": "舒客官方旗舰店",
                "items": [
                    { "name": "舒客花蕊刷细毛薄头牙刷【4支】", "price": 10.93 }
                ]
            }, {
                "shop": "PDD",
                "note": "三利sanli家居日用旗舰店",
                "items": [
                    { "name": "三利毛巾 浅灰色+奶茶色", "price": 9.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "JOYROOM机乐堂居家官方旗舰店",
                "items": [
                    { "name": "全自动折叠雨伞", "price": 35.40 }
                ]
            }
        ],
        "2024-03-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "有你一面手工日晒面 70g/袋", "price": 0.00 },
                    { "name": "紫皮大蒜 约350g", "price": 5.61 },
                    { "name": "大葱 约500g", "price": 3.27 },
                    { "name": "白象辣牛肉汤面 111.5g*5/袋", "price": 13.02 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.87 },
                    { "name": "鲜活更大只南美白对虾（基围虾）500g", "price": 41.81 },
                    { "name": "叮咚家美好空气炸锅纸 50张/盒", "price": 7.42 },
                    { "name": "有友凤爪（山椒味）160g", "price": 10.42 },
                    { "name": "统一老坛酸菜面 121g*5袋/包", "price": 9.41 }
                ]
            }
        ],
        "2024-03-28": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-03-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "澳洲无籽红提 约300g", "price": 9.45 },
                    { "name": "金锣肉粒多特级火腿肠 30g*9根/袋", "price": 10.40 },
                    { "name": "深海大虾 200g/袋", "price": 10.46 },
                    { "name": "蔡长青×久久丫虎皮凤爪 130g/盒", "price": 17.95 },
                    { "name": "会员5日卡", "price": 0.00 },
                    { "name": "伊利巧乐兹经典巧脆棒冰淇淋 75g*5支/盒", "price": 16.04 },
                    { "name": "叮咚定制四色火锅面 400g/袋", "price": 4.67 },
                    { "name": "蒙牛双拼果粒风味酸牛乳圆周杯 90g*8杯/组", "price": 12.31 },
                    { "name": "崇明青菜 350g/份", "price": 3.61 }
                ]
            }
        ],
        "2024-03-31": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 14.90 },
                    { "name": "西葫芦 650g/份", "price": 3.19 },
                    { "name": "去根松花菜半颗 约500g", "price": 4.29 },
                    { "name": "王守义十三香 45g/盒 (2盒)", "price": 7.80 },
                    { "name": "中粮家佳康精装冷鲜梅花肉丝 200g", "price": 7.49 }
                ]
            }
        ],
        "2024-04-02": [
            {
                "shop": "京东",
                "items": [
                    { "name": "百多利 沙棘汁 280ml*8瓶", "price": 19.01 },
                    { "name": "味好美McCormicK番茄酱 330g*2袋", "price": 12.47 },
                    { "name": "可口可乐（Coca-Cola）美汁源 300ml*12瓶", "price": 25.46 }
                ]
            }
        ],
        "2024-04-03": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0.00 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.40 },
                    { "name": "皱皮青椒 约300g", "price": 2.89 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "海底捞 牛油火锅底料150g*4", "price": 21.88 },
                    { "name": "云山半 东北豆皮2斤", "price": 11.37 },
                    { "name": "悦味纪 0脂吸汁荞麦面藕500g", "price": 10.50 },
                    { "name": "逍遥老杨家 腐竹段500g*1袋", "price": 11.59 },
                    { "name": "鲜京采 鸡琵琶腿 1kg*4", "price": 57.48 },
                    { "name": "大希地原切牛腱子肉 1kg*2", "price": 108.88 },
                    { "name": "乐事（Lay's）无限薯片 黄瓜味 104克*2", "price": 14.21 },
                    { "name": "老管家 管道除臭剂 1L", "price": 14.67 },
                    { "name": "思念菌菇三鲜饺子1.08kg54只*3", "price": 51.81 },
                    { "name": "大希地潮汕牛肉丸250g*4", "price": 28.82 }
                ]
            }
        ],
        "2024-04-04": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-04-08": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-04-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "陶华碧老干妈 风味鸡油辣椒 280g*2", "price": 25.28 }
                ]
            }, {
                "shop": "PDD",
                "note": "连云港鲁花粮油米面专卖店",
                "items": [
                    { "name": "鲁花 花生油,5S压榨一级生油1000ML", "price": 32.12 }
                ]
            }
        ],
        "2024-04-11": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-04-12": [
            {
                "shop": "京东",
                "items": [
                    { "name": "联想thinkplus电脑直播摄像头1080P", "price": 98.51 }
                ]
            }
        ],
        "2024-04-13": [
            {
                "shop": "天猫",
                "note": "innisfree官方旗舰店",
                "items": [
                    { "name": "悦诗风吟绿茶精萃清润保湿氨基酸洁面洗面奶 2支", "price": 76.2 }
                ]
            }
        ],
        "2024-04-15": [
            {
                "shop": "京东",
                "items": [
                    { "name": "五月花（May Flower）厨房卷纸 3层120张*3卷", "price": 7.16 },
                    { "name": "清风有芯卷纸 4层140克*10卷", "price": 17.25 },
                    { "name": "思念 猪肉韭菜口味1.08kg54只*3", "price": 49.03 }
                ]
            }
        ],
        "2024-04-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "海氏海诺 一次性 口罩100只", "price": 11.80 }
                ]
            }
        ],
        "2024-04-17": [
            {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 100.00元", "price": 97.76 }
                ]
            }
        ],
        "2024-04-20": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 50.00 }
                ]
            }
        ],
        "2024-04-21": [
            {
                "shop": "京东",
                "items": [
                    { "name": "康师傅 卤香牛肉面 104g*5", "price": 23.38 },
                    { "name": "康师傅 番茄鸡蛋牛肉面 115g*5", "price": 9.89 },
                    { "name": "统一 藤椒牛肉面100g*5", "price": 9.44 },
                    { "name": "卫龙辣条大面筋650g", "price": 23.66 },
                    { "name": "大紅門台湾风味烤肠700g", "price": 24.27 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "房租 上海隽诚公寓管理有限公司", "price": 3414.19 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 105.16 }
                ]
            }
        ],
        "2024-04-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "中粮家佳康精装冷鲜梅花肉丝 200g", "price": 7.00 },
                    { "name": "大葱 约500g", "price": 3.26 },
                    { "name": "新土豆 约1kg", "price": 5.13 },
                    { "name": "有豆志山涧柴火豆腐 400g", "price": 6.36 },
                    { "name": "新鲜切块带筋猪蹄 约500g", "price": 22.26 },
                    { "name": "中粮家佳康精装冷鲜大排 420g", "price": 15.71 },
                    { "name": "新鲜猪小排 约400g", "price": 12.63 },
                    { "name": "伊利巧乐兹经典巧脆棒冰淇淋 75g*5支", "price": 14.82 },
                    { "name": "白萝卜 约1kg", "price": 0.00 }
                ]
            }
        ],
        "2024-04-25": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 香稻贡米5kg", "price": 33.49 }
                ]
            }
        ],
        "2024-04-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蟹味菇 150g/份", "price": 0.00 },
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 15.80 },
                    { "name": "有豆志薄百页 110g/份", "price": 5.09 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 26.50 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.40 },
                    { "name": "一点小葱 20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）厨房用纸 75节8卷", "price": 22.75 },
                    { "name": "双枪（Suncha）316L不锈钢勺子【单只】", "price": 6.35 }
                ]
            }
        ],
        "2024-04-27": [
            {
                "shop": "京东",
                "items": [
                    { "name": "海天 金标 生抽 500ml*2", "price": 17.86 },
                    { "name": "水塔老陈醋6° 420ml", "price": 9.50 },
                    { "name": "思念 至臻虾皇317g20只*3", "price": 51.44 }
                ]
            }, {
                "shop": "PDD",
                "note": "DARLIE好来口腔旗舰店",
                "items": [
                    { "name": "DARLIE好来(原黑人)牙膏180g+白桃40g", "price": 11.61 }
                ]
            }
        ],
        "2024-04-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "白萝卜 约1kg", "price": 2.70 },
                    { "name": "双汇马可波罗特级火腿肠 250g/袋", "price": 9.04 },
                    { "name": "鲜活净化黑鱼1条 约550g", "price": 16.75 },
                    { "name": "青岛经典啤酒 500mL/罐 (2罐)", "price": 7.76 },
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 12.11 },
                    { "name": "深海大虾 200g/袋", "price": 10.23 }
                ]
            }, {
                "shop": "天猫",
                "note": "联合利华官方旗舰店",
                "items": [
                    { "name": "力士精油香氛依兰香沐浴露【艾叶山茶】550g", "price": 22.68 }
                ]
            }
        ],
        "2024-04-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三全牛肉大葱水饺 450g", "price": 11.80 },
                    { "name": "无泪大葱 约350g", "price": 0.00 },
                    { "name": "有豆志冻嫩豆腐 350g", "price": 6.29 },
                    { "name": "叮咚定制鲜奶提子雪糕 420g", "price": 15.84 },
                    { "name": "三全大黄米黑芝麻汤圆 400g", "price": 5.16 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "肯贝恩外开内开窗专用纱窗（白纱黑边）", "price": 16.84 },
                    { "name": "京鲜生 无抗保洁鲜鸡蛋30枚/盒", "price": 21.76 }
                ]
            }
        ],
        "2024-04-30": [
            {
                "shop": "盒马",
                "items": [
                    { "name": "颗颗溏心松花蛋6枚", "price": 9.9 },
                    { "name": "一根油条 125g", "price": 5.8 },
                    { "name": "风味鸡油辣椒 280g", "price": 13.9 },
                    { "name": "三黄土鸡整只 1kg", "price": 29.9 },
                    { "name": "AD钙 220g*4", "price": 8 },
                    { "name": "烘焙 蔓越莓", "price": 12.9 },
                    { "name": "优惠券", "price": -0.1 }
                ]
            }
        ],
        "2024-05-02": [
            {
                "shop": "京东",
                "items": [
                    { "name": "滴露（Dettol）抑菌洗手液茉莉与绿茶清香500g", "price": 9.29 },
                    { "name": "茶花 肥皂盒 1只装", "price": 4.14 }
                ]
            }, {
                "shop": "淘工厂",
                "note": "淘特100官方旗舰店",
                "items": [
                    { "name": "厨房剪刀三件套【弯刀剪3件套】", "price": 0.01 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-05-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 4.17 },
                    { "name": "有友凤爪（山椒味）160g", "price": 10.77 },
                    { "name": "有豆志中百页 150g", "price": 4.82 },
                    { "name": "螺丝椒 约300g", "price": 3.42 },
                    { "name": "严选精品新鲜猪后腿精肉 约300g", "price": 14.68 },
                    { "name": "思念珍味三鲜上汤小云吞 400g/袋", "price": 14.71 }
                ]
            }
        ],
        "2024-05-05": [
            {
                "shop": "京东",
                "items": [
                    { "name": "千喵魔方吐司1000g", "price": 13.50 },
                    { "name": "鲜京采 琵琶腿 1kg*5 冷冻", "price": 67.40 }
                ]
            }
        ],
        "2024-05-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "叮咚定制石磨花生酱（挤挤装）200g/袋", "price": 10.14 },
                    { "name": "蔡长青香糟凤爪 240g", "price": 14.82 },
                    { "name": "小米椒 约50g", "price": 0.00 },
                    { "name": "杨过一口生煎（15只）345g/袋", "price": 17.58 },
                    { "name": "坛坛乡精制小米椒 275g/瓶", "price": 7.90 },
                    { "name": "香菜 约100g", "price": 3.24 }
                ]
            }
        ],
        "2024-05-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 17.65 },
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "三红胡萝卜 约600g", "price": 1.86 },
                    { "name": "大葱 约500g", "price": 3.26 },
                    { "name": "秋浦河散养土鸡蛋10枚 400g", "price": 11.13 },
                    { "name": "白象招牌猪骨汤面 106g*5/袋", "price": 11.60 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 11.60 },
                    { "name": "统一老坛酸菜面 121g*5袋/包", "price": 11.15 },
                    { "name": "有豆志百页结 200g/份", "price": 3.29 },
                    { "name": "有豆志油豆腐 130g/份", "price": 2.29 },
                    { "name": "有豆志中百页 150g/份", "price": 3.87 },
                    { "name": "东海冰鲜小黄鱼 500g", "price": 10.07 }
                ]
            }
        ],
        "2024-05-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.30 }
                ]
            }
        ],
        "2024-05-10": [
            {
                "shop": "京东",
                "items": [
                    { "name": "老管家 管道除臭剂 1L", "price": 14.88 },
                    { "name": "思念菌菇三鲜饺子1.08kg54只", "price": 52.53 }
                ]
            }
        ],
        "2024-05-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 5.49 },
                    { "name": "益客冷鲜鸡爪 400g", "price": 20.80 },
                    { "name": "蒙牛优益C活菌型乳酸菌饮品（原味）100mL*5/组", "price": 13.80 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "叮咚买菜×恒顺酿造白醋 500mL/瓶", "price": 5.20 },
                    { "name": "禾煜大料 50g/袋", "price": 7.92 },
                    { "name": "优选四川黄柠檬4个 500g/份", "price": 5.21 },
                    { "name": "禾煜桂皮 50g/袋", "price": 4.72 }
                ]
            }
        ],
        "2024-05-13": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 20.00 }
                ]
            }
        ],
        "2024-05-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "舟山海捕冷冻白鲳鱼（4-6条）350g", "price": 6.07 },
                    { "name": "三全鲜食番茄牛肉生饺子（18只）306g", "price": 9.41 },
                    { "name": "老干妈风味鸡油辣椒 280g/瓶", "price": 13.14 },
                    { "name": "俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0.00 },
                    { "name": "香葱 约50g", "price": 0.74 },
                    { "name": "小葱香菜双拼 40g", "price": 1.05 },
                    { "name": "山林大红肠 400g/袋", "price": 18.74 },
                    { "name": "崇明西葫芦 350g/份", "price": 2.62 },
                    { "name": "圣农汁汁嫩香鸡（奥尔良味）275g", "price": 9.37 },
                    { "name": "蒜苔 约300g", "price": 3.75 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "单车 15:05 时长:5分36秒", "price": 1.5 },
                    { "name": "单车 14:43 时长:7分22秒", "price": 1.5 }
                ]
            }
        ],
        "2024-05-17": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 14:49 时长:16分55秒", "price": 2.5 }
                ]
            }
        ],
        "2024-05-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "雪花清爽啤酒 330mL/罐", "price": 0.00 },
                    { "name": "优质番茄 约500g", "price": 4.59 },
                    { "name": "蔡长青脆脆皮炸鸡（整只）450g", "price": 24.50 },
                    { "name": "上好佳鲜虾片 40g/袋", "price": 4.30 },
                    { "name": "有友凤爪（山椒味）160g", "price": 12.00 }
                ]
            }
        ],
        "2024-05-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "卫龙辣条大面筋650g", "price": 18.86 },
                    { "name": "克拉古斯 哈尔滨红肠270g*3袋共9支", "price": 19.65 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "单车 16:09 时长:10分18秒", "price": 1.5 }
                ]
            }
        ],
        "2024-05-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜活优养优饲虎背鲈鱼 约350g", "price": 13.50 },
                    { "name": "渔夫保罗生冻巴沙鱼柳 400g", "price": 10.90 },
                    { "name": "蒙牛优益C活菌型乳酸菌饮品（原味）100mL*5/组", "price": 13.80 },
                    { "name": "可口可乐 330mL/罐", "price": 0.00 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.79 },
                    { "name": "有豆志苏北锅香老豆腐 400g/份", "price": 5.90 },
                    { "name": "三全鲜食番茄牛肉生饺子（18只）306g", "price": 17.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "foojo颈枕u型枕 浅灰米白", "price": 37.72 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/05/26-2024/05/31)上海兴利开发有限公司", "price": 480.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/06/01-2024/06/30)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-05-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【哈尔滨风味】俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0 },
                    { "name": "迷你人参果 500g/份", "price": 12.50 },
                    { "name": "【平价】新鲜带皮五花肉 约300g", "price": 12.50 },
                    { "name": "老姜 约300g", "price": 6.99 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.79 },
                    { "name": "香葱 约50g", "price": 1.58 },
                    { "name": "螺丝椒 约300g", "price": 2.89 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "得力（deli）气泡膜50米*30CM", "price": 33.63 },
                    { "name": "QDZX搬家纸箱 60*40*50(5个)", "price": 37.73 }
                ]
            }
        ],
        "2024-05-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【大枚蛋】土鸡蛋8枚 440g", "price": 6.51 },
                    { "name": "三红胡萝卜 约600g", "price": 0 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.75 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.17 },
                    { "name": "和路雪梦龙小青龙香烤碧根果口味冰淇淋 65g*4/盒", "price": 23.96 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "得力(deli)透明封箱胶带 60mm*100y*50um(91.4m/卷)*2", "price": 19.60 }
                ]
            }
        ],
        "2024-05-25": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 117.60 }
                ]
            }
        ],
        "2024-05-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蔡长青柠香泡椒去骨凤爪 200g/盒", "price": 17.72 },
                    { "name": "娃哈哈AD钙奶 220g*4瓶", "price": 7.45 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 22.94 },
                    { "name": "一点小葱 20g", "price": 0 },
                    { "name": "周黑鸭五香鸭脖趣享装 120g/盒", "price": 0 },
                    { "name": "百事可乐 330mL/罐", "price": 0 },
                    { "name": "原味绿豆糕100g/袋(4枚)", "price": 7.26 },
                    { "name": "周黑鸭五香鸭脖趣享装 120g/盒", "price": 15.84 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 21.59 },
                    { "name": "【大枚蛋】土鸡蛋8枚 440g", "price": 6.59 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "PaulFrank大嘴猴凉拖鞋女 天蓝38-39", "price": 22.61 },
                    { "name": "大嘴猴（paul frank）拖鞋男 黑 44-45", "price": 25.46 },
                    { "name": "鲁花 花生油1L", "price": 36.06 },
                    { "name": "九洲鹿 蚊帐 150*200", "price": 127.08 },
                    { "name": "维达（Vinda） 4层130克*10卷", "price": 17.87 },
                    { "name": "汰渍洗衣粉3.1斤", "price": 11.29 },
                    { "name": "肯贝恩外开内开窗专用纱窗（白纱黑边）", "price": 21.76 }
                ]
            }, {
                "shop": "PDD",
                "note": "联合利华官方旗舰店",
                "items": [
                    { "name": "力士水润丝滑洗发水520g", "price": 22.46 }
                ]
            }, {
                "shop": "PDD",
                "note": "维达个人护理旗舰店",
                "items": [
                    { "name": "山茶花杀菌湿巾【80片*2包】", "price": 14.88 }
                ]
            }, {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 2.00 }
                ]
            }, {
                "shop": "微信",
                "note": "搬家-小面包车-货拉拉",
                "items": [
                    { "name": "路劲悦茂府-B座→慧智·有巢国际公寓社区(鹤涛路店)", "price": 180.00 }
                ]
            }
        ],
        "2024-05-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "香葱 约50g", "price": 0.79 },
                    { "name": "中盐牌未加碘纯精岩盐 400g/袋", "price": 3.90 },
                    { "name": "良芯匠人手擀式面 300g/盒", "price": 3.50 },
                    { "name": "怡宝至本清润菊花茶 450mL/瓶", "price": 0 },
                    { "name": "迷你小菠萝果切 250g/盒", "price": 11.12 },
                    { "name": "普罗旺斯番茄 约500g", "price": 7.59 },
                    { "name": "海天黄豆酱 340g/瓶", "price": 8.80 },
                    { "name": "【内含4小包】叮咚定制鸡蛋鲜面 400g/袋", "price": 6.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "海天 金标 生抽【一级酱油】500ml*2", "price": 14.09 },
                    { "name": "水塔老陈醋6° 420ml*2", "price": 9.82 },
                    { "name": "妙洁海绵百洁布 12片", "price": 11.04 }
                ]
            }
        ],
        "2024-05-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蔡长青吮指鸭锁骨（微辣）160g", "price": 13.92 },
                    { "name": "【当季现挖】新土豆 约600g", "price": 0 },
                    { "name": "陕西洛川红富士4个 800g", "price": 12.99 },
                    { "name": "【平价】新鲜后腿精肉 约240g", "price": 9.15 },
                    { "name": "螺丝椒 约300g", "price": 2.60 },
                    { "name": "【无抗保洁】鲜鸡蛋30枚 1.59kg", "price": 18.62 },
                    { "name": "一点小葱 20g", "price": 0 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米2.5kg", "price": 13.27 },
                    { "name": "白象 珍骨汤老母鸡汤面102g*5", "price": 7.87 },
                    { "name": "统一 巧面馆油泼辣子酸汤面 110g*5", "price": 7.94 }
                ]
            }, {
                "shop": "PDD",
                "note": "专人韩国代购",
                "items": [
                    { "name": "韩式潮牌waikei粉色【三只狗狗】WK01", "price": 34.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "专人韩国代购",
                "items": [
                    { "name": "韩式潮牌waikei白色 原版260克 WK01", "price": 33.00 }
                ]
            }
        ],
        "2024-05-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 2.79 },
                    { "name": "【平价】新鲜后腿精肉 约240g", "price": 9.79 },
                    { "name": "良芯匠人饺子皮 300g/份", "price": 4.50 },
                    { "name": "韭菜 约300g", "price": 4.39 }
                ]
            }
        ],
        "2024-05-30": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.39 },
                    { "name": "益客冷鲜鸡大胸 400g", "price": 5.69 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.69 },
                    { "name": "良芯匠人火锅扯面 200g/盒", "price": 6.90 },
                    { "name": "螺丝椒 约300g", "price": 2.69 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "馨美凯实木电脑桌 桌面水性漆【厚度2.7-3.0cm】 160*70*75cm", "price": 472.41 }
                ]
            }
        ],
        "2024-05-31": [
            {
                "shop": "隽寓",
                "items": [
                    { "name": "水电 上海隽诚公寓管理有限公司", "price": 2.00 }
                ]
            }
        ],
        "2024-06-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）厨房卷纸 可水洗75节*2卷", "price": 11.25 },
                    { "name": "陶华碧老干妈 风味鸡油辣椒280g", "price": 10.60 }
                ]
            }
        ],
        "2024-06-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【哈尔滨小食】升元烤冷面 320g/袋", "price": 3.32 },
                    { "name": "【无抗保洁】鲜鸡蛋30枚 1.59kg", "price": 8.41 },
                    { "name": "切片南瓜 约500g", "price": 0 },
                    { "name": "蔡长青香辣素拌菜 180g", "price": 5.85 },
                    { "name": "【儿时豆香味】有豆志苏北锅香老豆腐 400g/份", "price": 2.48 },
                    { "name": "香葱 约50g", "price": 0.33 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "京鲜生 广西武鸣沃柑 净重8斤装 单果110g+", "price": 22.16 }
                ]
            }, {
                "shop": "PDD",
                "note": "伽卫家居生活旗舰店",
                "items": [
                    { "name": "细纱款-全包澡巾【每样一色】组合装", "price": 3.45 }
                ]
            }, {
                "shop": "PDD",
                "note": "贰斯美学旗舰店",
                "items": [
                    { "name": "线条小狗鼠标垫超大号 900x400mmx3mm", "price": 25.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "朵朵棉官方旗舰店",
                "items": [
                    { "name": "2件朵朵棉无痕内衣女 肤色+蓝色,L", "price": 38.32 }
                ]
            }, {
                "shop": "PDD",
                "note": "安睡宝床品官方旗舰店",
                "items": [
                    { "name": "抗菌棉花床垫【海洋蓝格】150x200cm", "price": 45.64 }
                ]
            }, {
                "shop": "PDD",
                "note": "宇娜布艺饰品",
                "items": [
                    { "name": "定制纱窗自粘条 灰纱灰边", "price": 10.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "荣业食品旗舰店",
                "items": [
                    { "name": "荣业广味腊肠500g", "price": 16.10 }
                ]
            }
        ],
        "2024-06-03": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜活黄金鲫鱼1条 约400g", "price": 0 },
                    { "name": "【肉似蒜瓣】鲜活优养优饲虎背鲈鱼 约300g", "price": 12.94 },
                    { "name": "【BAP国际认证】冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 9.28 },
                    { "name": "老干妈风味鸡油辣椒 280g/瓶", "price": 13.04 },
                    { "name": "【低盐】有豆志腐竹 210g/袋", "price": 10.22 },
                    { "name": "【酸辣开胃】叮咚买菜×新希望味业虎皮双椒酱 200g/瓶", "price": 8.91 },
                    { "name": "海底捞火锅蘸料原味 120g/袋", "price": 6.31 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "大希地 精制肥牛卷 500g", "price": 32.59 },
                    { "name": "白象  川渝风味酸辣粉93g*5", "price": 10.36 }
                ]
            }, {
                "shop": "PDD",
                "note": "双苑水果生鲜官方旗舰店",
                "items": [
                    { "name": "海南贵妃芒【带箱9-10斤】,中果【101-151g】", "price": 22.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "东方雨虹美家旗舰店",
                "items": [
                    { "name": "雨虹密封胶泥20包【足量600g】", "price": 13.99 }
                ]
            }, {
                "shop": "PDD",
                "note": "福来财五金店",
                "items": [
                    { "name": "静电贴自粘墙面保护膜 静电强吸附【90厘米*2米】", "price": 10.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "创勒官方旗舰店",
                "items": [
                    { "name": "厨房台面挡水条 白色【高1.2厘米 宽2厘米】120cm", "price": 9.90 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/05/26-2024/06/01)上海兴利开发有限公司", "price": 5.24 }
                ]
            }
        ],
        "2024-06-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 2.68 },
                    { "name": "有豆志薄百页 110g/份", "price": 5.30 },
                    { "name": "源氏大豆筋 200g/袋", "price": 8.00 },
                    { "name": "茄子（精选）约800g", "price": 7.00 },
                    { "name": "大白菜 约2.2kg", "price": 8.62 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 21.87 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "传旗釉下彩陶瓷大碗8英寸斗笠碗2只", "price": 32.59 }
                ]
            }, {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 200.00元", "price": 196.42 }
                ]
            }, {
                "shop": "PDD",
                "note": "朵朵棉官方旗舰店",
                "items": [
                    { "name": "朵朵棉男士内裤 4条装(青绿海蓝灰)", "price": 37.93 }
                ]
            }, {
                "shop": "PDD",
                "note": "有棵树裤袜官方旗舰店",
                "items": [
                    { "name": "有棵树男士内裤 黑色+深灰+中灰,3XL", "price": 44.91 }
                ]
            }
        ],
        "2024-06-05": [
            {
                "shop": "京东",
                "items": [
                    { "name": "小号理线器40个装", "price": 3.04 },
                    { "name": "振牛插电式照明灯 5米开关线+30W白光灯泡", "price": 27.95 },
                    { "name": "靓佳 纯白陶瓷米饭碗 5英寸4个装", "price": 15.94 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/05/26-2024/06/01)上海兴利开发有限公司", "price": 13.63 }
                ]
            }
        ],
        "2024-06-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "紫皮大蒜 约350g", "price": 6.39 },
                    { "name": "螺丝椒 约300g", "price": 2.69 },
                    { "name": "0盐龙须挂面 900g/袋", "price": 10.80 },
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 13.90 },
                    { "name": "三红胡萝卜 约600g", "price": 2.39 },
                    { "name": "大枚蛋 土鸡蛋8枚 440g", "price": 6.99 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "未来式 免打孔不锈钢伸缩杆 1.0米-1.7米墙距适用", "price": 29.65 },
                    { "name": "源氏大豆筋 200g*5袋", "price": 24.89 },
                    { "name": "达利园老面包提子味775g", "price": 12.58 }
                ]
            }, {
                "shop": "PDD",
                "note": "轩源见官方旗舰店",
                "items": [
                    { "name": "屏风帘子布艺【门宽50-70】帘宽100X高150配50-90杆", "price": 24.00 }
                ]
            }
        ],
        "2024-06-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "猪后腿精肉 约300g", "price": 13.90 },
                    { "name": "螺丝椒 约300g", "price": 2.59 },
                    { "name": "柳州螺蛳粉（加辣加臭）", "price": 12.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "斯凯奇 黑白老爹鞋 BKW黑色/白色（女款）37.5", "price": 263.75 }
                ]
            }, {
                "shop": "天猫",
                "note": "安踏官方网店",
                "items": [
                    { "name": "【王一博同款】安踏ACE丨休闲鞋男 象牙白/新墨水蓝-1;44", "price": 238.18 }
                ]
            }, {
                "shop": "PDD",
                "note": "炊大皇厨具官方旗舰店",
                "items": [
                    { "name": "炊大皇陶瓷削皮刀", "price": 4.77 }
                ]
            }
        ],
        "2024-06-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "益客冷鲜鸡琵琶腿 400g", "price": 6.99 },
                    { "name": "优质番茄 约500g", "price": 3.79 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "螺丝椒 约300g", "price": 2.59 },
                    { "name": "马可波罗火腿肠 50g*5根/袋", "price": 8.81 },
                    { "name": "双汇特嫩方腿 250g/袋", "price": 5.89 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 19.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 东北黑木耳 150g", "price": 16.27 },
                    { "name": "川珍红花椒150g罐装", "price": 12.21 },
                    { "name": "吉得利 玉米淀粉1kg", "price": 9.19 },
                    { "name": "古松烘焙原料红薯淀粉500g", "price": 7.33 },
                    { "name": "统一 巧面馆油泼辣子酸汤面 110g*5", "price": 14.00 },
                    { "name": "白象 金汤肥牛面 134g*5", "price": 13.90 },
                    { "name": "优惠券", "price": -7.62 },
                    { "name": "运费", "price": 3.54 }
                ]
            }
        ],
        "2024-06-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "猪后腿肉 约360g", "price": 12.80 },
                    { "name": "优质番茄 约500g", "price": 3.42 },
                    { "name": "香葱 约50g", "price": 0.77 },
                    { "name": "螺丝椒 约300g", "price": 0.00 },
                    { "name": "有豆志苏北锅香老豆腐 400g/份", "price": 4.25 },
                    { "name": "砂锅土豆粉 320g/袋", "price": 11.96 },
                    { "name": "迷你彩虹酸奶蛋糕 120g/盒", "price": 12.89 },
                    { "name": "黄瓜 约600g", "price": 2.77 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.49 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "美肤语不锈钢眉夹镊子3件套", "price": 7.17 },
                    { "name": "晨光(M&G)30g 乳胶圈/橡胶圈/牛皮筋", "price": 2.27 }
                ]
            }
        ],
        "2024-06-12": [
            {
                "shop": "京东",
                "items": [
                    { "name": "卫龙辣条大面筋榴莲味50g", "price": 9.73 }
                ]
            }
        ],
        "2024-06-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 0.00 },
                    { "name": "红洋葱 约750g", "price": 3.99 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "小米椒 约75g", "price": 2.39 },
                    { "name": "冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 9.90 },
                    { "name": "冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 8.49 },
                    { "name": "茄子（精选）约800g", "price": 7.69 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 18.65 },
                    { "name": "有豆志香煎家常豆腐 300g/份", "price": 4.47 },
                    { "name": "一点小葱 约20g", "price": 0.00 },
                    { "name": "会员5日卡", "price": 0.00 },
                    { "name": "黑胡椒地道烤肠 300g", "price": 19.59 },
                    { "name": "蔡长青整切眼肉牛排 180g", "price": 12.09 },
                    { "name": "提子雪糕（6支）420g/盒", "price": 9.32 },
                    { "name": "双拼果粒酸牛乳圆周杯 90g*8杯/组", "price": 7.40 },
                    { "name": "麒麟西瓜 1个 约4.3kg", "price": 18.27 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "蒙牛特仑苏纯牛奶250ml*16盒*2", "price": 73.18 }
                ]
            }
        ],
        "2024-06-15": [
            {
                "shop": "京东",
                "items": [
                    { "name": "营多捞面 原味85克*5包", "price": 12.90 },
                    { "name": "统一 巧面馆 老坛酸菜 120g*5", "price": 14.00 },
                    { "name": "统一 巧面馆 麻辣笋子 106g*5", "price": 14.00 },
                    { "name": "优惠券", "price": -25.05 },
                    { "name": "运费", "price": 6.00 },
                    { "name": "森马（Semir）牛仔裤男 中蓝33", "price": 126.78 }
                ]
            }, {
                "shop": "PDD",
                "note": "森马官方旗舰店",
                "items": [
                    { "name": "森马休闲裤 黑色,165/70A/L", "price": 47.35 }
                ]
            }
        ],
        "2024-06-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "香巴佬经典卤蛋300g/袋 30g*10枚", "price": 14.96 }
                ]
            }
        ],
        "2024-06-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "谷饲冷鲜牛腿肉 1kg", "price": 56.66 },
                    { "name": "蒜苔 约300g", "price": 5.29 },
                    { "name": "陕西洛川红富士4个 800g", "price": 10.24 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "高洁丝Kotex旗舰店",
                "items": [
                    { "name": "高洁丝安睡裤 夜安裤L码", "price": 2.93 }
                ]
            }, {
                "shop": "PDD",
                "note": "回力男装旗舰店",
                "items": [
                    { "name": "回力冰丝裤子男款 直筒-黑(HL灰方块X),2XL", "price": 49.90 }
                ]
            }, {
                "shop": "PDD",
                "note": "回力淘友专卖店",
                "items": [
                    { "name": "回力半袖男 浅米(HL像素摸鱼X),2XL", "price": 23.20 }
                ]
            }, {
                "shop": "PDD",
                "note": "森马官方旗舰店",
                "items": [
                    { "name": "森马纯棉短袖T恤 咖色调170/88A/M", "price": 26.55 }
                ]
            }
        ],
        "2024-06-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.05 },
                    { "name": "一点小葱 约20g", "price": 0.00 },
                    { "name": "青肉黄瓜 约1kg", "price": 3.89 },
                    { "name": "优质番茄 约500g", "price": 2.84 },
                    { "name": "螺丝椒 约300g", "price": 1.61 },
                    { "name": "手擀式面 300g/盒", "price": 2.85 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "京愿 山东烟台 苹果 10斤大果80-85mm", "price": 24.13 }
                ]
            }, {
                "shop": "PDD",
                "note": "PUELLA女装服饰旗舰店",
                "items": [
                    { "name": "拉夏贝尔PUELLA美式速干工装裤女【绿色】常规,L", "price": 49.50 }
                ]
            }
        ],
        "2024-06-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "有豆志盐卤五香干 120g/份", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "西兰花 约600g", "price": 5.78 },
                    { "name": "山东红富士苹果4个 860g", "price": 9.90 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "禧天龙官方旗舰店",
                "items": [
                    { "name": "禧天龙面条收纳盒 2L【密封防潮】一个装-食品级材质-冰箱微波炉可用", "price": 7.37 }
                ]
            }, {
                "shop": "PDD",
                "note": "禧天龙家居官方旗舰店",
                "items": [
                    { "name": "禧天龙杂粮密封盒 2L中号,1个装", "price": 12.60 }
                ]
            }, {
                "shop": "PDD",
                "note": "东弘图家居生活专营店",
                "items": [
                    { "name": "家用粘钩 进口亚克力10个", "price": 1.78 }
                ]
            }, {
                "shop": "PDD",
                "note": "黑猫神居家日用官方旗舰店",
                "items": [
                    { "name": "黑猫神洁厕块6块", "price": 7.92 }
                ]
            }, {
                "shop": "PDD",
                "note": "三利sanli日用旗舰店",
                "items": [
                    { "name": "三利毛巾 水色蓝+米票白", "price": 10.53 }
                ]
            }
        ],
        "2024-06-20": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 19.90 },
                    { "name": "源氏大豆筋 200g/袋 (3袋)", "price": 22.69 }
                ]
            }
        ],
        "2024-06-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "泡椒豇豆 25g*10小包/袋", "price": 9.90 },
                    { "name": "茄子（精选）约800g", "price": 7.09 },
                    { "name": "豆瓣酱 300g/盒", "price": 6.90 },
                    { "name": "皱皮青椒 约350g", "price": 2.29 },
                    { "name": "优质番茄 约500g", "price": 3.48 },
                    { "name": "手擀式面 300g/盒", "price": 3.50 },
                    { "name": "海盐鲜牛乳苏打饼干 500g/袋", "price": 10.90 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "伯爵 特级初榨橄榄油 500ml", "price": 64.34 }
                ]
            }
        ],
        "2024-06-22": [
            {
                "shop": "天猫",
                "note": "御巍旗舰店",
                "items": [
                    { "name": "realme 真我 GT Neo5 SE:-K2187面包家族【直边透黑软壳】", "price": 3.6 },
                    { "name": "realme 真我 GT Neo5 SE:-F4600可爱虎【直边透明软壳】", "price": 2.97 }
                ]
            }, {
                "shop": "天猫",
                "note": "仙阁里旗舰店",
                "items": [
                    { "name": "realme 真我 GT Neo5:【远峰蓝】", "price": 0.70 }
                ]
            }, {
                "shop": "PDD",
                "note": "汉世刘家汉景专卖店",
                "items": [
                    { "name": "垃圾袋手提98只, 2.53g厚", "price": 0.76 }
                ]
            }
        ],
        "2024-06-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "金针菇 300g/份", "price": 0.00 },
                    { "name": "螺丝椒 约300g", "price": 1.98 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 8.90 },
                    { "name": "有友凤爪（山椒味）160g", "price": 11.92 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "紫皮大蒜 约350g", "price": 6.29 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒香大米 2.5kg", "price": 18.91 },
                    { "name": "维达（Vinda）厨房抽纸 80抽*3包", "price": 10.36 },
                    { "name": "泰氏妈妈MAMA 冬阴功 55g*5包 ", "price": 10.89 },
                    { "name": "阿宽红油面皮 400g*1提", "price": 9.07 },
                    { "name": "农心 石锅牛肉拉面 120g*5包", "price": 17.29 }
                ]
            }
        ],
        "2024-06-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "安买牙线棒 50支装", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 2.99 },
                    { "name": "良芯匠人手擀式面 300g/盒", "price": 3.50 },
                    { "name": "金锣大食袋蒜味肠 380g/袋", "price": 13.80 },
                    { "name": "新土豆 约1kg", "price": 4.79 },
                    { "name": "螺丝椒 约300g", "price": 1.98 },
                    { "name": "优质番茄 约500g", "price": 3.58 },
                    { "name": "正大冷鲜鸡琵琶腿 450g", "price": 10.50 }
                ]
            }
        ],
        "2024-06-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "阿一波香辣味海带丝 30g/袋", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 22.60 },
                    { "name": "优质番茄 约500g", "price": 3.15 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 18.50 },
                    { "name": "有豆志手工攸县香干 248g/份", "price": 4.82 },
                    { "name": "兰花干160g/份", "price": 4.14 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "紫林 醋 4.5度山西陈醋420ml", "price": 6.9 },
                    { "name": "水塔老陈醋6° 420ml", "price": 7.5 },
                    { "name": "优惠券", "price": -4.9 },
                    { "name": "运费", "price": 1.66 },
                    { "name": "佳洁士香氛锁白牙膏 120g*3支共360g", "price": 29.30 }
                ]
            }
        ],
        "2024-06-27": [
            {
                "shop": "京东",
                "items": [
                    { "name": "五得利 八星雪花小麦粉 5斤", "price": 18.11 }
                ]
            }
        ],
        "2024-06-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "三红胡萝卜 约600g", "price": 2.23 },
                    { "name": "香葱 约50g", "price": 0.73 },
                    { "name": "黄瓜 约600g", "price": 2.79 },
                    { "name": "皱皮青椒 约350g", "price": 2.13 },
                    { "name": "新鲜后腿精肉 约240g", "price": 10.09 },
                    { "name": "益客冷鲜鸡大胸 400g", "price": 5.40 },
                    { "name": "番茄沙司 330g/袋", "price": 9.24 },
                    { "name": "土鸡蛋8枚 440g", "price": 6.52 },
                    { "name": "优质番茄 约500g", "price": 3.25 },
                    { "name": "吮指鸭锁骨（微辣）160g (2盒)", "price": 14.95 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "德青源A级鲜鸡蛋32枚2.74斤", "price": 27.34 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/07/01-2024/07/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-06-29": [
            {
                "shop": "京东",
                "items": [
                    { "name": "英科医疗（INTCO）一次性食品级丁腈手套 L大码100只", "price": 19.98 },
                    { "name": "洁芙朗（JAFFRONG）小苏打牙膏100g", "price": 2.50 },
                    { "name": "LYNN 鞋刷洗衣刷子【超值2个装】", "price": 6.34 },
                    { "name": "立白青柠洗洁精1kg", "price": 9.55 },
                    { "name": "狮王（Lion）细齿洁弹力旋净软毛 2支装", "price": 19.9 },
                    { "name": "舒客炭丝能量牙刷10支", "price": 28.90 },
                    { "name": "优惠券", "price": -23.60 }
                ]
            }
        ],
        "2024-06-30": [
            {
                "shop": "小象",
                "items": [
                    { "name": "蒙牛低脂高钙原味风味酸牛奶 90g*16杯", "price": 14.80 },
                    { "name": "象大厨俄式精制红肠 210g", "price": 7.99 },
                    { "name": "象划算潮汕牛肉风味丸 150g", "price": 1.00 },
                    { "name": "象大厨油炸红衣花生米 150g", "price": 8.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "蒙牛纯牛奶利乐钻200ml×24盒", "price": 37.91 },
                    { "name": "雅美姬 厨房 凝光白/加大款吊篮", "price": 15.67 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "[立方]丹皮酚软膏15g/支/盒", "price": 10.09 },
                    { "name": "[六神]花露水195ml", "price": 14.70 },
                    { "name": "配送费", "price": 1.00 },
                    { "name": "打包费", "price": 0.50 }
                ]
            }
        ],
        "2024-07-01": [
            {
                "shop": "京东",
                "items": [
                    { "name": "京愿 烟台苹果 10斤75-80mm 净重8.5斤", "price": 22.65 }
                ]
            }, {
                "shop": "天猫",
                "note": "帮杰旗舰店",
                "items": [
                    { "name": "304不锈钢晾碗架 304不锈钢沥水架", "price": 128.57 }
                ]
            }
        ],
        "2024-07-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.30 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "紫燕百味鸡酸辣柠檬拆骨凤爪 200g", "price": 16.90 },
                    { "name": "象大厨俄式精制红肠 210g", "price": 7.99 },
                    { "name": "象大厨柠檬拆骨凤爪 300g", "price": 16.90 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -15.00 }
                ]
            }
        ],
        "2024-07-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "【年度会员】连续包年（有效期365天）", "price": 49.90 },
                    { "name": "普罗旺斯西红柿 约500g", "price": 8.97 },
                    { "name": "普罗旺斯西红柿 约500g", "price": 0.00 },
                    { "name": "三红胡萝卜 约600g", "price": 2.25 },
                    { "name": "汉康香百页 300g", "price": 6.40 },
                    { "name": "中粮家佳康精装冰鲜梅花肉丝 150g", "price": 1.99 },
                    { "name": "娃哈哈AD钙奶 100g*5瓶", "price": 4.99 },
                    { "name": "象大厨黑鸭经典鸭锁骨 100g", "price": 13.90 },
                    { "name": "象大厨黑鸭经典鸭锁骨 100g", "price": 0.00 },
                    { "name": "中盐日晒自然盐 250g", "price": 2.90 },
                    { "name": "青泡椒 500g", "price": 2.99 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -15.00 }
                ]
            }
        ],
        "2024-07-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）4层140克*10卷", "price": 18.23 },
                    { "name": "力士依兰香沐浴露 1000g", "price": 20.28 },
                    { "name": "海天 金标系列 生抽 500ml*2", "price": 14.77 }
                ]
            }
        ],
        "2024-07-05": [
            {
                "shop": "小象",
                "items": [
                    { "name": "Aji酵母减盐味苏打饼干 472.5g", "price": 11.90 },
                    { "name": "紫皮大蒜 约250g", "price": 4.49 },
                    { "name": "怡宝纯净水量贩装 350ml*12", "price": 9.90 },
                    { "name": "冷鲜鸡里脊 400g", "price": 8.99 },
                    { "name": "富硒谷物鸡蛋 675g", "price": 14.40 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -10.00 },
                    { "name": "仲景原味香菇酱 230g*2", "price": 27.80 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 32.60 },
                    { "name": "湘味特色 螺丝椒 约300g", "price": 0.00 },
                    { "name": "第2件半价", "price": -6.95 },
                    { "name": "商品优惠券", "price": -10.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "CANDY KNIFE服装旗舰店",
                "items": [
                    { "name": "日系t恤 米黄色,M", "price": 25.48 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/06/01-2024/07/01)上海兴利开发有限公司", "price": 90.39 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/06/01-2024/07/01)上海兴利开发有限公司", "price": 33.21 }
                ]
            }
        ],
        "2024-07-07": [
            {
                "shop": "小象",
                "items": [
                    { "name": "皱皮青椒 约300g", "price": 3.42 },
                    { "name": "崇明西葫芦 300g", "price": 5.56 },
                    { "name": "紫洋葱 约750g", "price": 3.60 },
                    { "name": "进口香蕉 约600g", "price": 5.86 },
                    { "name": "娃哈哈AD钙奶 100g*5瓶(整组)", "price": 4.99 },
                    { "name": "澳洲冰鲜谷饲牛后腿肉 500g", "price": 37.90 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -10.00 },
                    { "name": "黄龙绿豆糕 200g", "price": 8.80 },
                    { "name": "新黄心土豆 约600g", "price": 2.90 },
                    { "name": "怡宝纯净水 6L*3", "price": 26.40 },
                    { "name": "川娃子蒜蓉剁椒酱 240g", "price": 11.90 },
                    { "name": "商品优惠券", "price": -10.00 }
                ]
            }
        ],
        "2024-07-08": [
            {
                "shop": "小象",
                "items": [
                    { "name": "汉康常州豆皮 200g", "price": 4.80 },
                    { "name": "十月稻田东北长粒香米 5kg", "price": 35.90 },
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "正大叶黄素可生食鲜鸡蛋 10枚 530g", "price": 11.90 },
                    { "name": "华绿金针菇 400g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -10.00 }
                ]
            }
        ],
        "2024-07-09": [
            {
                "shop": "天猫",
                "note": "yottoy旗舰店",
                "items": [
                    { "name": "瑜伽垫 珊瑚粉 185*61cm三件套【瑜伽垫+网包+捆绳】185x80cm;6mm(初学者)", "price": 30.40 }
                ]
            }
        ],
        "2024-07-10": [
            {
                "shop": "小象",
                "items": [
                    { "name": "仲景原味香菇酱 230g", "price": 27.80 },
                    { "name": "四川优选黄柠檬2粒装 200g", "price": 2.30 },
                    { "name": "汉康香百页 300g", "price": 6.00 },
                    { "name": "怡宝纯净水 6L", "price": 8.80 },
                    { "name": "优质冷鲜猪汤骨（汤小排） 400g", "price": 9.90 },
                    { "name": "土黑猪鲜前排切块 300g", "price": 22.20 },
                    { "name": "新黄心土豆 约600g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "第2件半价", "price": -6.95 },
                    { "name": "商品优惠券", "price": -10.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "钙尔奇 碳酸钙片D3片(I)60片", "price": 56.43 }
                ]
            }
        ],
        "2024-07-12": [
            {
                "shop": "小象",
                "items": [
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "光明鲜牛奶 950ml", "price": 11.50 },
                    { "name": "优质冷鲜猪前腿肉 400g", "price": 12.80 },
                    { "name": "圣农冰鲜鸡全腿 400g", "price": 15.70 },
                    { "name": "四川优选黄柠檬2粒装 200g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -5.00 }
                ]
            }
        ],
        "2024-07-14": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 熟白芝麻 200g", "price": 7.66 },
                    { "name": "川珍朝天辣椒面250g罐装", "price": 11.98 },
                    { "name": "维达（Vinda）厨房卷纸 可水洗75节*2卷", "price": 5.21 },
                    { "name": "炊大皇 塑料保鲜盒套装 720ml*3正方形白色", "price": 7.66 }
                ]
            }, {
                "shop": "天猫",
                "note": "可可尚佳家居旗舰店",
                "items": [
                    { "name": "牛筋乳胶手套 耐磨耐用加厚款【1双装】L", "price": 0.24 }
                ]
            }, {
                "shop": "PDD",
                "note": "冠恒劳防用品官方旗舰店",
                "items": [
                    { "name": "冠恒乳胶手套-长筒版大码,1双珍珠白", "price": 3.97 }
                ]
            }, {
                "shop": "PDD",
                "note": "Libresse薇尔旗舰店",
                "items": [
                    { "name": "薇尔卫生巾285日用32片+420夜用18片", "price": 30.94 }
                ]
            }
        ],
        "2024-07-15": [
            {
                "shop": "小象",
                "items": [
                    { "name": "西瓜红蜜薯 约750g", "price": 6.06 },
                    { "name": "海鲜菇 240g", "price": 3.99 },
                    { "name": "海鲜菇 240g（赠品）", "price": 0.00 },
                    { "name": "怡宝纯净水 6L*4", "price": 35.20 },
                    { "name": "大码鲜鸡蛋 12枚 720g", "price": 0.01 },
                    { "name": "商品优惠券", "price": -10.00 }
                ]
            }
        ],
        "2024-07-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "京愿山东烟台 苹果 10斤75-80mm", "price": 24.75 }
                ]
            }
        ],
        "2024-07-17": [
            {
                "shop": "京东",
                "items": [
                    { "name": "张小泉 乌檀木整木菜板（30*20*2.2cm）", "price": 44.47 }
                ]
            }, {
                "shop": "天猫",
                "note": "康巴赫官方旗舰店",
                "items": [
                    { "name": "康巴赫旗舰店擀面杖 304不锈钢擀面杖", "price": 17.47 }
                ]
            }
        ],
        "2024-07-19": [
            {
                "shop": "小象",
                "items": [
                    { "name": "新黄心土豆 约600g", "price": 2.80 },
                    { "name": "光明利乐包3.2g乳蛋白纯牛奶 250ml*24盒", "price": 59.90 },
                    { "name": "有机番茄 300g", "price": 7.68 },
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "科尔沁冰鲜草原黄牛嫩牛肉 240g", "price": 24.90 },
                    { "name": "九华山林间散养土鸡蛋 10枚 400g", "price": 13.90 },
                    { "name": "薄皮青椒 250g", "price": 4.99 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -8.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "汰渍洗衣粉3.1斤 柠檬清香", "price": 11.02 },
                    { "name": "利得一次性PE点断式手撕保鲜膜30cm*150m", "price": 17.45 }
                ]
            }
        ],
        "2024-07-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "王守义 十三香 45g盒装*3", "price": 9.83 }
                ]
            }
        ],
        "2024-07-21": [
            {
                "shop": "小象",
                "items": [
                    { "name": "清美盐卤五香干 120g", "price": 3.50 },
                    { "name": "湘味特色螺丝椒 约300g", "price": 0.99 },
                    { "name": "象大厨脆皮烤肠 200g(5根)", "price": 12.90 },
                    { "name": "冷鲜鸡腿切块 500g", "price": 13.90 },
                    { "name": "象大厨柠檬拆骨凤爪 300g", "price": 15.90 },
                    { "name": "商品优惠券", "price": -15.00 }
                ]
            }
        ],
        "2024-07-23": [
            {
                "shop": "小象",
                "items": [
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "象大厨黑鸭经典鸭脖 (麻辣) 140g", "price": 8.80 }
                ]
            }
        ],
        "2024-07-24": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞香辣味火锅蘸料 120g", "price": 3.99 },
                    { "name": "海底捞醇香牛油火锅底料 150g", "price": 6.90 },
                    { "name": "黄心小娃娃菜 550g (3颗装)", "price": 8.50 },
                    { "name": "安井锁鲜装鱼豆腐 240g", "price": 16.50 },
                    { "name": "冰鲜海带丝 200g", "price": 4.70 },
                    { "name": "香葱 60g", "price": 1.18 },
                    { "name": "九华山林间散养土鸡蛋 10枚 400g", "price": 13.90 },
                    { "name": "崇明皱皮青椒 约350g", "price": 3.90 },
                    { "name": "新藕 500g", "price": 8.99 },
                    { "name": "味全乳酸菌饮品原味 435ml*2瓶", "price": 10.90 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -4.00 }
                ]
            }
        ],
        "2024-07-25": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "卫龙78°卤蛋 35g/颗", "price": 0.00 },
                    { "name": "海盐鲜牛乳苏打饼干 500g/袋", "price": 12.63 },
                    { "name": "黄瓜 约600g", "price": 4.62 },
                    { "name": "冰鲜海带丝 200g", "price": 4.35 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.00 },
                    { "name": "优质番茄 约500g", "price": 3.53 },
                    { "name": "香葱 约50g", "price": 0.93 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "优质冷鲜肥瘦比约3:7猪肉糜400g", "price": 9.90 }
                ]
            }
        ],
        "2024-07-27": [
            {
                "shop": "京东",
                "items": [
                    { "name": "三元方白纯牛奶整箱250ml*24盒", "price": 44.41 },
                    { "name": "多力 葵花籽油1.8L ", "price": 31.01 }
                ]
            }
        ],
        "2024-07-28": [
            {
                "shop": "小象",
                "items": [
                    { "name": "中盐日晒自然盐250g", "price": 2.90 },
                    { "name": "黄心小娃娃菜 550g (3颗装)", "price": 8.79 },
                    { "name": "优质番茄 约500g", "price": 3.79 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 32.60 },
                    { "name": "苏食鲜带皮五花肉 300g", "price": 15.90 },
                    { "name": "崇明西葫芦 300g", "price": 5.90 },
                    { "name": "香葱 60g", "price": 1.18 },
                    { "name": "有机红洋葱 300g", "price": 5.29 },
                    { "name": "土鸡蛋 8枚 400g", "price": 6.78 },
                    { "name": "松花菜半颗 500g", "price": 0.00 },
                    { "name": "商品优惠券", "price": -4.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "力士(LUX)香氛抑菌洗手液 400G", "price": 10.03 },
                    { "name": "洁柔有芯卷纸 4层200克*10卷", "price": 27.72 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/08/01-2024/08/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-07-30": [
            {
                "shop": "小象",
                "items": [
                    { "name": "黄瓜 约700g", "price": 6.63 },
                    { "name": "升元小麦口味冷面 600g", "price": 9.90 },
                    { "name": "崇明冷鲜草鸡半只 450g", "price": 22.90 },
                    { "name": "怡宝纯净水 6L*3", "price": 26.40 },
                    { "name": "象大厨韩式荞麦冷面 530g", "price": 7.90 },
                    { "name": "富硒谷物鸡蛋 15枚 675g", "price": 15.90 },
                    { "name": "四川优选黄柠檬2粒装 200g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "商品优惠券", "price": -4.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "水塔老陈醋6° 420ml", "price": 5.53 },
                    { "name": "李锦记 薄盐生抽 薄盐生抽500ml", "price": 8.83 }
                ]
            }
        ],
        "2024-07-31": [
            {
                "shop": "小象",
                "items": [
                    { "name": "冷鲜鸡大胸 400g", "price": 5.88 },
                    { "name": "慢养黑猪冷鲜通脊 300g", "price": 19.90 },
                    { "name": "三色彩椒 550g", "price": 8.90 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-08-01": [
            {
                "shop": "小象",
                "items": [
                    { "name": "安琪高活性干酵母 15g", "price": 2.50 },
                    { "name": "韭菜 300g", "price": 4.29 },
                    { "name": "紫洋葱 约750g", "price": 3.40 },
                    { "name": "怡宝纯净水 6L*1", "price": 8.80 },
                    { "name": "优质冷鲜带皮猪五花肉 400g", "price": 18.90 },
                    { "name": "白砂糖 400g", "price": 5.90 },
                    { "name": "香葱 60g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/07/01-2024/08/01)上海兴利开发有限公司", "price": 195.10 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/07/01-2024/08/01)上海兴利开发有限公司", "price": 38.89 }
                ]
            }
        ],
        "2024-08-02": [
            {
                "shop": "小象",
                "items": [
                    { "name": "小米椒 约50g", "price": 1.30 },
                    { "name": "四川优选黄柠檬2粒装 200g", "price": 1.80 },
                    { "name": "香菜 约100g", "price": 2.99 },
                    { "name": "精选老姜 约300g", "price": 5.49 },
                    { "name": "冷鲜鸡爪 400g", "price": 19.80 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "百卡不锈钢检测液水304鉴别316 检测液15ml", "price": 11.49 }
                ]
            }, {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 200.00元", "price": 197.18 }
                ]
            }
        ],
        "2024-08-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g (加赠100g)", "price": 13.90 },
                    { "name": "独头蒜 200g", "price": 10.50 },
                    { "name": "紫皮大蒜 约250g", "price": 4.56 },
                    { "name": "三红胡萝卜 约600g", "price": 3.29 },
                    { "name": "梅香咸蛋 4枚 260g", "price": 8.99 },
                    { "name": "心相印70抽厨房用纸 3包", "price": 10.90 },
                    { "name": "怡宝纯净水 6L*3", "price": 21.40 },
                    { "name": "正大叶黄素可生食鲜鸡蛋 10枚 530g", "price": 11.90 },
                    { "name": "皱皮青椒 约300g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "THERMOS膳魔师保温杯500ml 紫色", "price": 121.02 },
                    { "name": "THERMOS膳魔师保温杯500ml 珍珠白", "price": 114.98 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "【芬必得】布洛芬缓释胶囊0.4g*24粒/盒", "price": 18.40 },
                    { "name": "【洁葆诺】棉签80mm*100支/袋", "price": 1.60 },
                    { "name": "打包费", "price": 0.50 }
                ]
            }
        ],
        "2024-08-04": [
            {
                "shop": "小象",
                "items": [
                    { "name": "国产千禧果 500g", "price": 6.98 },
                    { "name": "金锣肉粒多香肠 40g*8支", "price": 10.90 },
                    { "name": "蒙牛随变经典香草口味冰淇淋 75g*5支", "price": 12.90 },
                    { "name": "白象高钙鸡蛋金丝挂面 800g", "price": 8.60 },
                    { "name": "象大厨哈尔滨风味红肠 50g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 长粒王香米 10斤", "price": 25.28 }
                ]
            }
        ],
        "2024-08-05": [
            {
                "shop": "小象",
                "items": [
                    { "name": "中粮家佳康鲜精装后腿精肉 200g", "price": 12.80 },
                    { "name": "新黄心土豆 约600g", "price": 3.10 },
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "香葱(赠品)", "price": 3.00 }
                ]
            }
        ],
        "2024-08-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "刺黄瓜 500g/份", "price": 9.77 },
                    { "name": "冷鲜鸡大胸 400g(加赠80g)", "price": 10.70 },
                    { "name": "草莓番茄 300g/份", "price": 8.93 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.60 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "妙洁铝箔锡纸20米", "price": 13.39 }
                ]
            }
        ],
        "2024-08-07": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "泡椒去骨凤爪 200g/盒", "price": 10.57 },
                    { "name": "吮指鸭锁骨（微辣）160g", "price": 13.13 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-08": [
            {
                "shop": "小象",
                "items": [
                    { "name": "欣和葱伴侣6月香豆瓣酱 300g", "price": 7.39 },
                    { "name": "海天黄豆酱 340g", "price": 7.50 },
                    { "name": "草原红太阳烧烤料 35g", "price": 4.80 },
                    { "name": "玉棠黄冰糖 400g", "price": 13.90 },
                    { "name": "进口原切牛腱子 1kg", "price": 6.90 },
                    { "name": "大葱 约550g", "price": 6.99 },
                    { "name": "澳洲冰鲜谷饲牛腱子 400g", "price": 43.80 },
                    { "name": "象大厨精选辣椒干 100g", "price": 12.90 },
                    { "name": "草原红太阳烧烤料香辣味 35g", "price": 4.80 },
                    { "name": "古方红糖 36g", "price": 6.90 },
                    { "name": "象大厨草果 50g", "price": 9.90 },
                    { "name": "象大厨烧烤料 45g", "price": 5.90 },
                    { "name": "象大厨孜然粒 30g", "price": 3.90 },
                    { "name": "象大厨桂皮 50g", "price": 5.90 },
                    { "name": "象大厨香叶 15g", "price": 9.00 },
                    { "name": "象大厨孜然粉 40g", "price": 7.90 },
                    { "name": "美丽雅金彩浸塑衣架 10支装", "price": 13.90 },
                    { "name": "鲜切南瓜 约500g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-08-10": [
            {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g (加赠100g)", "price": 13.90 },
                    { "name": "国产千禧果 500g", "price": 6.98 },
                    { "name": "湘味特色 螺丝椒 约300g", "price": 5.49 },
                    { "name": "越南红心火龙果单粒 320g", "price": 5.89 },
                    { "name": "香菇 约200g", "price": 5.99 },
                    { "name": "怡宝纯净水 6L", "price": 8.80 },
                    { "name": "认养一头牛3.6g蛋白娟姗牛乳 700ml (新老包装)", "price": 19.90 },
                    { "name": "认养一头牛3.6g蛋白娟姗牛乳 700ml (新老包装) 赠品", "price": 0.00 },
                    { "name": "水八仙 新藕 500g", "price": 7.99 },
                    { "name": "山林红心谷物蛋 18枚 810g", "price": 11.80 },
                    { "name": "溏心松花蛋 6枚 360g", "price": 9.89 },
                    { "name": "小象无抗富硒可生食鲜鸡蛋 6枚 300g", "price": 8.30 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "金号A类儿童毛巾纯棉 面巾3条", "price": 20.86 },
                    { "name": "洁丽雅毛巾新疆长绒棉 2条装100g", "price": 16.83 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 12.74 },
                    { "name": "紫林 醋 4.5度山西陈醋420ml", "price": 5.67 }
                ]
            }
        ],
        "2024-08-11": [
            {
                "shop": "小象",
                "items": [
                    { "name": "国产千禧果 500g", "price": 6.98 },
                    { "name": "黄瓜 约700g", "price": 9.90 },
                    { "name": "本地鲜崇明西葫芦 300g", "price": 5.99 },
                    { "name": "怡宝纯净水 6L*1", "price": 8.80 },
                    { "name": "认养一头牛4.0g蛋白娟姗牛奶200ml*3", "price": 10.90 },
                    { "name": "皱皮青椒 约300g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 绿豆 500g", "price": 5.55 }
                ]
            }
        ],
        "2024-08-12": [
            {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g (加赠100g)", "price": 5.90 },
                    { "name": "紫皮大蒜 约250g", "price": 4.56 },
                    { "name": "有机胡萝卜 300g", "price": 5.76 },
                    { "name": "有机香菇 100g", "price": 5.50 },
                    { "name": "冷鲜鸡琵琶腿 400g", "price": 6.95 },
                    { "name": "紫洋葱 约750g", "price": 3.40 },
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "有机莲藕 400g", "price": 8.40 },
                    { "name": "无抗DHA土鸡蛋 8枚 320g", "price": 9.69 },
                    { "name": "鲜切南瓜 约500g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-08-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "优质番茄 约500g", "price": 4.89 },
                    { "name": "黄瓜 约600g", "price": 9.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 26.40 }
                ]
            }
        ],
        "2024-08-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "秋浦河散养土鸡蛋10枚 400g", "price": 24.90 },
                    { "name": "益客冷鲜鸡琵琶腿 400g", "price": 7.99 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 12.90 }
                ]
            }
        ],
        "2024-08-15": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "皱皮蜜宝红心火龙果3个 约1kg", "price": 9.90 },
                    { "name": "紫薯 500g/份", "price": 10.90 }
                ]
            }
        ],
        "2024-08-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "紫皮大蒜 约350g", "price": 5.93 },
                    { "name": "冰鲜海带结 200g", "price": 5.19 },
                    { "name": "黄瓜 约600g", "price": 7.46 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "有机芹菜 250g", "price": 7.70 },
                    { "name": "雪碧清爽柠檬味汽水 1.25L", "price": 5.11 },
                    { "name": "薄百页 110g", "price": 5.10 },
                    { "name": "黄柠檬 4个 500g", "price": 5.56 },
                    { "name": "西兰花 约600g", "price": 7.34 },
                    { "name": "红洋葱 约750g", "price": 3.23 }
                ]
            }
        ],
        "2024-08-17": [
            {
                "shop": "京东",
                "items": [
                    { "name": "WMF德国福腾宝 Astoria双层汤蒸锅24cm", "price": 327.02 },
                    { "name": "威露士（Walch）空调清洗消毒液500ml", "price": 28.30 },
                    { "name": "朴西 拖鞋女 浅粉37-38", "price": 24.33 }
                ]
            }
        ],
        "2024-08-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "武威自然熟番茄 约500g", "price": 6.52 },
                    { "name": "翠冠梨 约1kg", "price": 12.87 },
                    { "name": "有机上海青 250g/份", "price": 5.96 },
                    { "name": "光明散养草鸡蛋10枚 400g", "price": 12.59 },
                    { "name": "正大可生食鲜鸡蛋12枚 660g", "price": 12.97 },
                    { "name": "黄瓜 约600g", "price": 8.21 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.66 }
                ]
            }, {
                "shop": "PDD",
                "note": "友固不锈钢",
                "items": [
                    { "name": "卡扣304不锈钢U型抱箍M6*60*80", "price": 2.63 }
                ]
            }, {
                "shop": "PDD",
                "note": "金超官方旗舰店",
                "items": [
                    { "name": "金超304不锈钢钩钉M5*60-直钩型", "price": 3.97 }
                ]
            }, {
                "shop": "PDD",
                "note": "友固不锈钢",
                "items": [
                    { "name": "304抱箍不锈钢管夹51mm【M6螺丝+平弹帽】", "price": 7.30 }
                ]
            }, {
                "shop": "PDD",
                "note": "大器家具五金",
                "items": [
                    { "name": "不锈钢三角支架3mm厚(12寸拆卸)30cm一支", "price": 6.33 }
                ]
            }
        ],
        "2024-08-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "温氏冷鲜岭南皇鸡（整只）900g", "price": 31.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "海氏海诺一次性医用外科口罩 50只", "price": 16.73 },
                    { "name": "统一 藤娇 藤椒牛肉面100g*5袋", "price": 11.64 },
                    { "name": "白象 香菜面 115g*5", "price": 22.90 },
                    { "name": "白象 红烧牛肉泡面130g*5连包", "price": 14.90 },
                    { "name": "运费", "price": 4.39 },
                    { "name": "优惠券", "price": 10.52 }
                ]
            }, {
                "shop": "PDD",
                "note": "CLL穗美人",
                "items": [
                    { "name": "睡裙 带固定胸垫 冰丝-郁金香,XL码", "price": 28.80 }
                ]
            }
        ],
        "2024-08-20": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "医用外科口罩 10只/包", "price": 4.90 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "高原夏菜 青甘蓝 约800g", "price": 6.99 },
                    { "name": "苏食鲜带皮五花肉 300g", "price": 17.90 },
                    { "name": "三红胡萝卜 约600g", "price": 3.39 },
                    { "name": "大葱 约550g", "price": 6.99 },
                    { "name": "高原夏菜 紫甘蓝 约1kg", "price": 4.30 },
                    { "name": "中盐日晒自然盐 250g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "妙洁 抗菌海绵百洁布 10片装", "price": 13.00 },
                    { "name": "宜之选垃圾袋50*60cm*100只", "price": 7.19 },
                    { "name": "维达（Vinda）厨房抽纸 80抽*3包", "price": 8.90 },
                    { "name": "李锦记 精选系列 精选生抽500ml", "price": 6.86 },
                    { "name": "水塔老陈醋6° 420ml", "price": 4.84 }
                ]
            }, {
                "shop": "PDD",
                "note": "回力一兴专卖店",
                "items": [
                    { "name": "回力 T恤短袖 丁香紫-紫Fhsl(5)K,L", "price": 26.40 }
                ]
            }, {
                "shop": "PDD",
                "note": "爱丽缇女装旗舰店",
                "items": [
                    { "name": "短袖t恤 收麦子油画:白色023,L", "price": 34.41 }
                ]
            }, {
                "shop": "PDD",
                "note": "MINISO名创优品女装旗舰店",
                "items": [
                    { "name": "名创优品 短袖t恤-浅蓝(秀线字),L", "price": 31.95 }
                ]
            }, {
                "shop": "PDD",
                "note": "回力男装服饰旗舰店",
                "items": [
                    { "name": "回力短裤男士 黑(HL白LOGO),XXL", "price": 23.20 }
                ]
            }
        ],
        "2024-08-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "红洋葱 300g/份", "price": 4.85 },
                    { "name": "猪五花肉 约400g", "price": 22.17 },
                    { "name": "山林大红肠 400g/袋", "price": 27.51 },
                    { "name": "青甘蓝约1kg", "price": 6.50 },
                    { "name": "娃哈哈纯净水 5.5L*4桶/组", "price": 31.50 },
                    { "name": "香葱 约50g", "price": 1.59 },
                    { "name": "土鸡蛋8枚 440g", "price": 6.79 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "一个 创意北欧马桶刷套装", "price": 4.27 },
                    { "name": "马桶吸皮搋子马桶抽", "price": 6.96 }
                ]
            }
        ],
        "2024-08-22": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "泰森冷冻鸡琵琶腿 500g", "price": 10.37 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 7.83 },
                    { "name": "蜜香橙肉甜薯 500g", "price": 9.99 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "魔幻厨房冰皮月饼模具按压器6花片50g", "price": 7.07 },
                    { "name": "展艺 水磨糯米粉 500g", "price": 8.02 }
                ]
            }
        ],
        "2024-08-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "香葱 约50g", "price": 1.76 },
                    { "name": "木薯淀粉 200g/袋", "price": 4.85 },
                    { "name": "蒸笼纸23cm 50张/包", "price": 9.23 },
                    { "name": "山林大红肠 400g/袋", "price": 45.91 },
                    { "name": "紫薯 500g", "price": 10.17 },
                    { "name": "黑芝麻汤圆 400g", "price": 12.07 },
                    { "name": "鱼豆腐 240g", "price": 17.80 }
                ]
            }
        ],
        "2024-08-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "面巾纸 30抽", "price": 0.00 },
                    { "name": "熟番茄 约500g", "price": 9.90 },
                    { "name": "青圆椒 约500g", "price": 9.90 },
                    { "name": "新土豆 约600g", "price": 3.49 },
                    { "name": "茄子 约800g", "price": 12.90 },
                    { "name": "切片南瓜 约500g", "price": 2.99 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "美的（Midea）绞肉机家用", "price": 112.39 }
                ]
            }
        ],
        "2024-08-25": [
            {
                "shop": "小象",
                "items": [
                    { "name": "光明上海农场散养土鸡蛋10枚400g", "price": 13.50 },
                    { "name": "正大叶黄素可生食鲜鸡蛋10枚530g", "price": 11.90 },
                    { "name": "进口香蕉 约600g", "price": 7.37 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 22.90 },
                    { "name": "苏食鲜带皮五花肉 300g", "price": 17.90 },
                    { "name": "紫洋葱 约750g", "price": 3.40 },
                    { "name": "怡宝纯净水 6L", "price": 23.67 },
                    { "name": "慢养黑猪冷鲜腿肉 350g", "price": 16.90 },
                    { "name": "哈尔滨清爽啤酒 330ml", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-08-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "崇明青椒 300g", "price": 7.99 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "光明益生菌风味发酵乳 1.5kg", "price": 13.80 },
                    { "name": "冰鲜海带丝 200g", "price": 4.70 },
                    { "name": "三红胡萝卜 约600g", "price": 3.05 },
                    { "name": "东北农嫂黄糯玉米 200g", "price": 6.90 },
                    { "name": "冬瓜切片 约550g", "price": 3.55 },
                    { "name": "甜玉米 约1.05kg", "price": 7.80 },
                    { "name": "鲜切南瓜 约500g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "东大街 肠衣 可灌10斤肉 含灌肠器+线", "price": 21.00 },
                    { "name": "十月稻田 黄糯玉米 3.52斤(220g*8根)", "price": 59.90 },
                    { "name": "十月稻田 糯米 2斤", "price": 15.80 },
                    { "name": "优惠券", "price": -35.54 }
                ]
            }, {
                "shop": "PDD",
                "note": "森马官方旗舰店",
                "items": [
                    { "name": "森马外套男 浅卡其,180/96A/XL", "price": 137.70 }
                ]
            }, {
                "shop": "PDD",
                "note": "热风女装官方旗舰店",
                "items": [
                    { "name": "热风女士复古直筒牛仔裤 兰色 29", "price": 98.30 }
                ]
            }, {
                "shop": "PDD",
                "note": "MissWiss内衣旗舰店",
                "items": [
                    { "name": "Misswiss防晒口罩 银河灰", "price": 7.70 }
                ]
            }, {
                "shop": "PDD",
                "note": "回力男装服饰旗舰店",
                "items": [
                    { "name": "回力外穿短裤 灰(HL白LOGO),XXL", "price": 23.20 }
                ]
            }, {
                "shop": "PDD",
                "note": "小野和子旗舰店",
                "items": [
                    { "name": "防晒面罩 黑色【3D显瘦】", "price": 19.00 }
                ]
            }
        ],
        "2024-08-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "保鲜罩 25只", "price": 0.00 },
                    { "name": "猪前腿 约350g", "price": 11.63 },
                    { "name": "猪五花肉 约400g", "price": 24.11 },
                    { "name": "浓香型白酒 480mL", "price": 10.14 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.22 }
                ]
            }, {
                "shop": "PDD",
                "note": "热风女装官方旗舰店",
                "items": [
                    { "name": "热风 披肩条纹针织衫 棕色 M", "price": 71.10 }
                ]
            }, {
                "shop": "PDD",
                "note": "AKASUGU内衣官方旗舰店",
                "items": [
                    { "name": "Akasugu秋裤女士 羊绒蛋白 远红外升温zf, XL", "price": 31.40 }
                ]
            }
        ],
        "2024-08-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "卫生湿巾 10片/包", "price": 0.00 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 11.22 },
                    { "name": "甘肃青甘蓝 约1kg", "price": 8.77 },
                    { "name": "韭菜 约300g", "price": 6.13 },
                    { "name": "切片南瓜 约500g", "price": 3.41 },
                    { "name": "紫薯 500g", "price": 10.65 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "七匹狼男士内衣旗舰店",
                "items": [
                    { "name": "七匹狼纯棉秋裤男士 深灰+黑色,2XL", "price": 65.90 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/09/01-2024/09/30)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-08-29": [
            {
                "shop": "小象",
                "items": [
                    { "name": "紫皮大蒜 约250g", "price": 4.69 },
                    { "name": "进口香蕉 约600g", "price": 7.37 },
                    { "name": "怡宝纯净水 6L*1", "price": 8.80 },
                    { "name": "贵州红心谷物蛋 10枚 450g", "price": 12.60 },
                    { "name": "正大叶黄素可生食鲜鸡蛋 10枚 530g", "price": 11.90 },
                    { "name": "鲜切南瓜 约500g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-08-30": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "Rockit乐淇小苹果 40g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.57 },
                    { "name": "新土豆 约600g", "price": 3.40 },
                    { "name": "猪汤骨 约400g", "price": 11.50 },
                    { "name": "猪汤小排 约400g", "price": 15.52 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 花生米 2斤", "price": 14.73 }
                ]
            }
        ],
        "2024-08-31": [
            {
                "shop": "小象",
                "items": [
                    { "name": "安琪高活性干酵母 15g", "price": 2.50 },
                    { "name": "仲景原味香菇酱 230g*2", "price": 10.85 },
                    { "name": "海底捞番茄火锅底料 200g", "price": 11.90 },
                    { "name": "海底捞香辣火锅蘸料 120g*2", "price": 8.50 },
                    { "name": "怡宝纯净水 6L*3", "price": 16.40 },
                    { "name": "伊利原味牛奶片 32g", "price": 3.80 },
                    { "name": "海底捞醇香牛油150g*2", "price": 14.90 },
                    { "name": "今麦郎蓝标包装饮用水5L*2瓶", "price": 11.80 },
                    { "name": "泰森鲜鸡大胸500g", "price": 13.90 }
                ]
            }
        ],
        "2024-09-01": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "棉柔抹布 28*28cm", "price": 0.00 },
                    { "name": "橘心蜜薯 约750g", "price": 4.87 },
                    { "name": "魔芋爽 50g", "price": 3.53 },
                    { "name": "甜玉米 约1kg", "price": 5.70 },
                    { "name": "草鸡蛋 10枚", "price": 9.58 },
                    { "name": "蜜柑 约550g", "price": 20.51 },
                    { "name": "娃娃菜 3颗", "price": 6.82 },
                    { "name": "中百页 150g", "price": 5.42 },
                    { "name": "牛肉丸 250g", "price": 18.58 },
                    { "name": "牛奶滑鸭血 300g", "price": 9.27 },
                    { "name": "冰鲜海带丝 200g", "price": 4.52 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "心相印有芯卷纸 茶语系列4层200g*10卷", "price": 18.77 },
                    { "name": "水塔红盖老陈醋6°420ml", "price": 5.18 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "清风厨房纸巾抽取式 2层76抽3包", "price": 3.6 }
                ]
            }
        ],
        "2024-09-02": [
            {
                "shop": "小象",
                "items": [
                    { "name": "紫皮大蒜 约250g", "price": 4.85 },
                    { "name": "三红胡萝卜 约600g", "price": 3.05 },
                    { "name": "胭脂红蜜薯 约750g", "price": 6.80 },
                    { "name": "栖霞红富士苹果 4粒装约900g", "price": 12.80 },
                    { "name": "鲜切南瓜 约500g", "price": 3.50 },
                    { "name": "甜玉米 约1.05kg", "price": 7.80 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "农科玉五常甜糯玉米4.6斤 230g*10根", "price": 37.68 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "道道全压榨菜籽油食用油1.8L", "price": 23.55 }
                ]
            }
        ],
        "2024-09-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "崇明韭菜 350g", "price": 6.99 },
                    { "name": "黄心小娃娃菜 550g", "price": 7.91 },
                    { "name": "烟薯25号 750g", "price": 7.99 },
                    { "name": "怡宝纯净水 6L*1", "price": 8.80 },
                    { "name": "佳农进口香甜蕉 700g", "price": 9.89 },
                    { "name": "光明上海农场五谷鲜鸡蛋 18枚 1kg", "price": 21.70 },
                    { "name": "天平朝晖简雅漱口杯", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 },
                    { "name": "【本地鲜】崇明西葫芦300g", "price": 7.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "DR.RILEY臭虫杀虫剂", "price": 18.68 },
                    { "name": "老管家 管道除臭剂 1L", "price": 16.49 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/08/01-2024/09/01)上海兴利开发有限公司", "price": 46.76 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/08/01-2024/09/01)上海兴利开发有限公司", "price": 250.46 }
                ]
            }
        ],
        "2024-09-04": [
            {
                "shop": "小象",
                "items": [
                    { "name": "湘味特色螺丝椒 约300g", "price": 6.49 },
                    { "name": "线椒 约160g", "price": 5.99 },
                    { "name": "壹号土猪冷鲜去皮五花肉 250g", "price": 22.90 },
                    { "name": "壹号土猪冷鲜去皮五花肉片 150g", "price": 16.60 },
                    { "name": "中粮家佳康冷鲜猪梅花肉 400g", "price": 20.30 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "御庭沁居",
                "items": [
                    { "name": "马克杯 米奇粉680ml", "price": 5.14 }
                ]
            }, {
                "shop": "PDD",
                "note": "御庭沁居",
                "items": [
                    { "name": "马克杯 奶青色680ml", "price": 5.14 }
                ]
            }
        ],
        "2024-09-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "香冬瓜 约1.2kg", "price": 7.40 },
                    { "name": "千禧小番茄 500g", "price": 6.48 },
                    { "name": "优质番茄 约500g", "price": 5.83 },
                    { "name": "西葫芦 约400g", "price": 5.64 },
                    { "name": "新土豆 约600g", "price": 3.23 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.16 },
                    { "name": "切片南瓜 约500g", "price": 5.54 },
                    { "name": "当季新藕 500g", "price": 8.74 },
                    { "name": "川藏特色黑猪大里脊 约400g", "price": 15.79 }
                ]
            }
        ],
        "2024-09-07": [
            {
                "shop": "小象",
                "items": [
                    { "name": "怡宝纯净水 6L*1", "price": 8.80 },
                    { "name": "辈儿香麻辣味八爪烧 46g", "price": 1.90 },
                    { "name": "辈儿香酱爆肉味八爪烧 46g", "price": 1.90 },
                    { "name": "九华山林间散养土鸡蛋 10枚 400g", "price": 9.90 },
                    { "name": "正大叶黄素可生食鲜鸡蛋 10枚 530g", "price": 11.90 }
                ]
            }, {
                "shop": "天猫",
                "note": "香山旗舰店",
                "items": [
                    { "name": "香山精准电子秤体重秤 云姿2 LED萌白 电池", "price": 22.24 }
                ]
            }, {
                "shop": "PDD",
                "note": "清恒日化专营店",
                "items": [
                    { "name": "冷酸灵牙刷2支", "price": 4.28 }
                ]
            }, {
                "shop": "PDD",
                "note": "欧莱雅LOREAL洗护专卖店",
                "items": [
                    { "name": "欧莱雅洗发水 洗护套装-700ml", "price": 29.61 }
                ]
            }
        ],
        "2024-09-08": [
            {
                "shop": "京东",
                "items": [
                    { "name": "紫林 醋 4.5度山西陈醋500ml", "price": 8.45 },
                    { "name": "十月稻田 白糯玉米 4.16斤(260g*8根)", "price": 29.27 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 14.72 },
                    { "name": "正宗山东烟薯25号 中果净重4.5斤单果3-8两", "price": 12.33 },
                    { "name": "映趣电动鼻毛修剪器", "price": 0.00 }
                ]
            }, {
                "shop": "淘宝",
                "note": "nerdy旗舰店",
                "items": [
                    { "name": "NERDY 开衫连帽宽松休闲卫衣女 深蓝色 S", "price": 193.64 }
                ]
            }, {
                "shop": "PDD",
                "note": "东北农嫂旗舰店",
                "items": [
                    { "name": "东北农嫂 黄糯玉米1.45kg(8-9根) ", "price": 20.39 }
                ]
            }
        ],
        "2024-09-09": [
            {
                "shop": "小象",
                "items": [
                    { "name": "龍舒跑地童子鸡整鸡 750g", "price": 20.90 },
                    { "name": "怡宝纯净水 6L*4", "price": 32.20 },
                    { "name": "圣农冰鲜鸡琵琶腿 400g", "price": 9.50 },
                    { "name": "美丽雅大号抽取式保鲜袋 35cm*25cm 50只", "price": 0.00 },
                    { "name": "香葱(赠品)", "price": 0.00 }
                ]
            }
        ],
        "2024-09-10": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "锅香老豆腐 400g", "price": 5.44 },
                    { "name": "甜玉米 约1kg", "price": 6.80 },
                    { "name": "有机南瓜 500g", "price": 6.35 },
                    { "name": "散养谷粮蛋 15枚", "price": 18.08 },
                    { "name": "紫皮大蒜 约350g", "price": 6.16 },
                    { "name": "香冬瓜 约1.2kg", "price": 7.32 }
                ]
            }, {
                "shop": "PDD",
                "note": "匠CEGAR旗舰店",
                "items": [
                    { "name": "匠牌刀削面刀1.2毫米款+全钢无缝", "price": 13.90 }
                ]
            }
        ],
        "2024-09-12": [
            {
                "shop": "小象",
                "items": [
                    { "name": "德青源A级鲜鸡蛋 15枚750g", "price": 19.90 },
                    { "name": "爱森鲜精肉丝 200g", "price": 10.90 },
                    { "name": "湘味特色螺丝椒 约300g", "price": 8.58 },
                    { "name": "三红胡萝卜 约600g", "price": 3.05 },
                    { "name": "中粮家佳康精装修冰鲜梅花肉丝 150g", "price": 6.71 },
                    { "name": "新蒜苔 250g", "price": 5.99 },
                    { "name": "正大叶黄素可生食鲜鸡蛋 10枚530g", "price": 11.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）厨房卷纸 可水洗75节*8卷", "price": 18.29 }
                ]
            }
        ],
        "2024-09-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "切片南瓜 约500g", "price": 3.79 },
                    { "name": "小里脊 约170g", "price": 18.46 },
                    { "name": "新土豆 约1kg", "price": 5.26 },
                    { "name": "红心蜜柚 1个", "price": 14.54 }
                ]
            }
        ],
        "2024-09-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "崇明青茄子 600g", "price": 10.80 },
                    { "name": "螺丝椒 约300g", "price": 8.99 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "茄子 约700g", "price": 11.20 },
                    { "name": "怡宝纯净水 6L*4", "price": 35.20 },
                    { "name": "鲜切南瓜 约500g", "price": 2.70 },
                    { "name": "白象多半袋面2代红烧牛肉面 130*5袋", "price": 16.90 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河长粒香大米5kg", "price": 31.06 }
                ]
            }
        ],
        "2024-09-15": [
            {
                "shop": "小象",
                "items": [
                    { "name": "锋味派原味黑猪肉爆汁烤肠 200g*2", "price": 36.08 },
                    { "name": "新鲜初生蛋 12枚 420g", "price": 12.60 },
                    { "name": "豫竹脆丁壳奥尔良鸡翅味干吃面 45g", "price": 1.80 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g", "price": 13.90 },
                    { "name": "德青源A级鲜鸡蛋 15枚 750g", "price": 19.90 },
                    { "name": "紫皮大蒜 约250g", "price": 4.85 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 27.90 },
                    { "name": "采宗农有机银耳 60g", "price": 8.80 },
                    { "name": "香葱(赠品) 约20g", "price": 0.00 },
                    { "name": "优惠券", "price": -12.00 }
                ]
            }
        ],
        "2024-09-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 白甜糯玉米 4.16斤(260g*8根)", "price": 35.27 }
                ]
            }
        ],
        "2024-09-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "中百页 150g", "price": 5.09 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-09-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "鸡琵琶腿 400g", "price": 22.13 },
                    { "name": "怡宝纯净水 6L/桶", "price": 17.17 }
                ]
            }
        ],
        "2024-09-20": [
            {
                "shop": "小象",
                "items": [
                    { "name": "优质冷鲜猪梅花肉 250g", "price": 10.62 },
                    { "name": "德青源A级鲜鸡蛋 15枚750g", "price": 17.85 },
                    { "name": "壹号土猪冷鲜去皮五花肉 250g", "price": 13.90 },
                    { "name": "有机莲藕 400g", "price": 12.50 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-09-21": [
            {
                "shop": "小象",
                "items": [
                    { "name": "象大厨嗨聊锅潮汕牛肉丸 180g", "price": 10.90 },
                    { "name": "锋味派原味黑猪肉爆汁烤肠 200g", "price": 34.97 },
                    { "name": "采宗农有机银耳 60g", "price": 8.80 },
                    { "name": "新黄心土豆 约600g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "森马（Semir）长袖T恤女半高领 橄榄绿L", "price": 40.14 },
                    { "name": "HLA海澜之家 圆领毛衣男 中篮（89）185/100A（XXL）", "price": 41.08 },
                    { "name": "波司登 羽绒服男 90绒 黑色8056，185/100A", "price": 389.01 }
                ]
            }
        ],
        "2024-09-22": [
            {
                "shop": "京东",
                "items": [
                    { "name": "波司登羽绒服90绒 女款连帽 黑色8056", "price": 338.75 },
                    { "name": "十月稻田 白甜糯玉米 260g*8根", "price": 32.16 },
                    { "name": "禾煜 东北黑龙江黑木耳200g", "price": 21.93 }
                ]
            }
        ],
        "2024-09-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "散养谷粮蛋 15枚", "price": 18.46 },
                    { "name": "有机生菜 250g", "price": 8.33 },
                    { "name": "怡宝纯净水 6L/桶", "price": 24.50 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "紫皮大蒜 约250g", "price": 4.85 },
                    { "name": "新黄心土豆 约600g", "price": 3.30 },
                    { "name": "圣迪乐村粮心优食鲜鸡蛋 675g", "price": 16.90 },
                    { "name": "云南生菜 500g", "price": 6.47 },
                    { "name": "怡宝纯净水 6L*3", "price": 26.40 },
                    { "name": "鲜切南瓜 约500g", "price": 3.89 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "德克士【9.9吃堡】堡卷三选一", "price": 8.90 }
                ]
            }
        ],
        "2024-09-25": [
            {
                "shop": "小象",
                "items": [
                    { "name": "黄瓜 约700g", "price": 8.36 },
                    { "name": "温氏冰鲜黄油母鸡半只 500g", "price": 24.90 },
                    { "name": "冬瓜切片 约550g", "price": 3.10 },
                    { "name": "光明上海农场散养土鸡蛋 10枚400g", "price": 14.40 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "充值中心",
                "items": [
                    { "name": "流量充值-山东联通-14G", "price": 23.94 }
                ]
            }
        ],
        "2024-09-26": [
            {
                "shop": "小象",
                "items": [
                    { "name": "想念刀削面 1kg", "price": 13.80 },
                    { "name": "锋味派原味黑猪肉爆汁烤肠 200g*3", "price": 59.74 },
                    { "name": "睿洁宫廷风单支装牙刷", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "维达（Vinda）抽纸 3层100抽*6包", "price": 9.90 },
                    { "name": "维达（Vinda）抽纸 3层150抽*3包", "price": 9.90 },
                    { "name": "优惠券", "price": -7.40 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 11.83 },
                    { "name": "水塔老陈醋6° 420ml", "price": 5.04 },
                    { "name": "舒客专效美白防蛀牙膏 2支共260g", "price": 9.90 },
                    { "name": "心相印有芯卷纸 4层200g*10卷", "price": 29.90 },
                    { "name": "水塔老陈醋6° 420ml", "price": -9.07 }
                ]
            }
        ],
        "2024-09-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "谷物鲜鸡蛋 18枚", "price": 17.50 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 11.50 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "农科玉五常甜糯玉米3.68斤 230g*8根", "price": 34.07 }
                ]
            }
        ],
        "2024-09-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "普罗旺斯番茄 约500g", "price": 9.07 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 12.75 },
                    { "name": "琯溪三红蜜柚 1个 1.25kg", "price": 13.12 },
                    { "name": "泰森冷鲜去皮上腿肉 400g", "price": 11.82 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 8.74 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/10/01-2024/10/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-09-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 17.60 },
                    { "name": "泰森冷鲜鸡腿块 550g", "price": 15.80 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 12.90 }
                ]
            }
        ],
        "2024-09-30": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "可生食鲜鸡蛋 10枚装", "price": 13.90 },
                    { "name": "冷鲜澳洲谷饲原切牛腩 500g", "price": 19.92 },
                    { "name": "冷鲜澳洲谷饲原切牛上脑块 500g", "price": 39.92 },
                    { "name": "超值 鲜牛奶 950 毫升", "price": 8.50 },
                    { "name": "冷冻谷饲牛肩肉 1千克", "price": 49.90 },
                    { "name": "螺丝椒 300克", "price": 8.59 },
                    { "name": "超值 黄瓜 1千克", "price": 6.90 },
                    { "name": "白萝卜 1200克", "price": 7.75 },
                    { "name": "秋林里道斯红肠 345g", "price": 39.90 },
                    { "name": "超值 香卤五香干 180g", "price": 3.15 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "晟旎尚品 抗菌加厚马桶垫子*2", "price": 17.32 },
                    { "name": "水星家纺 枕头 记忆棉枕 对装 高10cm", "price": 123.34 },
                    { "name": "无印良品 毛巾 2条装", "price": 16.02 },
                    { "name": "美厨（maxcook）316L不锈钢盘碟 22cm", "price": 20.37 }
                ]
            }, {
                "shop": "PDD",
                "note": "充值中心",
                "items": [
                    { "name": "流量充值-山东联通-7G", "price": 18.90 }
                ]
            }
        ],
        "2024-10-01": [
            {
                "shop": "小象",
                "items": [
                    { "name": "心相印吸油锁水抽取式厨房纸巾2层70抽*3包", "price": 9.80 },
                    { "name": "怡宝纯净水 6L*4", "price": 35.20 },
                    { "name": "白象多半袋面2代红烧牛肉面 130*5袋", "price": 16.90 },
                    { "name": "鲜切南瓜 约500g", "price": 0.00 }
                ]
            }
        ],
        "2024-10-02": [
            {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/09/01-2024/10/01)上海兴利开发有限公司", "price": 129.24 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/09/01-2024/10/01)上海兴利开发有限公司", "price": 40.20 }
                ]
            }
        ],
        "2024-10-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "新黄心土豆 约600g", "price": 3.30 },
                    { "name": "进口香蕉 约600g", "price": 7.37 },
                    { "name": "怡宝纯净水 6L*4", "price": 31.56 },
                    { "name": "新疆库尔勒香梨 约1kg", "price": 9.90 },
                    { "name": "康沙思瑶蜜薯 500g", "price": 8.80 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "珍珠滴眼液；连花清瘟胶囊", "price": 41.49 }
                ]
            }
        ],
        "2024-10-04": [
            {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 辽河 长粒香大米 5kg", "price": 25.55 }
                ]
            }
        ],
        "2024-10-05": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "冷鲜金鲳鱼 350g", "price": 13.44 },
                    { "name": "冷鲜澳洲牛小米龙 800g", "price": 56.90 },
                    { "name": "冷鲜深海黄鱼 400克", "price": 15.54 },
                    { "name": "MARKETPLACE精选鲜鸡蛋 10枚", "price": 9.80 },
                    { "name": "MARKETPLACE有机鸡蛋 10枚装", "price": 19.90 },
                    { "name": "进口超甜蕉 700g", "price": 9.80 },
                    { "name": "超值 蒜头 500克", "price": 6.90 },
                    { "name": "超值 番茄 1千克", "price": 13.90 },
                    { "name": "白萝卜 1200克", "price": 7.75 },
                    { "name": "ALDI HOME 植萃洗洁精 1升", "price": 9.90 },
                    { "name": "螺丝椒 300克", "price": 8.59 },
                    { "name": "超值 黄瓜 1千克", "price": 6.90 },
                    { "name": "悠白4.0娟姗牛奶 950ml", "price": 15.90 },
                    { "name": "冷鲜猪棒骨（寸骨）550g", "price": 26.70 },
                    { "name": "谷悦仁家黑胡椒海盐研磨瓶 70克", "price": 16.80 },
                    { "name": "西双版纳花糯小玉米 800克", "price": 19.90 },
                    { "name": "中盐牌未加碘纯精岩盐 400克", "price": 3.90 },
                    { "name": "益达木糖醇无糖口香糖清爽薄荷味", "price": 12.50 },
                    { "name": "促销优惠", "price": -3.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "王守义 十三香 45g盒装*3", "price": 11.90 },
                    { "name": "紫林 醋 4.5度山西陈醋420ml", "price": 6.90 },
                    { "name": "优惠券", "price": -2.98 },
                    { "name": "联想（Lenovo）头戴式无线蓝牙耳机", "price": 77.45 },
                    { "name": "绿联（UGREEN）AUX音频线 2米", "price": 25.47 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-10-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "海底捞浓香牛油火锅底料 150g", "price": 14.22 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "十月稻田 多彩玉米 2.14kg", "price": 64.79 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "OLAY玉兰油玻尿酸沐浴露 润泽舒缓730ml*1件", "price": 39.8 },
                    { "name": "威露士倍护滋润抵御干燥抑菌洗手液 525ml 自然香型*1件", "price": 19.90 },
                    { "name": "超市立减", "price": -14.80 },
                    { "name": "红包", "price": -5.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "千禾酱油35%减盐简盐特级生抽500ml", "price": 7.12 }
                ]
            }
        ],
        "2024-10-07": [
            {
                "shop": "美团",
                "items": [
                    { "name": "香辣鸡腿堡送鸡排堡", "price": 10.00 },
                    { "name": "全鸡2选1送可乐", "price": 18.90 }
                ]
            }, {
                "shop": "天猫",
                "note": "绿林官方旗舰店",
                "items": [
                    { "name": "绿林扎带尼龙塑料拉紧器 3.6*200白色 100根", "price": 4.29 }
                ]
            }
        ],
        "2024-10-08": [
            {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g", "price": 13.90 },
                    { "name": "欣和葱伴侣6月香豆瓣酱 300g", "price": 8.50 },
                    { "name": "三红胡萝卜 约600g", "price": 3.38 },
                    { "name": "新黄心土豆 约600g", "price": 3.30 },
                    { "name": "双汇Q趣儿蘑菇风味香肠 70g", "price": 2.90 }
                ]
            }
        ],
        "2024-10-09": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "苏北风味锅烧老豆腐 400g", "price": 5.90 },
                    { "name": "超值 冷鲜鸡大胸 400g", "price": 5.95 },
                    { "name": "超值 上海青 500克", "price": 3.99 },
                    { "name": "薄切烧烤牛五花 450克", "price": 59.80 },
                    { "name": "超值 冷鲜猪肉丝 200g", "price": 6.60 },
                    { "name": "超值 冷鲜猪肉糜 300g", "price": 7.10 },
                    { "name": "南瓜 500克", "price": 3.89 },
                    { "name": "可生食鲜鸡蛋 10枚装", "price": 13.90 },
                    { "name": "经典台式烤肠 250克", "price": 17.90 },
                    { "name": "精选德式爆汁香肠 280g", "price": 21.90 },
                    { "name": "超值 去皮红洋葱 500克", "price": 2.99 },
                    { "name": "西葫芦 750克", "price": 10.60 },
                    { "name": "紫茄 500克", "price": 10.80 },
                    { "name": "悠白4.0娟姗牛奶 950ml", "price": 15.90 },
                    { "name": "超值 烟薯 1千克", "price": 5.99 },
                    { "name": "木棉豆腐 400g", "price": 4.90 },
                    { "name": "超值 土豆 500克", "price": 1.49 },
                    { "name": "超值 生菜 400克", "price": 3.90 },
                    { "name": "促销优惠", "price": -16.90 }
                ]
            }, {
                "shop": "ALDI",
                "items": [
                    { "name": "ALDI无纺布购物袋小号(限重5公斤)", "price": 1.00 }
                ]
            }
        ],
        "2024-10-13": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞香辣味火锅蘸料 120g", "price": 3.61 },
                    { "name": "王守义十三香 45g", "price": 3.61 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 25.80 },
                    { "name": "三红胡萝卜 约600g", "price": 3.13 },
                    { "name": "怡宝纯净水 6L*3", "price": 21.92 },
                    { "name": "辈儿香酱爆肉味八爪烧 46g", "price": 1.39 },
                    { "name": "蓝顿菠萝果味型啤酒 500ml", "price": 1.81 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "朴西 拖鞋男 深灰44-45", "price": 21.55 }
                ]
            }, {
                "shop": "PDD",
                "note": "谕锋家具官方旗舰店",
                "items": [
                    { "name": "床上书桌折叠 高级白+方形桌面", "price": 14.70 }
                ]
            }
        ],
        "2024-10-14": [
            {
                "shop": "小象",
                "items": [
                    { "name": "【湘味特色】螺丝椒约300g", "price": 7.99 },
                    { "name": "新黄心土豆约600g（大号）", "price": 3.30 }
                ]
            }, {
                "shop": "ALDI",
                "items": [
                    { "name": "紫茄 500克", "price": 10.80 },
                    { "name": "超值 上海青 500克", "price": 2.99 },
                    { "name": "超值 生菜 400克", "price": 3.90 },
                    { "name": "冷鲜三黄童子鸡整只 800g", "price": 29.00 },
                    { "name": "MARKETPLACE精选鲜鸡蛋 10枚", "price": 9.80 },
                    { "name": "可生食鲜鸡蛋 10枚装", "price": 13.90 },
                    { "name": "白萝卜 1200克", "price": 9.45 },
                    { "name": "超值 冷鲜猪肉糜 300g", "price": 7.10 },
                    { "name": "经典台式烤肠 250克", "price": 17.90 },
                    { "name": "潮汕牛肉丸 250g", "price": 19.90 },
                    { "name": "普罗旺斯番茄 500克", "price": 11.90 },
                    { "name": "苏北风味锅烧老豆腐 400g", "price": 5.90 },
                    { "name": "有机胡萝卜 400克", "price": 6.90 },
                    { "name": "超值 黄瓜 1千克", "price": 6.90 }
                ]
            }
        ],
        "2024-10-15": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞香辣味火锅蘸料 120g", "price": 3.90 },
                    { "name": "海底捞醇香牛油火锅底料 150g", "price": 6.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "ubras 云朵绒宽松女加绒睡衣", "price": 88.66 },
                    { "name": "森马（Semir）长袖T恤男 XL", "price": 32.23 },
                    { "name": "有棵树 女士袜子 中筒长袜", "price": 39.90 },
                    { "name": "有棵树 男士袜子 长袜", "price": 39.90 },
                    { "name": "优惠券", "price": -40.87 },
                    { "name": "朴西 棉拖鞋女 静谧蓝 44-45", "price": 39.80 },
                    { "name": "朴西 棉拖鞋女 浅水绿 38-39", "price": 39.80 },
                    { "name": "优惠券", "price": -41.06 },
                    { "name": "静韵 睡衣 蓝猫灰 男士圆领套装", "price": 48.17 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "妙洁2024新款空气绵厨房专用百洁布海绵", "price": 10.70 },
                    { "name": "英科一次性手套食品级 L标准黑丁腈手套 100只/盒", "price": 16.38 }
                ]
            }, {
                "shop": "猎豹",
                "note": "VPN",
                "items": [
                    { "name": "VIP会员包季", "price": 65.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "创勒官方旗舰店",
                "items": [
                    { "name": "厨房台面挡水条 白色 高1.2cm 宽2cm,100cm", "price": 6.10 }
                ]
            }
        ],
        "2024-10-16": [
            {
                "shop": "京东",
                "items": [
                    { "name": "Sodolike 尚岛 垃圾袋 150只装", "price": 5.05 },
                    { "name": "妙洁 铝箔锡纸 30cm*20米", "price": 9.57 },
                    { "name": "十月稻田 白糯玉米 260g*8根", "price": 35.42 }
                ]
            }
        ],
        "2024-10-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 7.50 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "海底捞香辣味火锅蘸料 120g", "price": 3.90 },
                    { "name": "劲仔小鱼混合装96g(内含12包)", "price": 10.80 },
                    { "name": "紫洋葱约750g", "price": 3.69 }
                ]
            }
        ],
        "2024-10-18": [
            {
                "shop": "小象",
                "items": [
                    { "name": "王致和混合花生芝麻酱 225g", "price": 8.75 },
                    { "name": "胭脂红蜜薯 约750g", "price": 5.30 },
                    { "name": "怡宝纯净水 6L*4", "price": 28.25 },
                    { "name": "锋味派黑胡椒味猪肉爆汁烤肠 200g", "price": 18.45 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "西王 葵花籽油 1.8L", "price": 26.84 }
                ]
            }
        ],
        "2024-10-19": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "超值 生菜 400克*2", "price": 5.98 },
                    { "name": "可生食鲜鸡蛋 10枚装*2", "price": 27.80 },
                    { "name": "青尖椒 300克", "price": 6.99 },
                    { "name": "超值 胡萝卜 800克", "price": 3.60 },
                    { "name": "超值 去皮红洋葱 500克", "price": 2.99 },
                    { "name": "香梨(单果120g+) 480克", "price": 9.90 },
                    { "name": "超值 冷鲜鸡琵琶腿 500g*2", "price": 14.86 },
                    { "name": "巴伐利亚风味烤鸡", "price": 29.90 },
                    { "name": "桃太郎粉番茄 600克", "price": 13.90 },
                    { "name": "冷鲜澳洲谷饲原切牛腱肉 500g", "price": 34.60 },
                    { "name": "缤纷海鲜盛宴水饺 480g", "price": 29.90 },
                    { "name": "超值 黄瓜 1千克", "price": 5.90 },
                    { "name": "海底捞醇香牛油火锅底料 150g", "price": 7.80 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "悠白4.0娟姗牛奶 950ml", "price": 15.90 },
                    { "name": "促销优惠", "price": -25.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-10-20": [
            {
                "shop": "京东",
                "items": [
                    { "name": "白象 金汤肥牛面134g*5袋", "price": 12.90 },
                    { "name": "五谷道場 非油炸 兰州牛肉115g*5", "price": 14.90 },
                    { "name": "优惠券", "price": -2.38 }
                ]
            }
        ],
        "2024-10-22": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞香辣味火锅蘸料 120g", "price": 3.73 },
                    { "name": "紫皮大蒜 约250g", "price": 4.30 },
                    { "name": "定西土豆 500g", "price": 5.31 },
                    { "name": "香菇 约200g", "price": 3.99 },
                    { "name": "精选老姜 约300g", "price": 7.97 },
                    { "name": "心相印吸油锁水抽取式厨房纸巾2层70抽*3包", "price": 8.69 },
                    { "name": "怡宝纯净水 6L*4", "price": 28.30 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-10-23": [
            {
                "shop": "京东",
                "items": [
                    { "name": "稳健一次性医用外科口罩50只", "price": 11.77 },
                    { "name": "十月稻田 水果玉米 1.76kg(220g*8根)", "price": 34.09 },
                ]
            }
        ],
        "2024-10-24": [
            {
                "shop": "小象",
                "items": [
                    { "name": "新黄心土豆约600g", "price": 3.30 },
                    { "name": "尖椒(羊角椒)约300g", "price": 6.20 },
                    { "name": "胭脂红蜜薯约750g", "price": 5.49 },
                    { "name": "草原红太阳鲜香美味火锅蘸料165g", "price": 6.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "紫林 醋 山西老陈醋6度 500ml", "price": 16.19 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 8.65 },
                ]
            }, {
                "shop": "ALDI",
                "items": [
                    { "name": "超值 生菜 400克*2", "price": 5.98 },
                    { "name": "可生食鲜鸡蛋 10枚装*2", "price": 27.80 },
                    { "name": "超值 黄瓜 1千克", "price": 4.99 },
                    { "name": "冷鲜澳洲谷饲原切牛嫩肉 500g", "price": 36.60 },
                    { "name": "超值 去皮红洋葱 500克", "price": 2.99 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "超值 蒜头 500克", "price": 6.90 },
                    { "name": "冷鲜鲁西黄牛牛霖 500克", "price": 29.90 },
                    { "name": "超值 番茄 1千克", "price": 13.90 },
                    { "name": "云南金秋砂糖桔 950g", "price": 29.90 },
                    { "name": "促销优惠", "price": -5.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "十月稻田 东北长粒香大米5kg*1", "price": 27.02 }
                ]
            }, {
                "shop": "烧烤",
                "note": "正宗新疆莎车羊肉串上海航昌路店",
                "items": [
                    { "name": "羊肉串*2正宗新疆莎车羊肉串二店", "price": 20.00 }
                ]
            }
        ],
        "2024-10-27": [
            {
                "shop": "小象",
                "items": [
                    { "name": "尖椒（羊角椒） 约300g", "price": 5.99 },
                    { "name": "三红胡萝卜约600g", "price": 3.00 },
                    { "name": "新黄心土豆约600g", "price": 2.93 },
                    { "name": "麻辣王子很麻很辣地道辣条110g", "price": 6.12 },
                    { "name": "进口香蕉约600g", "price": 6.54 },
                    { "name": "怡宝纯净水6L*4", "price": 28.32 },
                    { "name": "草原红太阳香辣味火锅蘸料165g", "price": 6.12 },
                    { "name": "海底捞薄盐香辣蘸料150g", "price": 4.87 },
                    { "name": "好人家香辣味火锅蘸料120g", "price": 4.30 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "白象 辣牛肉汤面 114g*5包", "price": 14.90 },
                    { "name": "白象 招牌猪骨汤面 110g*5包", "price": 14.90 },
                    { "name": "优惠券", "price": -4.18 }
                ]
            }
        ],
        "2024-10-28": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "超值 山东红富士 1千克", "price": 7.86 },
                    { "name": "超值 生菜 400克*2", "price": 5.98 },
                    { "name": "精制香百页（千张）300g", "price": 7.90 },
                    { "name": "进口超甜蕉 700g", "price": 9.80 },
                    { "name": "MARKETPLACE精选鲜鸡蛋 10枚", "price": 9.80 },
                    { "name": "可生食鲜鸡蛋 10枚装", "price": 13.90 },
                    { "name": "苏北风味锅烧老豆腐 400g", "price": 5.90 },
                    { "name": "超值 冷鲜鸡琵琶腿 500g*2", "price": 14.86 },
                    { "name": "超值 冷鲜鸡大胸 400g", "price": 5.95 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "梅林 午餐肉罐头 340克", "price": 15.90 },
                    { "name": "青尖椒 300克", "price": 5.99 },
                    { "name": "霜打菜 青萝卜 1kg", "price": 8.99 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/11/01-2024/11/30)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-10-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土豆（黄心）约1kg", "price": 5.19 },
                    { "name": "三红胡萝卜 约600g", "price": 3.39 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "味好美（McCormicK）番茄沙司挤挤装 330g", "price": 4.17 },
                    { "name": "维达（Vinda）4层200克*10卷", "price": 19.14 }
                ]
            }
        ],
        "2024-10-31": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞醇香牛油火锅底料 150g", "price": 6.40 },
                    { "name": "大娃娃菜（黄心）约500g", "price": 4.54 },
                    { "name": "三红胡萝卜约600g", "price": 3.14 },
                    { "name": "尖椒(羊角椒)约300g", "price": 5.75 },
                    { "name": "紫洋葱约750g", "price": 3.24 },
                    { "name": "怡宝纯净水 6L*4", "price": 29.62 },
                    { "name": "鲜切南瓜约500g", "price": 3.97 },
                    { "name": "草原红太阳鲜香美味火锅蘸料 165g", "price": 6.35 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-11-02": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "进口有机香蕉 650克", "price": 12.90 },
                    { "name": "野生鲅鱼水饺 480g(24只)", "price": 19.90 },
                    { "name": "潮汕牛肉丸 250g", "price": 19.90 },
                    { "name": "澳大利亚小蜜桔 800g", "price": 19.90 },
                    { "name": "青尖椒 300克", "price": 5.99 },
                    { "name": "超值 上海青 500克", "price": 1.99 },
                    { "name": "超值 生菜 400克", "price": 2.99 },
                    { "name": "悠白4.0娟姗牛奶 950ml", "price": 15.90 },
                    { "name": "超值 去皮红洋葱 500克", "price": 2.99 },
                    { "name": "可生食鲜鸡蛋 10枚装*2", "price": 27.80 },
                    { "name": "超值 烟薯 1千克", "price": 5.90 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "超值 高山白菜 500克", "price": 4.65 },
                    { "name": "超值 蒜头 500克", "price": 6.90 },
                    { "name": "普罗旺斯番茄 500克*2", "price": 24.98 },
                    { "name": "促销优惠", "price": -6.18 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "威猛先生（Mr Muscle） 洁厕宝 40g*5块 清香型", "price": 9.17 },
                    { "name": "五谷道場非油炸 番茄牛腩面 112gx4袋", "price": 11.26 },
                    { "name": "统一 豚骨味方便面 125g*5", "price": 16.34 }
                ]
            }, {
                "shop": "联通",
                "items": [
                    { "name": "中国联通APP交费 200.00元", "price": 195.54 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/10/01-2024/11/01)上海兴利开发有限公司", "price": 38.46 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/10/01-2024/11/01)上海兴利开发有限公司", "price": 102.26 }
                ]
            }
        ],
        "2024-11-03": [
            {
                "shop": "京东",
                "items": [
                    { "name": "温氏供港老母鸡1.2kg 500天", "price": 39.28 }
                ]
            }
        ],
        "2024-11-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "香葱 约50g", "price": 1.51 },
                    { "name": "香菜 约100g", "price": 3.50 },
                    { "name": "小米椒 约75g", "price": 2.08 },
                    { "name": "黄瓜 约600g", "price": 3.59 },
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 8.47 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 27.90 },
                    { "name": "蒙牛优益C原味乳酸菌饮品 100ml*5瓶", "price": 13.70 },
                    { "name": "白象走街串巷重庆风味酸辣粉 115g", "price": 6.90 },
                    { "name": "白象多半袋面2代红烧牛肉面 130*5袋", "price": 16.90 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "屈臣氏(杨浦百联店)", "price": 151.60 }
                ]
            }, {
                "shop": "美团",
                "items": [
                    { "name": "苏菲超薄随心翻夜用8片", "price": 8.22 },
                    { "name": "苏菲裸感S贵族日用卫生巾", "price": 5.21 },
                    { "name": "凡士林维他亮肤亮采修护润", "price": 8.85 },
                    { "name": "芙丽芳丝净润洗面霜*2", "price": 127.82 },
                    { "name": "打包费", "price": 1.50 }
                ]
            }
        ],
        "2024-11-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 8.39 },
                    { "name": "三红胡萝卜 约600g", "price": 3.19 },
                    { "name": "土豆（黄心）约1kg", "price": 4.90 }
                ]
            }
        ],
        "2024-11-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 0.00 },
                    { "name": "21°蜜红薯 750g/份", "price": 14.47 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 21.56 },
                    { "name": "土豆（黄心）约600g", "price": 3.02 }
                ]
            }
        ],
        "2024-11-07": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土豆（黄心）约600g", "price": 0.00 },
                    { "name": "黑钻世家黑猪火腿午餐肉 198g/罐", "price": 16.90 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 23.80 }
                ]
            }, {
                "shop": "ALDI",
                "items": [
                    { "name": "超值 白菜猪肉水饺 1kg", "price": 18.90 },
                    { "name": "霜打菜 超值 高山白菜 500克", "price": 4.65 },
                    { "name": "Aldi Delight 多彩鱼皮裹衣花生 268g", "price": 12.90 },
                    { "name": "Aldi Delight 虎皮核桃仁 168g", "price": 14.90 },
                    { "name": "超值 经典原味午餐肉罐头 340克", "price": 9.90 },
                    { "name": "超值 冷鲜猪肉糜 500g", "price": 7.10 },
                    { "name": "Aldi Delight 每日坚果七袋装 30g*7", "price": 26.90 },
                    { "name": "梨汁黄桃罐头(4杯) 113克*4", "price": 13.90 },
                    { "name": "超值 山东红富士 1千克", "price": 8.60 },
                    { "name": "超值 鱿鱼丝 65g", "price": 8.90 },
                    { "name": "可生食鲜鸡蛋 10枚装*2", "price": 27.80 },
                    { "name": "青尖椒 300克*2·", "price": 11.98 },
                    { "name": "进口超甜蕉 700g", "price": 9.80 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "促销优惠", "price": -0.80 }
                ]
            }
        ],
        "2024-11-09": [
            {
                "shop": "京东",
                "items": [
                    { "name": "超能 离子去油洗洁精1kg", "price": 1.12 },
                    { "name": "维达（Vinda）厨房抽纸 80抽*12包", "price": 30.16 }
                ]
            }
        ],
        "2024-11-11": [
            {
                "shop": "小象",
                "items": [
                    { "name": "欣和葱伴侣6月香豆瓣酱 300g", "price": 5.24 },
                    { "name": "草原红太阳香辣味火锅蘸料 165g (55g*3袋)", "price": 2.76 }
                ]
            }
        ],
        "2024-11-12": [
            {
                "shop": "京东",
                "items": [
                    { "name": "柴火大院京东自营 五常大米 5kg", "price": 49.43 }
                ]
            }
        ],
        "2024-11-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 27.28 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 7.66 },
                    { "name": "百味来Barilla #1 意大利进口 500g", "price": 18.87 }
                ]
            }, {
                "shop": "中蔬",
                "note": "中蔬时代(周浦万达店)",
                "items": [
                    { "name": "螺丝椒", "price": 2.09 },
                    { "name": "中粮亚麻籽精肋排", "price": 33.11 },
                    { "name": "沪尚味香肠", "price": 32.80 },
                    { "name": "白萝卜", "price": 0.40 },
                    { "name": "泥萝卜", "price": 3.64 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-11-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.53 },
                    { "name": "红洋葱 约750g", "price": 2.95 },
                    { "name": "进口香蕉 约650g", "price": 11.56 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "老管家 管道除臭剂1L", "price": 9.83 }
                ]
            }
        ],
        "2024-11-17": [
            {
                "shop": "小象",
                "items": [
                    { "name": "海底捞醇香牛油火锅底料150g", "price": 7.28 },
                    { "name": "青甘蓝 约800g", "price": 4.66 },
                    { "name": "娃哈哈饮用纯净水 5.5L*4", "price": 29.45 },
                    { "name": "白象多半袋面2代红烧牛肉面130*5袋", "price": 16.90 },
                    { "name": "安食六和经典原味兰州牛肉面121.5g", "price": 9.90 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "中蔬",
                "note": "中蔬时代(周浦万达店)",
                "items": [
                    { "name": "思念（大虾仁）三鲜虾仁水饺", "price": 9.90 },
                    { "name": "烧鸡", "price": 19.80 },
                    { "name": "香辣银鱼", "price": 3.66 },
                    { "name": "八角", "price": 15.00 },
                    { "name": "内蒙热气牛腩", "price": 58.42 },
                    { "name": "白萝卜", "price": 0.58 }
                ]
            }
        ],
        "2024-11-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "云蕾一次性保鲜罩 25只", "price": 0.00 },
                    { "name": "进口香蕉 约650g", "price": 7.46 },
                    { "name": "卫龙魔芋爽(香辣味) 50g/袋", "price": 3.63 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 16.62 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (2桶)", "price": 14.77 }
                ]
            }
        ],
        "2024-11-20": [
            {
                "shop": "小象",
                "items": [
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 27.90 },
                    { "name": "农夫山泉饮用天然水 5L*2", "price": 15.80 },
                    { "name": "怡宝纯净水 6L*2", "price": 17.60 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "泡泡玛特旗舰店",
                "items": [
                    { "name": "POPMART泡泡玛特 手机挂绳", "price": 24.00 }
                ]
            }
        ],
        "2024-11-22": [
            {
                "shop": "小象",
                "items": [
                    { "name": "劲仔小鱼混合装 96g(内含12包)", "price": 9.90 },
                    { "name": "尖椒(羊角椒)约300g", "price": 6.28 },
                    { "name": "光明上海农场散养土鸡蛋10枚400g", "price": 13.90 },
                    { "name": "九华山林间散养土鸡蛋10枚400g", "price": 13.80 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }
        ],
        "2024-11-24": [
            {
                "shop": "美团",
                "items": [
                    { "name": "[百多邦]莫匹罗星软膏10g/支/盒", "price": 24.5 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-11-25": [
            {
                "shop": "宜家",
                "items": [
                    { "name": "瑞典风味圣诞自助餐*2 周六 12月28日 16:30-19:00", "price": 196.00 }
                ]
            }
        ],
        "2024-11-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "康师傅红烧牛肉面 113g/桶", "price": 4.94 },
                    { "name": "认养一头牛有机纯牛奶 200mL*16盒/箱", "price": 36.61 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 11.65 },
                    { "name": "云蕾竹棒棉签 100支装", "price": 0.00 },
                    { "name": "黑钻世家川藏特色黑猪肉糜(3:7) 约350g", "price": 10.93 },
                    { "name": "黑钻世家冷鲜川藏特色黑猪肉丝 约350g", "price": 10.26 },
                    { "name": "无抗黑猪冷鲜汤骨 300g", "price": 10.32 },
                    { "name": "有机黑猪冷鲜通脊 200g", "price": 14.89 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 6.89 },
                    { "name": "新黄心土豆约 600g", "price": 2.69 },
                    { "name": "统一茄皇牛肉面128g", "price": 4.90 },
                    { "name": "白象经典老坛酸菜牛肉面119g", "price": 3.90 }
                ]
            }
        ],
        "2024-11-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 25.90 }
                ]

            }, {
                "shop": "小象",
                "items": [
                    { "name": "怡宝纯净水 6L（1桶）", "price": 5.90 },
                    { "name": "康师傅番茄鸡蛋牛肉面 115g*5袋", "price": 14.90 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "紫林 山西老陈醋6度 500ml", "price": 15.97 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 5.17 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2024/12/01-2024/12/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-11-28": [
            {
                "shop": "ALDI",
                "items": [
                    { "name": "超值卫生湿巾 80片", "price": 6.90 },
                    { "name": "经典提拉米苏蛋糕 300克", "price": 39.90 },
                    { "name": "海底捞菌汤火锅汤料 110g", "price": 11.80 },
                    { "name": "桥头重庆老火锅底料 90克*4块", "price": 18.80 },
                    { "name": "超值 松花菜 500克", "price": 2.99 },
                    { "name": "蟹味棒 132g", "price": 9.90 },
                    { "name": "超值 生菜 400克", "price": 1.99 },
                    { "name": "莲藕 500克", "price": 7.99 },
                    { "name": "鱼籽福袋 180g", "price": 19.90 },
                    { "name": "精制香百页（千张） 300g", "price": 7.90 },
                    { "name": "潮汕牛肉丸 250g", "price": 19.90 },
                    { "name": "悠白裸酸奶 340克", "price": 8.90 },
                    { "name": "可生食鲜鸡蛋 10枚装*2", "price": 27.80 },
                    { "name": "太太乐鸡精调味料 227克", "price": 12.90 },
                    { "name": "超值 胡萝卜 800克", "price": 3.60 },
                    { "name": "超值 冷鲜带皮猪五花肉 400g", "price": 14.30 },
                    { "name": "0添加红油郫县豆瓣 500克", "price": 11.90 },
                    { "name": "超值 去皮红洋葱 500克", "price": 3.90 },
                    { "name": "中盐牌未加碘纯精岩盐 400克", "price": 3.80 },
                    { "name": "超值 蒜头 500克", "price": 6.90 },
                    { "name": "促销优惠", "price": -2.30 }
                ]
            }, {
                "shop": "ALDI",
                "items": [
                    { "name": "ALDI无纺布购物袋小号(限重5公斤)", "price": 1.00 }
                ]
            }
        ],
        "2024-11-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 6.89 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "十月稻田 五常大米5kg*1", "price": 46.52 }
                ]
            }
        ],
        "2024-11-30": [
            {
                "shop": "京东",
                "items": [
                    { "name": "洁柔有芯卷纸 4层200克*10卷", "price": 22.26 },
                    { "name": "心相印抽纸 3层110抽*6包S码", "price": 9.82 },
                    { "name": "舒客钻光粹白牙膏 120克净白薄荷香型", "price": 9.82 },
                    { "name": "优惠券", "price": -1.94 },
                    { "name": "多力 黄金3益葵花籽油1.8L 含维生素a", "price": 27.65 }
                ]
            }, {
                "shop": "淘宝",
                "items": [
                    { "name": "realme 真我 GT Neo5【灰色】手机壳", "price": 2.90 },
                    { "name": "realme 真我 GT Neo5【直边液态:经典黑】手机壳", "price": 3.72 }
                ]
            }
        ],
        "2024-12-01": [
            {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "莲藕 500g", "price": 4.83 },
                    { "name": "进口365日熟甜蕉 1kg", "price": 9.59 },
                    { "name": "番茄 1kg", "price": 7.65 },
                    { "name": "必品阁 王饺子(菌菇三鲜) 350g", "price": 8.62 }
                ]
            }
        ],
        "2024-12-02": [
            {
                "shop": "去哪",
                "note": "去哪儿网(北京嘉信浩远信息技术有限公司)",
                "items": [
                    { "name": "上海→成都 2024-12-05 09:15-12:50 国航CA4592", "price": 393.00 }
                ]
            }, {
                "shop": "去哪",
                "note": "去哪儿网(北京嘉信浩远信息技术有限公司)",
                "items": [
                    { "name": "上海→成都 2024-12-05 09:15-12:50 国航CA4592", "price": 331.00 }
                ]
            }, {
                "shop": "支",
                "note": "太平保险经纪有限公司",
                "items": [
                    { "name": "保险产品", "price": 39.00 }
                ]
            }, {
                "shop": "携程",
                "note": "支付宝-携程旅行网",
                "items": [
                    { "name": "12月7日 成都→上海 南航CZ8198 天府机场T2→浦东机场T2", "price": 419.00 }
                ]
            }, {
                "shop": "携程",
                "note": "支付宝-携程旅行网",
                "items": [
                    { "name": "12月7日 成都→上海 南航CZ8198 天府机场T2→浦东机场T2", "price": 409.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/11/01-2024/12/01)上海兴利开发有限公司", "price": 45.01 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓电费(2024/11/01-2024/12/01)上海兴利开发有限公司", "price": 145.01 }
                ]
            }
        ],
        "2024-12-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "百岁山矿泉水 570ml*6(散装)", "price": 12.06 },
                    { "name": "怡宝纯净水 6L（3桶）", "price": 24.95 },
                    { "name": "新疆库尔勒香梨约 500g", "price": 10.19 },
                    { "name": "新疆库尔勒香梨约 500g（赠品）", "price": 0.00 },
                    { "name": "慢养黑猪冷鲜汤骨(汤小排)350g", "price": 27.75 },
                    { "name": "慢养黑猪冷鲜前排块350g(脊骨+肋排)", "price": 18.50 },
                    { "name": "豆小月响铃卷100g(新老包装随机发货)", "price": 12.99 },
                    { "name": "豆小月响铃卷100g(新老包装随机发货)（赠品）", "price": 0.00 },
                    { "name": "三全撒尿牛肉丸120g（6个）", "price": 7.36 },
                    { "name": "三全撒尿牛肉丸120g（6个）（赠品）", "price": 0.00 }
                ]
            }, {
                "shop": "微信",
                "note": "成都大熊猫繁育研究基地",
                "items": [
                    { "name": "熊猫基地-成人票(上午票)*2", "price": 110.00 }
                ]
            }, {
                "shop": "微信",
                "note": "成都武侯祠",
                "items": [
                    { "name": "武侯祠-文物区全价票*2", "price": 100.00 }
                ]
            }
        ],
        "2024-12-04": [
            {
                "shop": "携程",
                "items": [
                    { "name": "杜甫草堂门票成人票-上午场x2份", "price": 100.00 }
                ]
            }
        ],
        "2024-12-05": [
            {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(牛王庙2024-12-05 20:24:41-市二医院2024-12-05 20:41:10)", "price": 2.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(市二医院2024-12-05 19:29:57新南门2024-12-05 19:41:06)", "price": 2.00 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 10分49秒 18:33:21", "price": 2.50 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 9分50秒 17:10:00", "price": 1.50 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(天府广场2024-12-05 15:41:20-春熙路2024-12-05 15:48:03)", "price": 2.00 }
                ]
            }, {
                "shop": "去哪",
                "note": "西姆清居成都春熙路太古里酒店",
                "items": [
                    { "name": "12月5日 周四 1晚 翰雅大床房", "price": 186.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }
        ],
        "2024-12-06": [
            {
                "shop": "微信",
                "items": [
                    { "name": "接驳车票*2 地铁军区总医院站→熊猫基地(西门)", "price": 4.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(通惠门2024-12-06 21:41:42-中医大省医院2024-12-06 21:49:02)", "price": 2.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(中医大省医院2024-12-06 19:24:36--通惠门2024-12-06 19:28:51)", "price": 2.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(人民公园2024-12-06 18:08:22-中医大省医院2024-12-06 18:14:48)", "price": 2.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(高升桥2024-12-06 16:31:56-人民公园2024-12-06 16:53:42)", "price": 3.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(文殊院2024-12-06 13:29:09-高升桥2024-12-06 13:52:32)", "price": 3.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(熊猫大道2024-12-06 12:19:57文殊院2024-12-0613:02:53)", "price": 4.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(市二医院2024-12-06 07:57:00-军区总医院2024-12-06 08:18:34)", "price": 4.00 }
                ]
            }, {
                "shop": "去哪",
                "note": "西姆怡特成都宽窄巷子省医院酒店",
                "items": [
                    { "name": "12月5日 周五1晚 阳光榻榻米大床房", "price": 161.00 }
                ]
            }, {
                "shop": "携程",
                "note": "蜀风雅韵川剧院",
                "items": [
                    { "name": "《川剧变脸》演出-成人票-20:00场-甲票x2份", "price": 294.00 }
                ]
            }, {
                "shop": "微信",
                "note": "成都大熊猫繁育研究基地",
                "items": [
                    { "name": "观光车票*2", "price": 60.00 }
                ]
            }
        ],
        "2024-12-07": [
            {
                "shop": "美团",
                "items": [
                    { "name": "单车 15:50 时长:18分1秒", "price": 2.5 },
                    { "name": "单车 13:24 时长:11分27秒", "price": 1.5 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(东郊记忆2024-12-07 16:29:04-1号2号航站楼天府机场2024-12-07 17:50:13)", "price": 11.00 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 6分41秒 16:26:42", "price": 1.80 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 17分41秒 16:08:53", "price": 2.80 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(人民公园2024-12-07 14:40:28-建设北路2024-12-07 15:06:21)", "price": 3.00 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(中医大省医院2024-12-07 13:38:57--人民公园2024-12-07 13:47:59)", "price": 2.00 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 11分34秒 13:35:49", "price": 2.80 }
                ]
            }, {
                "shop": "哈啰",
                "note": "上海哈啰普惠科技有限公司",
                "items": [
                    { "name": "共享单车 骑行时长: 5分16秒 11:58:37", "price": 1.80 }
                ]
            }, {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(中医大省医院2024-12-07 09:33:13--青羊宫2024-12-07 09:38:36)", "price": 2.00 }
                ]
            }
        ],
        "2024-12-08": [
            {
                "shop": "小象",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 4.19 },
                    { "name": "新黄心土豆约 600g", "price": 5.20 },
                    { "name": "怡宝纯净水 6L", "price": 8.90 },
                    { "name": "康沙海南蜜薯 500g", "price": 11.99 },
                    { "name": "统一兰州牛肉面 98g*4", "price": 29.90 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "贝贝南瓜 1kg", "price": 6.9 },
                    { "name": "老干妈 风味鸡油辣椒 280g", "price": 11.9 },
                    { "name": "普罗旺斯番茄 1kg", "price": 12.9 },
                    { "name": "泰森 冷鲜鸡大胸 500g", "price": 11.9 },
                    { "name": "冰鲜 鸡大胸 800g", "price": 11.9 },
                    { "name": "盒马NB 可生食鸡蛋 10枚", "price": 12.9 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "桐木 实木板 2cm厚 定制专拍 15cm*25cm", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-浦东1号2号航站楼-2024-12-08 05:51:26-鹤涛路-2024-12-08 07:19:22", "price": 7.00 }
                ]
            }
        ],
        "2024-12-09": [
            {
                "shop": "PDD",
                "note": "联合利华官方旗舰店",
                "items": [
                    { "name": "多芬沐浴露 深层滋养650g*1", "price": 15.04 }
                ]
            }, {
                "shop": "PDD",
                "note": "益迷个护生活馆",
                "items": [
                    { "name": "舒客-宽洁牙刷8支装", "price": 12.87 }
                ]
            }
        ],
        "2024-12-10": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土豆（黄心）约1kg", "price": 4.10 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 8.99 },
                    { "name": "进口香蕉 约650g", "price": 6.84 },
                    { "name": "怡宝纯净水 6L/桶", "price": 7.68 },
                    { "name": "螺丝椒 约300g", "price": 7.17 },
                    { "name": "泰森冷冻鸡琵琶腿 500g", "price": 10.10 },
                    { "name": "泰森冷冻鸡爪 500g", "price": 22.18 },
                    { "name": "湘佳鸡小腿 430g", "price": 20.13 },
                    { "name": "娃哈哈纯净水 5.5L/桶", "price": 6.76 },
                    { "name": "娃哈哈纯净水 5.5L*4桶/组", "price": 25.61 }
                ]
            }
        ],
        "2024-12-11": [
            {
                "shop": "支",
                "note": "成都天府通数字科技有限公司",
                "items": [
                    { "name": "成都地铁(1号2号航站楼天府机场2024-12-0513:38:26--天府广场2024-12-05 14:08:26)", "price": 11.00 }
                ]
            }
        ],
        "2024-12-12": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "哈尔滨风味红肠 50g", "price": 0.00 },
                    { "name": "有机黑鸡土鸡蛋15枚675g", "price": 14.77 },
                    { "name": "茄子（精选）约800g", "price": 6.54 },
                    { "name": "螺丝椒 约300g", "price": 3.34 },
                    { "name": "怡宝纯净水 6L", "price": 7.13 }
                ]
            }
        ],
        "2024-12-13": [
            {
                "shop": "小象",
                "items": [
                    { "name": "天目山小香薯 500g", "price": 11.44 },
                    { "name": "天目山小香薯 500g（赠品）", "price": 0.00 },
                    { "name": "有机胡萝卜 300g", "price": 4.15 },
                    { "name": "怡宝纯净水 6L*1", "price": 7.89 },
                    { "name": "康师傅番茄鸡蛋牛肉面 115g*5袋", "price": 14.90 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-12-14": [
            {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "霜打长白萝卜 1.5kg", "price": 3.99 },
                    { "name": "紫皮大蒜 500g", "price": 7.9 },
                    { "name": "新疆阿克苏苹果 1.5kg", "price": 14.9 },
                    { "name": "新土豆 1kg", "price": 2.99 },
                    { "name": "味全 活性乳酸菌饮品 950ml", "price": 10.9 },
                    { "name": "谷物红心鲜鸡蛋 30枚", "price": 23.9 },
                    { "name": "双拼瑞士卷", "price": 19.9 },
                    { "name": "冰鲜 琵琶腿 800g", "price": 23.8 },
                    { "name": "冰鲜猪肋排 1.2kg", "price": 64.9 }
                ]
            }
        ],
        "2024-12-15": [
            {
                "shop": "京东",
                "items": [
                    { "name": "河套 瑞雪粉5斤", "price": 15.02 },
                    { "name": "李锦记 0添加原酿生抽500ml", "price": 8.29 }
                ]
            }
        ],
        "2024-12-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 4.19 }
                ]
            }
        ],
        "2024-12-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L*1", "price": 7.90 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "泰森鲜鸡大胸 500g", "price": 12.60 },
                    { "name": "鲜切南瓜 约500g", "price": 3.99 }
                ]
            }
        ],
        "2024-12-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水5.5L*2", "price": 11.80 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "油炸花生 500g", "price": 14.90 },
                    { "name": "粉藕 550g", "price": 4.99 },
                    { "name": "鲜鸡蛋 12枚/盒", "price": 9.90 },
                    { "name": "胡萝卜 1kg", "price": 4.50 },
                    { "name": "可口可乐 汽水 500ml", "price": 2.30 },
                    { "name": "泰森 冷鲜 鸡翅中 400g/盒", "price": 21.90 },
                    { "name": "霜打长白萝卜 1.5kg", "price": 3.99 }
                ]
            }
        ],
        "2024-12-19": [
            {
                "shop": "小象",
                "items": [
                    { "name": "新黄心土豆 约600g(大号)", "price": 2.60 },
                    { "name": "大葱 约550g", "price": 4.65 },
                    { "name": "西葫芦 约850g", "price": 5.40 },
                    { "name": "象大厨小油豆腐 130g", "price": 3.90 }
                ]
            }
        ],
        "2024-12-20": [
            {
                "shop": "小象",
                "items": [
                    { "name": "本地鸡毛菜 约250g", "price": 1.52 },
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 19.95 },
                    { "name": "怡宝纯净水 6L*3", "price": 21.48 },
                    { "name": "娃哈哈饮用纯净水 5.5L*1", "price": 6.33 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "雨润 旺润香火腿 220g*2", "price": 15.50 }
                ]
            }
        ],
        "2024-12-22": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土鸡蛋10枚 400g", "price": 9.5 },
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "生菜 400g", "price": 1.99 },
                    { "name": "新土豆 1kg", "price": 2.99 },
                    { "name": "冰鲜 鸡爪 500g", "price": 21.90 },
                    { "name": "山东红富士 1.5kg", "price": 12.90 },
                    { "name": "冰鲜 猪肋排 1.2kg", "price": 59.90 },
                    { "name": "进口365日熟甜蕉 1kg", "price": 9.90 },
                    { "name": "紫长茄 500g", "price": 4.99 },
                    { "name": "无抗大码鲜鸡蛋 20枚 1.2kg", "price": 17.90 },
                    { "name": "支付优惠", "price": -0.12 }
                ]
            }
        ],
        "2024-12-24": [
            {
                "shop": "小象",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 2.86 },
                    { "name": "新黄心土豆约600g(大号)", "price": 1.78 },
                    { "name": "怡宝纯净水6L*1", "price": 6.05 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【经典红肠】山林大红大块肉红肠", "price": 10.90 }
                ]
            }
        ],
        "2024-12-25": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "饮用天然水5.2L*1", "price": 5.50 },
                    { "name": "娃哈哈纯净水5.5L/桶*1", "price": 6.30 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【经典红肠】山林大红大块肉红肠", "price": 10.90 },
                    { "name": "【有机】大白菜1.2kg", "price": 10.90 }
                ]
            }
        ],
        "2024-12-26": [
            {
                "shop": "盒马",
                "note": "盒马NB(航头浦乐汇店)",
                "items": [
                    { "name": "冰鲜 黑猪去皮五花肉 350g/盒", "price": 25.90 },
                    { "name": "蒜苗 500g", "price": 5.90 },
                    { "name": "新土豆 1kg", "price": 1.99 },
                    { "name": "粉藕 550g", "price": 4.99 }
                ]
            }
        ],
        "2024-12-27": [
            {
                "shop": "小象",
                "items": [
                    { "name": "卫龙大面筋106g*3", "price": 10.01 },
                    { "name": "娃哈哈饮用纯净水5.5L*1", "price": 6.69 }
                ]
            }
        ],
        "2024-12-28": [
            {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2025/01/01-2025/01/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }
        ],
        "2024-12-29": [
            {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "桥头 老火锅底料 360g", "price": 16.50 },
                    { "name": "霜打长白萝卜 1.5kg", "price": 3.99 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 16.80 },
                    { "name": "冰鲜 猪小里脊 1kg", "price": 34.90 },
                    { "name": "冰鲜 老母鸡 1kg", "price": 29.90 },
                    { "name": "新土豆 1kg", "price": 1.99 },
                    { "name": "山东红富士 1.5kg装(单果190g+)", "price": 8.33 },
                    { "name": "支付优惠", "price": -0.21 }
                ]
            }, {
                "shop": "京东",
                "note": "妙洁家居京东自营旗舰店",
                "items": [
                    { "name": "妙洁 免刀撕保鲜膜*1", "price": 12.80 }
                ]
            }, {
                "shop": "京东",
                "note": "辉英喜达方便食品京东自营旗舰店",
                "items": [
                    { "name": "辉英喜达印尼拌面 劲辣风味5包", "price": 3.76 }
                ]
            }, {
                "shop": "京东",
                "note": "英科医疗(INTCO)手套京东自营旗舰店",
                "items": [
                    { "name": "英科医疗 一次性手套", "price": 11.97 }
                ]
            }
        ],
        "2024-12-30": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "哇哈哈纯净水 5.5L/桶*2", "price": 15.44 },
                    { "name": "怡宝纯净水 6L/桶*3", "price": 24.26 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "锋味派原味黑猪肉爆汁烤肠210g(35g*6)", "price": 16.90 }
                ]
            }
        ],
        "2024-12-31": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "王守义包子饺子调料40g/袋", "price": 2.76 },
                    { "name": "有机大白菜 1.2kg/份", "price": 7.04 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "NB 大红袍花椒 50g", "price": 8.90 },
                    { "name": "冰鲜 肥瘦猪肉馅(肥瘦比约2:8) 500g/盒.", "price": 10.90 },
                    { "name": "冰鲜 带皮大五花肉 1.5kg", "price": 44.90 }
                ]
            }
        ],
        "2025-01-01": [
            {
                "shop": "京东",
                "note": "水塔京东自营旗舰店",
                "items": [
                    { "name": "水塔老陈醋 【3陈酿】6度酸 420ml", "price": 2.85 }
                ]
            }, {
                "shop": "京东",
                "note": "立白京东自营旗舰店",
                "items": [
                    { "name": "立白大师 香水洗护 洗衣粉", "price": 11.80 }
                ]
            }, {
                "shop": "京东",
                "note": "李锦记京东自营旗舰店",
                "items": [
                    { "name": "李锦记 0添加原酿生抽1.21kg", "price": 10.55 }
                ]
            }
        ],
        "2025-01-02": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/12/01-2025/01/01)上海兴利开发有限公司", "price": 37.58 },
                    { "name": "公寓电费(2024/12/01-2025/01/01)上海兴利开发有限公司", "price": 174.14 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.80 },
                    { "name": "【有机】土豆 500g", "price": 7.39 },
                    { "name": "【供港】黄瓜500g", "price": 7.99 }
                ]
            }
        ],
        "2025-01-03": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L/桶*1", "price": 7.14 },
                    { "name": "湘味软皮椒 200g/份", "price": 5.95 },
                    { "name": "进口有机香蕉 650g", "price": 12.56 },
                    { "name": "有机茄子(长茄)300g", "price": 12.24 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }, {
                "shop": "PDD",
                "note": "维达官方旗舰店",
                "items": [
                    { "name": "维达厨房专用卷纸75节8卷箱装【可水洗共600节】", "price": 20.80 }
                ]
            }, {
                "shop": "PDD",
                "note": "蓝棉花家居生活专卖店",
                "items": [
                    { "name": "蓝棉花医护级卫生巾pH值A类6.0弱酸性益生菌姨妈巾【徐璐同款)", "price": 20.85 }
                ]
            }
        ],
        "2025-01-04": [
            {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "山东红富士 1.5kg装", "price": 12.90 },
                    { "name": "新土豆 1kg", "price": 3.50 },
                    { "name": "紫皮大蒜 500g", "price": 7.90 },
                    { "name": "霜打长白萝卜 1.5kg", "price": 3.99 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 17.90 },
                    { "name": "冰鲜鸡翅中 500g", "price": 21.60 },
                    { "name": "冰鲜猪大排 800g", "price": 24.90 },
                    { "name": "可爱多棒棒 流心脆 雪糕", "price": 9.90 },
                    { "name": "双汇台式烤香肠 38g*5", "price": 8.40 },
                    { "name": "老干妈风味鸡油辣椒 280g", "price": 11.90 },
                    { "name": "康师傅1倍半红烧牛肉面 129g*5", "price": 9.90 },
                    { "name": "统一老坛酸菜牛肉面 121g*5", "price": 10.90 },
                ]
            }
        ],
        "2025-01-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L", "price": 7.90 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "2024年新米柴火大院五常大米5k", "price": 57.24 }
                ]
            }
        ],
        "2025-01-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 26.90 }
                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }
        ],
        "2025-01-07": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】土豆 500g", "price": 6.99 },
                    { "name": "【有机】大白菜 1.2kg", "price": 8.90 }
                ]
            }, {
                "shop": "美团",
                "note": "国大药房(慧鑫店)",
                "items": [
                    { "name": "[芬必得]布洛芬缓释胶囊0.4g*24粒/盒", "price": 19.20 },
                    { "name": "[洁葆诺]棉签100支/袋", "price": 1.20 },
                    { "name": "配送费", "price": 6.00 },
                    { "name": "打包费", "price": 0.50 },
                    { "name": "医保个账支付", "price": -17.28 }
                ]
            }
        ],
        "2025-01-08": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "note": "小象超市-鹤波路站",
                "items": [
                    { "name": "五得利八星雪花小麦粉 5kg", "price": 27.90 },
                    { "name": "【经典红肠】山林大红大块肉红肠260g", "price": 10.90 }
                ]
            }
        ],
        "2025-01-09": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "普罗旺斯番茄 1kg", "price": 9.90 },
                    { "name": "北海牧场 经典原味风味发酵乳 100g*3/组", "price": 7.90 },
                    { "name": "冰鲜 鸡全腿 700g", "price": 14.90 },
                    { "name": "冰鲜 猪小里脊 1kg", "price": 34.90 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 15.80 },
                    { "name": "康师傅 1倍半红烧牛肉面 129g*5", "price": 9.90 }

                ]
            }
        ],
        "2025-01-10": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "京东",
                "note": "北纯京东自营旗舰店",
                "items": [
                    { "name": "北纯 有机玉米粉 1.5kg", "price": 8.77 }
                ]
            }, {
                "shop": "京东",
                "note": "西王京东自营旗舰店",
                "items": [
                    { "name": "西王 葵花籽油1.8L", "price": 25.94 }
                ]
            }
        ],
        "2025-01-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "湘味软皮椒 200g/份", "price": 4.95 },
                    { "name": "有机茄子(长茄)300g", "price": 11.14 }
                ]
            }, {
                "shop": "小象",
                "note": "小象超市-鹤波路站",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.08 },
                    { "name": "【有机】土豆 500g", "price": 5.04 },
                    { "name": "娃哈哈饮用纯净水5.5L*1", "price": 6.62 }
                ]
            }
        ],
        "2025-01-12": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "哇哈哈纯净水 5.5L/桶*4", "price": 25.90 }
                ]
            }
        ],
        "2025-01-13": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "山东红富士 1.5kg装", "price": 12.90 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 17.90 },
                    { "name": "康师傅 1倍半红烧牛肉面 129g*5", "price": 9.90 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】土豆 500g", "price": 5.99 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "精品西红柿 0.44kg", "price": 4.42 }
                ]
            }, {
                "shop": "京东",
                "note": "联合利华京东自营旗舰店",
                "items": [
                    { "name": "力士(LUX)香氛抑菌洗手液", "price": 8.07 }
                ]
            }, {
                "shop": "京东",
                "note": "洁柔京东自营官方旗舰店",
                "items": [
                    { "name": "洁柔有芯卷纸 黑Face加厚4层200克*10卷", "price": 25.08 }
                ]
            }
        ],
        "2025-01-14": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机土豆 500g/份", "price": 7.13 },
                    { "name": "有机茄子(长茄)300g", "price": 13.26 }
                ]
            }
        ],
        "2025-01-15": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "精品西红柿 0.54kg", "price": 5.55 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】大白菜1.2kg", "price": 12.90 }
                ]
            }
        ],
        "2025-01-16": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "精品西红柿 0.49kg", "price": 4.92 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机胡萝卜 400g/份", "price": 3.59 }
                ]
            }
        ],
        "2025-01-17": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "冰鲜 鸡爪500g", "price": 21.90 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 17.90 },
                    { "name": "欣和 葱伴侣6月香豆瓣酱", "price": 8.90 }
                ]
            }
        ],
        "2025-01-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "王守义十三香 45g/盒", "price": 3.61 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 27.74 },
                    { "name": "娃哈哈纯净水 5.5L*1桶", "price": 7.35 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "王守义十三香 45g/盒", "price": 3.13 },
                    { "name": "有机胡萝卜 400g/份", "price": 4.65 },
                    { "name": "有机土豆 500g/份*2", "price": 10.69 },
                    { "name": "有机茄子(长茄)300g", "price": 9.83 },
                    { "name": "安琪干酵母 12g/袋*3", "price": 4.62 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "梦龙 松露巧克力口味冰淇淋", "price": 9.00 }
                ]
            }
        ],
        "2025-01-19": [
            {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "冷鲜猪前腿肉 500g", "price": 13.90 },
                    { "name": "新疆阿克苏苹果 1.5kg", "price": 16.90 },
                    { "name": "广西砂糖橘 1.5kg", "price": 16.90 }
                ]
            }, {
                "shop": "超市",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "精品 西红柿", "price": 4.44 }
                ]
            }, {
                "shop": "京东",
                "note": "格琳诺尔京东自营旗舰店",
                "items": [
                    { "name": "格琳诺尔 有机纯玉米粉1kg", "price": 13.83 },
                    { "name": "格琳诺尔 有机荞麦面1kg", "price": 23.06 }
                ]
            }, {
                "shop": "京东",
                "note": "纳美京东自营官方旗舰店",
                "items": [
                    { "name": "纳美小苏打 竹盐薄荷小苏打 3支300g", "price": 8.13 }
                ]
            }
        ],
        "2025-01-20": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】大白菜1.2kg", "price": 9.90 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "俄式精制红肠210g(3根装)", "price": 8.80 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }
        ],
        "2025-01-21": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB(航头浦乐汇店)",
                "items": [
                    { "name": "NB 苏北老豆腐 350g", "price": 2.99 },
                    { "name": "冰鲜 琵琶腿 800g*2", "price": 23.80 },
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 17.90 }
                ]
            }
        ],
        "2025-01-22": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "慢养黑猪冷鲜精瘦肉240g", "price": 9.60 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机水果黄瓜 300g/份", "price": 5.90 },
                    { "name": "配送费", "price": 5.00 }
                ]
            }
        ],
        "2025-01-23": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "象大厨卤水经典老豆腐380g", "price": 4.50 },
                    { "name": "安琪高活性干酵母低糖型50g(5g*10袋)", "price": 6.90 },
                    { "name": "【有机】土豆 500g", "price": 6.99 },
                    { "name": "【有机】大白菜1.2kg", "price": 8.60 },
                    { "name": "【娃哈哈饮用纯净水5.5L*1", "price": 7.90 },
                    { "name": "双汇Q趣儿蘑菇风味香肠70g", "price": 0.00 }
                ]
            }
        ],
        "2025-01-24": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "石屏腐竹 250g/袋", "price": 11.64 },
                    { "name": "农夫山泉桶装水5L*4桶", "price": 28.76 }
                ]
            }, {
                "shop": "联通",
                "note": "China Unicom Software",
                "items": [
                    { "name": "话费 200元", "price": 195.54 }
                ]
            }
        ],
        "2025-01-25": [
            {
                "shop": "小象",
                "items": [
                    { "name": "安琪高活性干酵母15g*2", "price": 3.95 },
                    { "name": "小猪呵呵火腿猪肉午餐肉198g", "price": 10.18 },
                    { "name": "【品质精选】五得利八星雪花小麦粉5kg", "price": 20.44 },
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "象大厨卤水经典老豆腐380g", "price": 3.56 },
                    { "name": "三元72°C瓶装鲜牛乳450ml*2", "price": 9.39 },
                    { "name": "王家渡猪肉原味低温午餐肉150g", "price": 8.58 },
                    { "name": "中盐日晒自然盐250g", "price": 0.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "香椿鸡 冰鲜 草鸡整鸡 950g", "price": 36.90 },
                    { "name": "粉藕 550g", "price": 4.99 },
                    { "name": "霜打长白萝卜 1.5kg", "price": 3.99 },
                    { "name": "NB×晶华鱼丸 手工肉卷 150g", "price": 9.90 },
                    { "name": "NB 弹跳牛肉丸 150g", "price": 8.80 },
                    { "name": "NB 手剥烤核桃 草本味 550g", "price": 15.90 },
                    { "name": "海欣 花样尝鲜组合装(鱼籽...)", "price": 7.90 },
                    { "name": "NB 背心式垃圾袋 30只*4", "price": 8.90 },
                    { "name": "【特卖】Heinz/亨氏 番茄...", "price": 9.90 },
                    { "name": "艺杏 小油豆腐 130g/袋", "price": 3.50 },
                    { "name": "NB 山核桃瓜子 500g", "price": 11.90 }
                ]
            }
        ],
        "2025-01-26": [
            {
                "shop": "美团",
                "note": "外滩小馆·上海特色菜·小笼包（外滩店）",
                "items": [
                    { "name": "【上海菜】超值老上海2-3人餐", "price": 238.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "日日鲜光明鲜牛奶1.35L", "price": 23.52 },
                    { "name": "怡宝纯净水 6L", "price": 16.18 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }, {
                "shop": "滴滴",
                "items": [
                    { "name": "杰拉电竞·网咖(汉口路店)→豫园", "price": 11.40 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "羊肉串*2", "price": 12.00 },
                    { "name": "传统牛肉面", "price": 13.00 }
                ]
            }, {
                "shop": "微信",
                "note": "喜士多(新中福店)",
                "items": [
                    { "name": "矿泉水*3", "price": 7.80 }
                ]
            }, {
                "shop": "微信",
                "note": "给许如芳电话18717963630",
                "items": [
                    { "name": "东方明珠闪光玩具", "price": 10.00 }
                ]
            }, {
                "shop": "取现",
                "note": "招商银行ATM自动取款机",
                "items": [
                    { "name": "红包", "price": 600.00 }
                ]
            }
        ],
        "2025-01-27": [
            {
                "shop": "小象",
                "items": [
                    { "name": "士力架花生夹心巧克力分享装240g(内含12块)", "price": 16.06 },
                    { "name": "旺仔牛奶125ml*4盒", "price": 8.99 },
                    { "name": "怡宝饮用纯净水(量贩装)555ml*12瓶", "price": 12.26 },
                    { "name": "进口香蕉约600g", "price": 6.75 },
                    { "name": "【黑猪肉>80%】锋味派原味黑猪肉爆汁烤肠200g(4根)", "price": 21.73 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "取现",
                "note": "招商银行ATM自动取款机",
                "items": [
                    { "name": "红包", "price": 600.00 }
                ]
            }
        ],
        "2025-01-28": [
            {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2025/02/01-2025/02/28)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }, {
                "shop": "美团",
                "note": "虾兵蟹将·蟹黄面·老上海馄饨(豫园店)",
                "items": [
                    { "name": "【百年豫园】至尊虾兵蟹将3人餐", "price": 277.00 }
                ]
            }, {
                "shop": "美团",
                "note": "耶里夏丽·景观餐厅(人民广场世茂店)",
                "items": [
                    { "name": "【冬月正当时】四人欢聚套餐", "price": 388.00 }
                ]
            }, {
                "shop": "美团",
                "note": "耶里夏丽·景观餐厅(人民广场世茂店)",
                "items": [
                    { "name": "耶里夏丽2人餐", "price": 258.00 }
                ]
            }, {
                "shop": "滴滴",
                "items": [
                    { "name": "江湾上海粤海酒店-大堂(逸仙路店)→豫园-地铁站", "price": 44.90 }
                ]
            }, {
                "shop": "美团",
                "note": "塔哈尔·新疆盛宴(合生汇店)",
                "items": [
                    { "name": "烤包子", "price": 20.00 },
                    { "name": "番茄牛腩", "price": 68.00 }
                ]
            }
        ],
        "2025-01-29": [
            {
                "shop": "美团",
                "note": "避风塘(周浦万达店)",
                "items": [
                    { "name": "好运牛牛双人餐", "price": 188.00 },
                    { "name": "豉汁蒸凤爪", "price": 34.00 }
                ]
            }, {
                "shop": "美团",
                "note": "避风塘(周浦万达店)",
                "items": [
                    { "name": "金莎海虾红米肠粉", "price": 39.00 },
                    { "name": "豉汁蒸凤爪", "price": 34.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "广西沃柑约1kg(单果110g起)", "price": 7.80 },
                    { "name": "配送费", "price": 6.00 }

                ]
            }, {
                "shop": "微信",
                "note": "远望谷(上海)信息技术有限公司",
                "items": [
                    { "name": "远望谷拍照冰箱贴-玉兰明珠", "price": 38.00 }

                ]
            }, {
                "shop": "微信",
                "note": "上海东方明珠广播电视塔有限公司",
                "items": [
                    { "name": "景区望远镜[2.00元1分钟]*2", "price": 4.00 }

                ]
            }, {
                "shop": "微信",
                "note": "上海汇付支付有限公司",
                "items": [
                    { "name": "惊喜蛋", "price": 42.00 }

                ]
            }, {
                "shop": "微信",
                "note": "上海东方明珠广播电视塔有限公司",
                "items": [
                    { "name": "二球观光_场次9:00-21:00_儿童票", "price": 99.00 },
                    { "name": "二球观光_场次9:00-21:00_成人票", "price": 199.00 },
                    { "name": "二球观光_场次9:00-21:00_成人票", "price": 199.00 },
                    { "name": "二球观光_场次9:00-21:00_成人票", "price": 199.00 }

                ]
            }, {
                "shop": "美团",
                "note": "和平影都（黄浦区西藏中路290号）",
                "items": [
                    { "name": "封神第二部:战火西岐", "price": 72.00 }

                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-陆家嘴", "price": 5.00 },
                    { "name": "上海地铁-人民广场", "price": 5.00 },
                    { "name": "上海地铁-陆家嘴", "price": 3.00 },
                    { "name": "上海地铁-鹤涛路", "price": 5.00 },
                    { "name": "上海地铁-人民广场", "price": 5.00 },
                    { "name": "上海地铁-豫园", "price": 3.00 },
                    { "name": "上海地铁-五角场", "price": 4.00 },
                    { "name": "上海地铁-鹤涛路", "price": 6.00 }
                ]
            }
        ],
        "2025-01-30": [
            {
                "shop": "滴滴",
                "items": [
                    { "name": "慧智·有巢-西门→上海野生动物园", "price": 55.29 }
                ]
            }, {
                "shop": "微信",
                "note": "上海野生动物园发展有限责任公司",
                "items": [
                    { "name": "经营部一露营车-租车/天", "price": 80.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海野生动物园发展有限责任公司",
                "items": [
                    { "name": "上野便利店内购物 烤肠*4", "price": 40.00 },
                    { "name": "上野便利店内购物 关东煮+玉米", "price": 40.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海野生动物园发展有限责任公司",
                "items": [
                    { "name": "上海野生动物园-购票-投喂车（儿童90cm以上）", "price": 50.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海野生动物园发展有限责任公司",
                "items": [
                    { "name": "上海野生动物园 滑板车寄存-51号柜", "price": 40.00 }
                ]
            }, {
                "shop": "携程",
                "items": [
                    { "name": "上海野生动物园门票+普通投喂车票成人票x3份", "price": 588.00 },
                    { "name": "保险", "price": 15.00 }
                ]
            }, {
                "shop": "携程",
                "items": [
                    { "name": "上海野生动物园门票+普通投喂车票成人票x1份", "price": 196.00 },
                    { "name": "保险", "price": 5.00 }
                ]
            }, {
                "shop": "美团",
                "note": "正新鸡排(浦乐汇店)",
                "items": [
                    { "name": "中国鸡排堡烧烤套餐", "price": 24.80 },
                    { "name": "中国鸡排堡三件套", "price": 23.80 },
                    { "name": "打包费", "price": 2.00 },
                    { "name": "优惠券", "price": -13.00 }
                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海野生动物园-有巢-公交", "price": 0.79 },
                    { "name": "上海野生动物园-有巢-公交", "price": 3.00 }
                ]
            }
        ],
        "2025-01-31": [
            {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 },
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }, {
                "shop": "美团",
                "note": "南门铜鼎涮肉·羊庄铁锅（汶水东路288号）",
                "items": [
                    { "name": "3-4 人涮羊肉套餐", "price": 378.00 }
                ]
            }, {
                "shop": "美团",
                "note": "热炕头·东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "锅包肉+地三鲜+米饭2份", "price": 81.46 },
                    { "name": "打包费", "price": 1.00 },
                    { "name": "配送费", "price": 4.35 },
                    { "name": "优惠券", "price": -18.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "保萝工坊虎皮瑞士卷160g", "price": 12.98 },
                    { "name": "经典提子拿破仑酥135g", "price": 15.72 },
                    { "name": "配送费", "price": 8.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "俄瓦斯哈尔滨风味休闲红肠50g", "price": 15.60 },
                    { "name": "广西沃柑实惠装1.5kg(单果90g起)", "price": 14.80 },
                    { "name": "【即食】鲜切越南菠萝蜜肉250g", "price": 14.90 },
                    { "name": "海盐芝士蛋糕110g", "price": 15.90 },
                    { "name": "牛乳麻薯蛋糕卷110g(2片)", "price": 8.40 },
                    { "name": "配送费", "price": 3.00 }

                ]
            }, {
                "shop": "机场",
                "note": "上海蔚蓝时代商业管理有限公司",
                "items": [
                    { "name": "上海景点冰箱贴", "price": 35.00 },
                    { "name": "上海景点冰箱贴", "price": 40.00 }

                ]
            }
        ],
        "2025-02-01": [
            {
                "shop": "微信",
                "note": "上海公共交通卡股份有限公司MOT",
                "items": [
                    { "name": "上海交通卡·交通联合版充值", "price": 30.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "安买多功能勺1个", "price": 0.00 },
                    { "name": "秋浦河山林散养谷粮蛋15枚", "price": 18.40 },
                    { "name": "豫娃娃有机石磨荞麦粉1kg", "price": 14.34 },
                    { "name": "圣牧有机纯酸奶400g/盒", "price": 11.92 },
                    { "name": "有机红洋葱 300g/份", "price": 5.03 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "秋林里道斯红肠110g", "price": 15.90 },
                    { "name": "怡宝纯净水6L*1", "price": 8.90 },
                    { "name": "【有机】水果甘蓝500g", "price": 8.29 },
                    { "name": "【小炒肉搭档】湘香软皮椒200g", "price": 6.19 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }
        ],
        "2025-02-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "哈尔滨风味红肠 50g", "price": 0.00 },
                    { "name": "千禾零添加特级生抽500mL", "price": 13.68 },
                    { "name": "海天有机蚝油鲜露 600g", "price": 14.57 },
                    { "name": "有机黑猪冷鲜肉馅 450g", "price": 27.15 },
                    { "name": "有机黑猪冷鲜肉馅 200g", "price": 13.51 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }
        ],
        "2025-02-03": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "云蕾棉柔抹布1片装", "price": 0.00 },
                    { "name": "有机水果甘蓝 500g/份", "price": 9.24 },
                    { "name": "有机茄子(长茄)300g", "price": 12.98 },
                    { "name": "秋浦河山林散养谷粮蛋15枚", "price": 18.58 },
                    { "name": "怡宝纯净水 6L*1", "price": 8.31 },
                    { "name": "有机土豆 500g/份", "price": 8.02 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 27.96 }
                ]
            }, {
                "shop": "京东",
                "note": "上海蔚蓝时代商业管理有限公司",
                "items": [
                    { "name": "金号毛巾柔软纯棉66*34cm 79g*2条", "price": 19.90 },
                    { "name": "三利新疆棉7A抗菌 深灰+浅灰 2条", "price": 21.90 },
                    { "name": "优惠券", "price": -10.56 }

                ]
            }, {
                "shop": "京东",
                "note": "可心柔(COROU)京东自营旗舰店",
                "items": [
                    { "name": "可心柔婴儿纸巾3层 60抽 5包", "price": 7.43 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2025/01/01-2025/02/01)上海兴利开发有限公司", "price": 35.83 },
                    { "name": "公寓电费(2025/01/01-2025/02/01)上海兴利开发有限公司", "price": 177.69 }
                ]
            }
        ],
        "2025-02-04": [
            {
                "shop": "小象",
                "items": [
                    { "name": "【有机】青甘蓝500g", "price": 7.39 },
                    { "name": "【有机】土豆 500g", "price": 6.99 },
                    { "name": "【有机】湘佳冷鲜散养土鸡鸡翅根250g", "price": 13.16 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 },
                    { "name": "传统牛肉面", "price": 13.00 }
                ]
            }
        ],
        "2025-02-05": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "哈啰出行",
                "items": [
                    { "name": "共享单车", "price": 1.40 },
                    { "name": "共享单车", "price": 5.50 }
                ]
            }, {
                "shop": "支",
                "note": "美团骑行",
                "items": [
                    { "name": "共享单车", "price": 1.50 }
                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "公交车", "price": 1.00 }
                ]
            }, {
                "shop": "支",
                "note": "上海众简新能源科技有限公司",
                "items": [
                    { "name": "费用代扣第1期", "price": 659.00 },
                    { "name": "办单费 提供两轮电动车租赁服务", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "秋林里道斯红肠110g", "price": 15.90 },
                    { "name": "【有机】大白菜1.2kg", "price": 9.90 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "德青源无抗鲜鸡蛋20枚1kg", "price": 20.65 },
                    { "name": "有机胡萝卜400g/份", "price": 6.36 }
                ]
            }, {
                "shop": "京东",
                "note": "supfire神火京东自营旗舰店",
                "items": [
                    { "name": "神火(SupFire)lk18电动车手机支架", "price": 16.92 }
                ]
            }, {
                "shop": "京东",
                "note": "爱玛电动车京东自营旗舰店",
                "items": [
                    { "name": "爱玛冬季电动车挡风被", "price": 22.58 }
                ]
            }, {
                "shop": "京东",
                "note": "京喜自营官方店",
                "items": [
                    { "name": "摩托车捆绑绳后备箱绑带挂勾弹力松紧绳", "price": 3.99 }
                ]
            }
        ],
        "2025-02-06": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "京东",
                "note": "加加林京东自营旗舰店",
                "items": [
                    { "name": "JAJALIN手机防尘袋专用", "price": 7.80 }
                ]
            }, {
                "shop": "微信",
                "note": "上海市浦东新区周浦医院",
                "items": [
                    { "name": "健康证-体检", "price": 139.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机茄子(长茄)300g", "price": 13.46 },
                    { "name": "统一茄皇牛肉面126g*5", "price": 17.44 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "【有机】土豆 500g", "price": 7.75 }
                ]
            }, {
                "shop": "微信",
                "items": [
                    { "name": "美团众包-保证金", "price": 100.00 }
                ]
            }
        ],
        "2025-02-07": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "京东",
                "note": "永久(FOREVER)骑行装备京东自营旗舰店",
                "items": [
                    { "name": "永久(FOREVER)3C认证骑行头盔", "price": 55.05 }
                ]
            }, {
                "shop": "京东",
                "note": "星骑侠摩托车装备专营店",
                "items": [
                    { "name": "追羚摩托车尾箱大容量57L", "price": 81.00 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "鲜鸡蛋30枚 1.6kg", "price": 15.90 },
                    { "name": "冰鲜鸡翅中 500g", "price": 21.60 },
                    { "name": "现烤 新奥尔良大鸡腿 3只装", "price": 26.90 }
                ]
            }, {
                "shop": "微信",
                "note": "吴建茂-浦东鹤沙路736号雅迪电动车",
                "items": [
                    { "name": "后视镜 校正", "price": 2.00 }
                ]
            }
        ],
        "2025-02-08": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "联华超市叶红店",
                "items": [
                    { "name": "南瓜", "price": 8.60 },
                    { "name": "红薯", "price": 5.20 },
                    { "name": "辣椒", "price": 3.00 },
                    { "name": "土豆", "price": 2.80 },
                    { "name": "茄子", "price": 7.30 },
                    { "name": "胡萝卜", "price": 2.60 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "哈尔滨风味红肠 50g", "price": 0.00 },
                    { "name": "康师傅大食袋红烧牛肉面5包*2", "price": 23.54 },
                    { "name": "统一酸酸辣辣豚骨拉面5袋", "price": 17.26 }
                ]
            }
        ],
        "2025-02-09": [
            {
                "shop": "PDD",
                "note": "浙江东大日用品",
                "items": [
                    { "name": "电动车防风棉把套", "price": 1.29 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "山林大块肉红肠 260g", "price": 9.95 },
                    { "name": "有机黑猪冷鲜肉馅 200g", "price": 16.80 }
                ]
            }
        ],
        "2025-02-10": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "思念无糖黑芝麻汤圆 400g", "price": 7.91 },
                    { "name": "山林大块肉红肠 260g", "price": 23.89 }
                ]
            }, {
                "shop": "京东",
                "note": "天猫超市",
                "items": [
                    { "name": "[2024年新米]十月稻田寒地之最 五常大米5kg;1件", "price": 53.14 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "怡宝纯净水6L*1", "price": 8.90 }
                ]
            }
        ],
        "2025-02-11": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 28.50 }
                ]
            }, {
                "shop": "京东",
                "note": "清风京东自营旗舰店",
                "items": [
                    { "name": "清风有芯 4层 200g/卷10卷", "price": 25.19 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机土豆 500g/份", "price": 7.62 },
                    { "name": "湘佳冷鲜有机鸡边腿 250g", "price": 22.81 },
                    { "name": "湘佳鸡小腿 430g", "price": 23.76 }
                ]
            }, {
                "shop": "微信",
                "note": "面馆 弄堂记忆",
                "items": [
                    { "name": "葱油面", "price": 8.00 }
                ]
            }
        ],
        "2025-02-12": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "高山自然熟沙瓤番茄 500g", "price": 8.71 },
                    { "name": "崇明西葫芦 350g/份", "price": 4.91 },
                    { "name": "有豆志山涧柴火豆腐 400g", "price": 6.11 },
                    { "name": "有机水果甘蓝 500g/份", "price": 8.39 },
                    { "name": "东湖五年陈醋 500mL/瓶", "price": 17.80 },
                    { "name": "有机胡萝卜 400g/份", "price": 5.69 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "进口香蕉 约600g", "price": 7.35 },
                    { "name": "锋味派黑胡椒味猪肉爆汁烤肠200g(4根)", "price": 22.90 },
                    { "name": "思念招财进宝黑芝麻开心果元宝汤圆312g(20只)", "price": 9.50 }
                ]
            }, {
                "shop": "微信",
                "note": "沪宁时代优品",
                "items": [
                    { "name": "双汇火腿肠（蒜味）上海市浦东新区航头镇阳古统食杂店", "price": 15.80 }
                ]
            }
        ],
        "2025-02-13": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "红烧牛肉面(周市路122号)",
                "items": [
                    { "name": "红烧牛肉面", "price": 20.00 }
                ]
            }, {
                "shop": "美团",
                "note": "黑土屯老朴家铁锅炖(航头浦...",
                "items": [
                    { "name": "老朴家铁锅大丰收双人餐", "price": 181.00 },
                    { "name": "大窑嘉宾橙", "price": 10.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "teenieweeniebag旗舰店",
                "items": [
                    { "name": "TeenieWeenie单肩饺子包 温柔白杏色", "price": 188.80 }
                ]
            }
        ],
        "2025-02-14": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "大眼包子（有巢店）",
                "items": [
                    { "name": "烤肠", "price": 5.00 }
                ]
            }, {
                "shop": "微信",
                "note": "本帮面馆",
                "items": [
                    { "name": "卤蛋面", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "花芝恋鲜花店 杨浦区杨树浦路1197号",
                "items": [
                    { "name": "【心动时刻】6朵玫瑰混搭蝴蝶兰花束粉色混搭花束", "price": 73.00 }
                ]
            }, {
                "shop": "微信",
                "note": "夸父炸串(浦东浦乐汇航头店)",
                "items": [
                    { "name": "赔付 饿了么#5单子(120元)错拿 店员已重做一份 赔付60买下拿错的外卖", "price": 60.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "德青源无抗鲜鸡蛋20枚1kg", "price": 18.90 }
                ]
            }
        ],
        "2025-02-15": [
            {
                "shop": "京东",
                "note": "展艺烘焙京东自营旗舰店",
                "items": [
                    { "name": "展艺 铝箔纸(长50米*宽30cm)空气炸锅烤箱烤", "price": 15.83 }
                ]
            }, {
                "shop": "京东",
                "note": "小魔家居京东自营旗舰店",
                "items": [
                    { "name": "小魔一次性雨衣雨披加厚成人便携雨衣", "price": 3.02 }
                ]
            }
        ],
        "2025-02-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "德青源无抗鲜鸡蛋20枚1kg", "price": 23.80 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 29.90 },
                    { "name": "礼品卡", "price": -0.02 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 5.59 },
                    { "name": "蔡长青速冻美式杂菜 245g", "price": 6.90 },
                    { "name": "有机黑猪冷鲜肉馅 200a", "price": 12.90 },
                    { "name": "有豆志黄金小油豆腐 120g", "price": 5.90 },
                    { "name": "有机大白菜 1.2kg/份", "price": 9.90 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【品质精选】五得利八星雪花小麦粉5kg", "price": 28.50 },
                    { "name": "齐心502强力胶3g", "price": 1.90 }
                ]
            }
        ],
        "2025-02-17": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "京东",
                "note": "杨饰公子旗舰店",
                "items": [
                    { "name": "杨饰公子 手套 漏二指黑【春夏薄款】均码", "price": 15.28 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "龙凤经典鲜美肉汤圆 200g(10个)", "price": 6.75 },
                    { "name": "三全飘香馄饨三鲜馅 300g (36只)", "price": 4.29 },
                    { "name": "优诺4.0g优质乳蛋白牛乳950ml", "price": 13.49 },
                    { "name": "【经典红肠】山林大红大块肉红肠260g", "price": 10.30 },
                    { "name": "优质冷鲜鸡琵琶腿 400g", "price": 6.83 },
                    { "name": "【有机】土豆 500g", "price": 6.14 },
                    { "name": "【有机】湘佳散养土鸡琵琶腿250g", "price": 16.41 }
                ]
            }, {
                "shop": "微信",
                "note": "路边摊",
                "items": [
                    { "name": "烤红薯", "price": 10.00 }
                ]
            }
        ],
        "2025-02-18": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "路边摊",
                "items": [
                    { "name": "沙糖桔", "price": 6.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "必品阁韩式泡菜王饺子14个", "price": 15.90 },
                    { "name": "雀巢威化黑巧克力120g", "price": 17.50 },
                    { "name": "有机大蒜 180g/份", "price": 8.09 },
                    { "name": "紫色细长茄 约400g", "price": 8.19 },
                    { "name": "有机土豆 500g/份", "price": 6.38 },
                    { "name": "礼品卡", "price": -0.40 }
                ]
            }
        ],
        "2025-02-19": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "蛋炒饭", "price": 15.00 },
                    { "name": "传统牛肉面", "price": 13.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "线椒约160g", "price": 4.50 },
                    { "name": "【沙瓤多汁】普罗旺斯西红柿约500g", "price": 7.49 },
                    { "name": "慢养黑猪冷鲜通脊(里脊)300g", "price": 19.90 },
                    { "name": "必品阁白菜猪肉王饺子350g(10只)", "price": 10.90 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "元气森林白桃味气泡水 2L", "price": 5.69 },
                    { "name": "100%橙汁 1L/瓶", "price": 8.45 }
                ]
            }
        ],
        "2025-02-20": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "items": [
                    { "name": "酱香饼", "price": 3.00 }
                ]
            }, {
                "shop": "支",
                "note": "有巢生活住房租赁(深圳)有限责任公司",
                "items": [
                    { "name": "有巢会员费 散客合同起租账单", "price": 297.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "线椒约160g", "price": 4.50 },
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "缤纷迷你小菠萝果切250g", "price": 13.90 },
                    { "name": "慢养黑猪冷鲜精瘦肉240g 买一赠一", "price": 26.90 },
                    { "name": "【供港】黄瓜500g", "price": 6.20 }
                ]
            }, {
                "shop": "美团",
                "note": "美团众包-商城-深圳市中创尚品贸易有限公司",
                "items": [
                    { "name": "【骑行手套】秋冬保暖手套防滑 边扣全指", "price": 0.01 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 20.00 }
                ]
            }
        ],
        "2025-02-21": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "AZUL italiano意大利餐厅(白白玉兰广场)",
                "items": [
                    { "name": "早春融融双人套餐", "price": 154.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 20.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "可心柔亲肤湿巾 10片/包", "price": 0.00 },
                    { "name": "朝一可生食鸡蛋10枚500g", "price": 12.05 },
                    { "name": "叶黄素+维生素D3鸡蛋15枚", "price": 15.69 },
                    { "name": "有机番茄 300g/盒", "price": 12.98 },
                    { "name": "宛禾砂锅土豆粉 320g*2", "price": 16.59 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 27.95 }
                ]
            }
        ],
        "2025-02-22": [
            {
                "shop": "PDD",
                "note": "蓝棉花家居生活专卖店",
                "items": [
                    { "name": "蓝棉花益生菌 医护级特护卫生巾 日8+夜6+加长夜5+迷你10+便携2", "price": 14.95 }
                ]
            }
        ],
        "2025-02-23": [
            {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 20.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "每日鲜语鲜牛奶 950mL", "price": 12.50 },
                    { "name": "必品阁韩式泡菜王饺子14个", "price": 15.90 },
                    { "name": "李锦记0添加薄盐生抽615g", "price": 8.90 },
                    { "name": "无抗冷冻鸡大胸 400g", "price": 11.50 },
                    { "name": "有机胡萝卜400g/份", "price": 6.59 },
                    { "name": "有机西兰花 300g/份", "price": 9.90 },
                    { "name": "礼品卡", "price": -0.18 }
                ]
            }
        ],
        "2025-02-24": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "雀巢奇巧威化120g", "price": 16.65 },
                    { "name": "必品阁玉米猪肉王饺子 490g", "price": 17.03 },
                    { "name": "有机草原黑猪肉丝 200g", "price": 12.84 },
                    { "name": "有豆志中百页 150g/份", "price": 5.03 },
                    { "name": "湘味软皮椒 200g/份", "price": 7.37 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }, {
                "shop": "微信",
                "note": "小张车行(周浦镇周泰路96号台铃)",
                "items": [
                    { "name": "预约办理电动自行车车牌 定金 200", "price": 200.00 }
                ]
            }, {
                "shop": "微信",
                "note": "江西小炒上海周泰路店",
                "items": [
                    { "name": "青椒(酸辣)土豆丝木桶饭", "price": 14.00 }
                ]
            }
        ],
        "2025-02-25": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 20.00 }
                ]
            }, {
                "shop": "京东",
                "note": "道道全京东自营旗舰店",
                "items": [
                    { "name": "菜籽油 压榨一级1.8L", "price": 29.24 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "康师傅大食袋红烧牛肉面5包", "price": 14.45 },
                    { "name": "康师傅香辣牛肉面 5包/袋", "price": 13.44 },
                    { "name": "农夫山泉桶装水5L*4桶", "price": 27.91 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "清美盐卤五香干120g", "price": 3.50 },
                    { "name": "线椒约160g", "price": 4.50 },
                    { "name": "鲜切徐闻菠萝300g", "price": 14.90 },
                    { "name": "【添加艾草丝】小象烘焙双拼青团豆沙+蛋黄肉松240g(4粒)", "price": 11.90 },
                    { "name": "象大厨鳕鱼丸150g", "price": 7.93 },
                    { "name": "【纯肋排】精选冷鲜纯肋排300g", "price": 20.47 }
                ]
            }
        ],
        "2025-02-26": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "财付通支付科技有限公司",
                "items": [
                    { "name": "哈啰换电服务费 30天不限次 48V30aAh 福建宁德惠智无限科技有限公司", "price": 199.00 }
                ]
            }, {
                "shop": "微信",
                "note": "小张车行(周浦镇周泰路96号台铃)",
                "items": [
                    { "name": "台铃苍穹 电动自行车车架子(不含电池)", "price": 3099.00 }
                ]
            }, {
                "shop": "微信",
                "note": "清真西北拉面 周泰路94号",
                "items": [
                    { "name": "红烧牛肉面", "price": 15.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "线椒约160g", "price": 4.50 },
                    { "name": "【有机】香菇 100g", "price": 4.49 },
                    { "name": "象大厨卤水经典老豆腐380g", "price": 4.50 },
                    { "name": "【本地鲜】崇明杭茄300g", "price": 9.90 },
                    { "name": "【手工匠心】旭洋手工老豆腐300g", "price": 4.50 },
                    { "name": "慢养黑猪冷鲜肉馅(肥瘦约3:7)300g", "price": 10.90 },
                    { "name": "云南应季新土豆600g", "price": 4.15 }
                ]
            }, {
                "shop": "支",
                "note": "美团骑行",
                "items": [
                    { "name": "骑行25分钟 美团单车", "price": 2.50 },
                    { "name": "骑行35分钟 美团单车", "price": 3.50 }
                ]
            }
        ],
        "2025-02-27": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "AXE/斧头牌 柠檬护肤洗洁精1.08kg", "price": 12.90 },
                    { "name": "中盐牌未加碘纯精岩盐400g", "price": 3.90 },
                    { "name": "【有机】大白菜1.2kg", "price": 9.90 },
                    { "name": "【供港】西红柿500g", "price": 6.20 },
                    { "name": "正大叶黄素可生食鲜鸡蛋10枚530g", "price": 11.90 }
                ]
            }, {
                "shop": "微信",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "韩记红烧牛肉面", "price": 12.00 }
                ]
            }
        ],
        "2025-02-28": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2025/03/01-2025/03/31)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "美汁源果粒橙橙汁饮料1.25L", "price": 6.50 },
                    { "name": "海霸王蟹味棒250g", "price": 10.90 },
                    { "name": "【沙瓤多汁】普罗旺斯西红柿500g", "price": 7.69 },
                    { "name": "海霸王火锅优选400g(内含4种)", "price": 13.90 },
                    { "name": "象大厨小油豆腐130g", "price": 4.50 }
                ]
            }
        ],
        "2025-03-01": [
            {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2024/02/01-2025/03/01)上海兴利开发有限公司", "price": 29.72 },
                    { "name": "公寓电费(2024/02/01-2025/03/01)上海兴利开发有限公司", "price": 153.45 }
                ]
            }, {
                "shop": "京东",
                "note": "联合利华京东自营旗舰店",
                "items": [
                    { "name": "多芬丰盈 丰盈宠肤 730g 1瓶", "price": 16.21 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜 300g", "price": 4.85 },
                    { "name": "怡宝纯净水6L*1", "price": 8.90 },
                    { "name": "【供港】黄瓜500g", "price": 7.29 },
                    { "name": "正大叶黄素可生食鲜鸡蛋10枚530g", "price": 12.90 },
                    { "name": "【无抗】小象富硒可生食鲜鸡蛋6枚300g", "price": 8.80 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }
        ],
        "2025-03-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "农夫山泉桶装水5L*4桶", "price": 31.60 },
                    { "name": "有机土豆 500g/份", "price": 7.99 },
                    { "name": "礼品卡", "price": -0.13 }
                ]
            }, {
                "shop": "PDD",
                "note": "施华蔻美发染发专卖店",
                "items": [
                    { "name": "施华蔻氨基酸极光瓶 洗发露400mL", "price": 49.32 }
                ]
            }, {
                "shop": "盒马",
                "note": "盒马NB浦东航头浦乐汇店",
                "items": [
                    { "name": "冰鲜猪肋排 1.2kg", "price": 59.90 },
                    { "name": "配送费", "price": 3.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }
        ],
        "2025-03-03": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "丹丹红油郫县豆瓣500g", "price": 8.80 },
                    { "name": "秋林里道斯红肠110g", "price": 15.90 },
                    { "name": "螺丝椒 约300g", "price": 4.89 },
                    { "name": "【有机】胡萝卜300g", "price": 4.85 },
                    { "name": "慢养黑猪冷鲜肉馅(肥瘦约3:7)300g", "price": 10.90 },
                    { "name": "【无抗】可生食鲜鸡蛋20枚1kg", "price": 21.90 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "天猫",
                "note": "天猫超市",
                "items": [
                    { "name": "柴火大院五常有机稻香米5kg;1件", "price": 94.72 }
                ]
            }
        ],
        "2025-03-04": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "脆香米巧克力分享脆香米装120g(内含约9-10块)", "price": 14.90 },
                    { "name": "紫皮大蒜 约250g", "price": 4.85 },
                    { "name": "线椒约160g", "price": 3.99 },
                    { "name": "【本地鲜】崇明西葫芦 300g", "price": 5.19 },
                    { "name": "【本地鲜】崇明松花菜500g", "price": 7.99 },
                    { "name": "慢养黑猪冷鲜通脊(里脊)300g", "price": 19.90 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "可心柔亲肤湿巾 10片/包", "price": 0.00 },
                    { "name": "柚汁复合果汁饮料300g", "price": 6.47 },
                    { "name": "劲仔混合口味小鱼96g/袋", "price": 10.13 },
                    { "name": "卫龙风吃海带 50g/袋", "price": 5.53 },
                    { "name": "卫龙磨芋爽(香辣味)50g*3", "price": 12.63 },
                    { "name": "卫龙经典香辣风味亲嘴烧90g", "price": 5.80 },
                    { "name": "卫龙大面筋 106g/袋*3", "price": 13.22 },
                    { "name": "心相印厨房纸巾70节*6卷", "price": 16.79 },
                    { "name": "李锦记0添加薄盐生抽615g", "price": 8.34 },
                    { "name": "沙棘汁果汁饮料250ml*3", "price": 12.15 }
                ]
            }
        ],
        "2025-03-05": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "陕西新在线壹佰分教育有限公司",
                "items": [
                    { "name": "叉车 题库 安全生产在线学习", "price": 20.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海御康医院有限公司",
                "items": [
                    { "name": "叉车 体检", "price": 30.00 }
                ]
            }, {
                "shop": "微信",
                "note": "康桥叉车培训",
                "items": [
                    { "name": "叉车 报名 王先发15216687970", "price": 1200.00 }
                ]
            }, {
                "shop": "美团",
                "note": "朴大叔拌饭-金航城店",
                "items": [
                    { "name": "甄选肥牛锅 + 牛肉石锅拌饭", "price": 49.90 }
                ]
            }, {
                "shop": "微信",
                "note": "中国兰州拉面康沈路店",
                "items": [
                    { "name": "牛肉面", "price": 12.00 }
                ]
            }, {
                "shop": "支",
                "note": "沙县小吃",
                "items": [
                    { "name": "小馄饨", "price": 9.00 }
                ]
            }
        ],
        "2025-03-06": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "中国兰州拉面康沈路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 13.00 }
                ]
            }, {
                "shop": "美团",
                "note": "小满手工粉(上海金航城店)",
                "items": [
                    { "name": "【经典豪华】米粉3选2", "price": 65.60 }
                ]
            }
        ],
        "2025-03-07": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "items": [
                    { "name": "酱香饼", "price": 3.00 }
                ]
            }, {
                "shop": "微信",
                "note": "沙县小吃（康沈路店）",
                "items": [
                    { "name": "蛋炒饭", "price": 10.00 },
                    { "name": "螺蛳粉", "price": 15.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "叮咚定制切片年糕200g*2", "price": 5.89 },
                    { "name": "有机胡萝卜400g/份", "price": 6.59 },
                    { "name": "湘佳冷鲜有机鸡胸肉 250g", "price": 15.50 },
                    { "name": "有机香菇 150g/份", "price": 7.99 },
                    { "name": "普罗旺斯番茄 约500g", "price": 7.19 }
                ]
            }, {
                "shop": "微信",
                "note": "北京三快在线科技有限公司",
                "items": [
                    { "name": "美团 外卖柜", "price": 0.55 },
                    { "name": "美团 外卖柜", "price": 0.55 }
                ]
            }
        ],
        "2025-03-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 29.90 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【品质精选】五得利八星雪花小麦粉5kg", "price": 28.50 },
                    { "name": "【无抗】可生食鲜鸡蛋20枚1kg", "price": 21.90 }
                ]
            }, {
                "shop": "美团",
                "note": "玛嘉烈(周浦万达店)",
                "items": [
                    { "name": "【女神节】玛嘉烈双人", "price": 186.00 },
                    { "name": "米饭", "price": 4.00 }
                ]
            }, {
                "shop": "微信",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "尖叫", "price": 4.80 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }
        ],
        "2025-03-09": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌周浦站", "price": 6.00 }
                ]
            }, {
                "shop": "支",
                "note": "优衣库（周浦万达广场店）",
                "items": [
                    { "name": "宽松直筒牛仔裤", "price": 249.00 },
                    { "name": "休闲直筒牛仔裤", "price": 299.00 },
                    { "name": "优惠券", "price": -20.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "OPPO品牌",
                "items": [
                    { "name": "OPPO原装双C数据线12A充电线240/150W超级闪充", "price": 34.86 }
                ]
            }, {
                "shop": "京东",
                "note": "华为京东自营官方旗舰店",
                "items": [
                    { "name": "HUAWEI FreeBuds SE 2 华为长续航蓝牙耳机 陶瓷白", "price": 78.20 }
                ]
            }, {
                "shop": "京东",
                "items": [
                    { "name": "PLUS京典年卡 有效期:2025.03.09-2026.03.09", "price": 99.00 }
                ]
            }, {
                "shop": "京东",
                "note": "心相印京东自营官方旗舰店",
                "items": [
                    { "name": "心相印卷纸", "price": 25.22 }
                ]
            }
        ],
        "2025-03-10": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "线椒约160g", "price": 3.99 },
                    { "name": "三红胡萝卜约600g", "price": 2.48 },
                    { "name": "新茬黄心土豆约600g(大号)", "price": 3.09 },
                    { "name": "正大生冻黑虎虾240g(12-15只)", "price": 19.90 },
                    { "name": "【经典红肠】山林大块肉红大红大块肉红肠260g", "price": 11.90 }
                ]
            }, {
                "shop": "微信",
                "note": "中国兰州拉面康沈路店",
                "items": [
                    { "name": "兰州牛肉拉面", "price": 13.00 }
                ]
            }
        ],
        "2025-03-11": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【纯肋排】精选冷鲜纯肋排300g", "price": 29.90 },
                    { "name": "优诺4.0g优质乳蛋白牛乳950ml", "price": 17.90 }
                ]
            }, {
                "shop": "美团",
                "note": "麦当劳&麦咖啡(上海长阳路欧尚店)",
                "items": [
                    { "name": "大堡口福四件套(培根芝士双牛堡*1 薯条*1 麦乐鸡5块*1 可乐*1", "price": 33.00 }
                ]
            }, {
                "shop": "支",
                "items": [
                    { "name": "包一切鲜肉馅饼*1", "price": 2.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }
        ],
        "2025-03-12": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "items": [
                    { "name": "鲜肉小馄饨*1", "price": 9.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【0激素|非笼养】圣农冰鲜鸡小胸300g", "price": 9.52 },
                    { "name": "佳农进口香甜蕉700g", "price": 9.90 },
                    { "name": "【有机】小土豆500g", "price": 7.89 },
                    { "name": "高山紫长茄约450g", "price": 9.90 },
                    { "name": "正大叶黄素可生食鲜鸡蛋10枚530g", "price": 14.90 }
                ]
            }
        ],
        "2025-03-13": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 31.60 }
                ]
            }, {
                "shop": "支",
                "note": "青藏小伙牦牛骨汤牛肉面",
                "items": [
                    { "name": "招牌牛肉面 韭叶宽", "price": 17.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "清美内酯豆腐400g", "price": 2.60 },
                    { "name": "娃哈哈AD钙奶220g*4瓶(整组销售)", "price": 7.50 },
                    { "name": "优质冷鲜猪肉糜(肥瘦约3:7)400g", "price": 9.82 },
                    { "name": "【0激素|非笼养】圣农冰鲜鸡翅中360g", "price": 19.50 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "秋林里道斯红肠110g*2", "price": 25.13 },
                    { "name": "周黑鸭趣享卤鸭脖120g*2", "price": 19.55 },
                    { "name": "象大厨经典五香鸭锁骨100g(赠手套) ", "price": 7.90 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }
        ],
        "2025-03-14": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【有机】胡萝卜300g", "price": 4.90 },
                    { "name": "新茬黄心土豆约600g(大号)", "price": 2.73 },
                    { "name": "王家渡猪肉原味低温午餐肉150g ", "price": 10.90 },
                    { "name": "苏北草鸡蛋15枚600g", "price": 21.90 },
                    { "name": "苏北草鸡蛋15枚600g", "price": 0.00 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "卫龙大面筋106g*4", "price": 17.70 },
                    { "name": "螺丝椒", "price": 4.79 },
                    { "name": "【有机】西兰花 ", "price": 7.40 },
                    { "name": "皇上皇甄选腊肠", "price": 21.90 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "小份羊肉烩面", "price": 17.00 }
                ]
            }
        ],
        "2025-03-15": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌周浦站", "price": 6.00 }
                ]
            }, {
                "shop": "美团",
                "note": "山焱·炭火自助烤肉(周浦万达广场店)",
                "items": [
                    { "name": "双人午晚市通用自助", "price": 248.00 },
                ]
            }, {
                "shop": "京东",
                "note": "361度游泳用品京东自营旗舰店",
                "items": [
                    { "name": "361°防晒面罩遮阳", "price": 15.90 }
                ]
            }, {
                "shop": "京东",
                "note": "贸正(MaoZheng)京东自营旗舰店",
                "items": [
                    { "name": "贸正 漏二指手套 十双", "price": 14.03 }
                ]
            }
        ],
        "2025-03-16": [
            {
                "shop": "美团",
                "note": "热炕头·东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "东北溜肉段", "price": 39.00 },
                    { "name": "木须肉", "price": 35.00 },
                    { "name": "打包费", "price": 2.00 }
                ]
            }, {
                "shop": "美团",
                "note": "热炕头·东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "酸菜粉", "price": 29.90 },
                    { "name": "木须肉", "price": 24.00 },
                    { "name": "打包费", "price": 2.00 }
                ]
            }
        ],
        "2025-03-17": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "items": [
                    { "name": "杂粮煎饼果子*1", "price": 6.00 }
                ]
            }, {
                "shop": "微信",
                "note": "西北萃蘭州牛肉面(江月东路店)",
                "items": [
                    { "name": "传统牛肉面+煎鸡蛋", "price": 15.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有豆志山涧柴火豆腐 400g", "price": 6.80 },
                    { "name": "李锦记0添加薄盐生抽615g", "price": 8.90 },
                    { "name": "澳洲肥牛卷 300g", "price": 27.90 },
                    { "name": "有机红洋葱 300g/份", "price": 4.98 },
                    { "name": "礼品卡", "price": -0.02 }
                ]
            }
        ],
        "2025-03-18": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "粉档·南昌粉面馆(周浦万达店)",
                "items": [
                    { "name": "南昌拌粉+鸡蛋肉饼瓦罐", "price": 32.00 }
                ]
            }, {
                "shop": "美团",
                "note": "粉档·南昌粉面馆(周浦万达店)",
                "items": [
                    { "name": "南昌拌面", "price": 26.00 }
                ]
            },
        ],
        "2025-03-19": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "麦香阁纯汤牛肉面",
                "items": [
                    { "name": "牛肉炒刀削面", "price": 17.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "青菜砂锅米线", "price": 18.00 }
                ]
            }, {
                "shop": "京东",
                "note": "粉笔公考京东自营官方旗舰店",
                "items": [
                    { "name": "粉笔事业编A类【教材真题套装】职测+综应", "price": 74.66 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机胡萝卜400g/份", "price": 6.59 },
                    { "name": "2025年新茬土豆约500g", "price": 2.19 },
                    { "name": "益客冷鲜鸡爪 400g", "price": 18.50 },
                    { "name": "都乐进口超甜香蕉 700g", "price": 11.90 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "叶黄素+维生素D3鸡蛋15枚", "price": 19.80 },
                    { "name": "农夫山泉桶装水5L*4桶", "price": 31.60 }
                ]
            }
        ],
        "2025-03-20": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "喜家德虾仁水饺(上海互联宝地店)",
                "items": [
                    { "name": "角瓜鸡蛋虾皮水饺", "price": 30.90 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有机西兰花 300g/份", "price": 9.90 },
                    { "name": "无抗黑猪冷鲜肋排粒 300g", "price": 29.90 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }
        ],
        "2025-03-21": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "李老哈·东北菜(长阳创谷店)",
                "items": [
                    { "name": "李老哈酸菜炒粉+米饭", "price": 14.00 }
                ]
            }, {
                "shop": "微信",
                "note": "御之面师四宝牛杂面(周浦万达店)",
                "items": [
                    { "name": "四宝牛杂面+加面*2", "price": 20.00 }
                ]
            }, {
                "shop": "微信",
                "note": "地推引流_拓客王小佳",
                "items": [
                    { "name": "A+轻奢沙龙造型会员卡", "price": 30.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "黑土屯老朴家铁锅炖(航头店)",
                "items": [
                    { "name": "锅包肉/尖椒干豆腐/酸辣土豆丝/米饭2份", "price": 58.90 }
                ]
            }
        ],
        "2025-03-22": [
            {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "拉面+刀削面+煎蛋*2", "price": 32.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "养乐多低糖 100ml*5", "price": 13.80 },
                    { "name": "无抗冷冻鸡大胸 400g", "price": 11.50 },
                    { "name": "叶黄素+维生素D3鸡蛋15枚", "price": 16.90 },
                    { "name": "普罗旺斯番茄 约500g", "price": 6.39 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }, {
                "shop": "微信",
                "note": "淮南牛肉汤(周浦繁荣东路店)",
                "items": [
                    { "name": "SB商家包装垃圾_餐损赔偿20", "price": 20.00 }
                ]
            }
        ],
        "2025-03-23": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌周浦", "price": 6.00 }
                ]
            }, {
                "shop": "美团",
                "note": "潮界(周浦万达店)",
                "items": [
                    { "name": "潮界招牌双人餐", "price": 168.00 }
                ]
            }, {
                "shop": "PDD",
                "note": "品牌好货",
                "items": [
                    { "name": "妙洁钢丝球 不锈钢清洁球", "price": 4.72 }
                ]
            }, {
                "shop": "PDD",
                "note": "E路驰美容清洗官方旗舰店",
                "items": [
                    { "name": "E路驰清洁软胶 清洁泥吸尘胶", "price": 6.23 }
                ]
            }
        ],
        "2025-03-24": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "蛋炒饭", "price": 14.00 }
                ]
            }, {
                "shop": "美团",
                "note": "塔哈尔(周浦万达店)",
                "items": [
                    { "name": "大盘鸡汁拌面/手工现熬奶茶", "price": 26.80 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "必品阁玉米猪肉王饺子490g", "price": 17.90 },
                    { "name": "螺丝椒 约300g", "price": 5.39 },
                    { "name": "有机黑猪冷鲜通脊 200g", "price": 18.90 },
                    { "name": "【自然好滋味】有机莲藕400g/份", "price": 9.79 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "源氏大豆筋200g/袋", "price": 7.29 },
                    { "name": "哇哈哈纯净水 5.5L*4桶", "price": 31.60 }
                ]
            }
        ],
        "2025-03-25": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "FOODBOWL超级碗(上海互联宝地店)",
                "items": [
                    { "name": "蜜汁鸡腿超级碗", "price": 16.00 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "牛肉刀削面+煎蛋", "price": 17.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "攸县香干 248g/份", "price": 5.72 },
                    { "name": "普罗旺斯番茄 约500g", "price": 6.39 },
                    { "name": "山林大块肉红肠 260g", "price": 15.92 },
                    { "name": "有机香菇 150g/份", "price": 6.39 },
                    { "name": "紫色细长茄 约400g", "price": 7.89 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "优诺缤纷果味双拼酸奶100g*6杯(草莓*3+椰子*3)", "price": 16.90 },
                ]
            }, {
                "shop": "微信",
                "note": "哈啰出行_福建宁德惠智无限科技有限公司",
                "items": [
                    { "name": "哈啰换电服务费 180天 无限次", "price": 999.00 },
                ]
            }
        ],
        "2025-03-26": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "小份羊肉烩面", "price": 17.00 }
                ]
            }, {
                "shop": "微信",
                "note": "千里香手工馄饨水饺上海芳华路店",
                "items": [
                    { "name": "宫保鸡丁套饭", "price": 19.00 }
                ]
            }, {
                "shop": "微信",
                "note": "华联超市",
                "items": [
                    { "name": "农夫山泉2.1L*1", "price": 4.50 }
                ]
            }, {
                "shop": "微信",
                "note": "奥乐齐_芳甸路199弄大拇指广场2楼201A",
                "items": [
                    { "name": "悠白希腊式脱脂裸酸奶480克", "price": 24.90 },
                    { "name": "照烧鸡腿肉串5串TeriyakiFlavourYak", "price": 14.94 },
                    { "name": "悠白4.0娟姗牛奶950ml", "price": 15.90 },
                    { "name": "无纺布购物袋小号(限重5千克)", "price": 1.00 }
                ]
            }
        ],
        "2025-03-27": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "支",
                "note": "兰德香上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "有豆志卤水老豆腐400g/份", "price": 5.49 },
                    { "name": "三红胡萝卜约600g", "price": 1.98 },
                    { "name": "有机大白菜 1.2kg/份", "price": 9.89 },
                    { "name": "无抗冷冻鸡大胸 400g", "price": 11.50 },
                    { "name": "有机黄瓜 300g/份", "price": 11.90 },
                    { "name": "礼品卡", "price": -0.01 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "洁柔3层抽纸100抽*1包", "price": 0.00 },
                    { "name": "王守义十三香 45g/盒", "price": 4.19 },
                    { "name": "六月香豆瓣酱 300g/盒", "price": 6.51 },
                    { "name": "维他低糖柠檬茶250ml*6", "price": 13.79 },
                    { "name": "紫林五年陈山西老醋500mL", "price": 12.02 },
                    { "name": "叶黄素+维生素D3鸡蛋15枚", "price": 18.48 }
                ]
            }
        ],
        "2025-03-28": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "牛肉拉面＋煎蛋", "price": 15.00 }
                ]
            }, {
                "shop": "支",
                "note": "魔都三兄弟（杨浦黄兴路店）",
                "items": [
                    { "name": "金牌酸辣粉", "price": 22.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2025/04/01-2025/04/30)上海兴利开发有限公司", "price": 2434.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "热炕头东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "肉段烧茄子", "price": 18.64 },
                    { "name": "米饭", "price": 1.08 },
                    { "name": "打包费", "price": 0.98 }
                ]
            }
        ],
        "2025-03-29": [
            {
                "shop": "小象",
                "items": [
                    { "name": "卫龙大面筋106g*4", "price": 16.52 }
                ]
            }
        ],
        "2025-03-30": [
            {
                "shop": "微信",
                "note": "京穆聚红烧牛肉面上海航头店",
                "items": [
                    { "name": "牛肉拉面＋煎蛋", "price": 17.00 }
                ]
            }, {
                "shop": "美团",
                "note": "朴大叔拌饭(上海浦东金航城店)",
                "items": [
                    { "name": "经典营养石锅拌饭(无牛肉粒)", "price": 16.90 }
                ]
            }, {
                "shop": "支",
                "note": "大润发（康桥店）",
                "items": [
                    { "name": "金锣特品肉花肠300g/袋", "price": 11.90 },
                    { "name": "奥尔良烤鸡腿/个", "price": 9.90 },
                    { "name": "无纺布购物袋(红色)中号", "price": 1.60 },
                    { "name": "今麦郎寻味中华山西刀削面五连包", "price": 17.90 },
                    { "name": "今麦郎寻味中华兰州拉面五连包", "price": 17.90 },
                    { "name": "味全活性乳酸菌饮品850ml*2瓶/组", "price": 16.90 },
                    { "name": "巴东风味烤鸡腿/只", "price": 9.90 },
                    { "name": "支付宝优惠", "price": -6.00 }
                ]
            }, {
                "shop": "微信",
                "note": "大润发（康桥店）",
                "items": [
                    { "name": "青团（紫薯味）", "price": 11.21 }
                ]
            }
        ],
        "2025-03-31": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "谷田稻香(滨江百联店)",
                "items": [
                    { "name": "肉末茄子+米饭", "price": 18.90 }
                ]
            }, {
                "shop": "微信",
                "note": "陈香贵兰州牛肉面（周浦万达店）",
                "items": [
                    { "name": "牛骨清汤牛肉面", "price": 26.00 }
                ]
            }, {
                "shop": "微信",
                "note": "王春春鸡汤饭",
                "items": [
                    { "name": "鸡汤饭+鸡汤米线+鸡腿2个+卤蛋2个+娃娃菜", "price": 74.80 }
                ]
            }
        ],
        "2025-04-01": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "洁柔3层抽纸 100抽*1包", "price": 0.00 },
                    { "name": "叶黄素+维生素D3鸡蛋15枚", "price": 31.54 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 28.02 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "中国联通",
                "items": [
                    { "name": "话费", "price": 98.16 }
                ]
            }, {
                "shop": "支",
                "note": "大米先生(上海周浦万达店)",
                "items": [
                    { "name": "肉末茄子+米饭", "price": 12.68 }
                ]
            }, {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-周浦站→鹤涛路", "price": 3.00 }
                ]
            }
        ],
        "2025-04-02": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "老乡鸡(上海互联宝地店)",
                "items": [
                    { "name": "毛豆烧鸡+柿子炒鸡蛋+米饭", "price": 29.11 }
                ]
            }, {
                "shop": "微信",
                "note": "米村拌饭（周浦万达店）",
                "items": [
                    { "name": "辣鱿鱼+辣牛肉", "price": 61.80 }
                ]
            }
        ],
        "2025-04-03": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "公寓水费(2025/03/01-2025/04/01)上海兴利开发有限公司", "price": 30.15 },
                    { "name": "公寓电费(2025/03/01-2025/04/01)上海兴利开发有限公司", "price": 132.02 }
                ]
            }, {
                "shop": "美团",
                "note": "魔都三兄弟酸辣粉·米线(虹口来福士广场店)",
                "items": [
                    { "name": "甜辣笋尖酸辣粉+藕盒", "price": 17.65 }
                ]
            }, {
                "shop": "美团",
                "note": "麦当劳(周浦万达店)",
                "items": [
                    { "name": "汉堡*2+鸡翅*2+鸡腿*2+可乐+红茶", "price": 49.90 }
                ]
            }
        ],
        "2025-04-04": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌周浦路", "price": 6.00 }
                ]
            }, {
                "shop": "美团",
                "note": "鱼酷-上海周浦万达店",
                "items": [
                    { "name": "烤鱼+金针菇+木耳+酸梅汁+米饭*2+小海鲜", "price": 234.00 }
                ]
            }
        ],
        "2025-04-05": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路→芳芯路", "price": 4.00 },
                    { "name": "上海地铁-御桥站→鹤涛路", "price": 4.00 }
                ]
            }, {
                "shop": "美团",
                "note": "醉面（复地活力城店）",
                "items": [
                    { "name": "红烧牛肉面+肠+笋+肉酱拌面+鸡排+海带丝", "price": 58.80 }
                ]
            }, {
                "shop": "饿了",
                "note": "老乡鸡（金航城店）",
                "items": [
                    { "name": "卤肉饭+蒸蛋", "price": 11.80 }
                ]
            }

        ],
        "2025-04-06": [
            {
                "shop": "微信",
                "note": "时代优品超市(有巢店)",
                "items": [
                    { "name": "士力架", "price": 4.50 }
                ]
            }, {
                "shop": "美团",
                "note": "大米先生（浦东航头店）",
                "items": [
                    { "name": "菌香小煎鸡+西红柿炒鸡蛋+米饭+益生菌", "price": 22.91 }
                ]
            }
        ],
        "2025-04-07": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "中国兰州拉面康沈路店",
                "items": [
                    { "name": "牛肉刀削面+煎蛋", "price": 15.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "小份羊肉烩面", "price": 17.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "热炕头东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "大拉皮+地三鲜+韭菜炒鸡蛋", "price": 63.00 }
                ]
            }
        ],
        "2025-04-08": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "支",
                "note": "八百里秦味(周浦万达店)",
                "items": [
                    { "name": "大碗油泼面", "price": 19.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "100%橙汁 1L/瓶", "price": 19.90 }
                ]
            }
        ],
        "2025-04-09": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "白切牛肉刀削面", "price": 14.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "谷田稻香（周浦万达店）",
                "items": [
                    { "name": "排骨煲+西蓝花+米饭+益生菌", "price": 43.90 }
                ]
            }
        ],
        "2025-04-10": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "青藏小伙牦牛骨汤牛肉面",
                "items": [
                    { "name": "土豆牛肉饭", "price": 26.00 }
                ]
            }, {
                "shop": "支",
                "note": "东北风（周浦万达店）",
                "items": [
                    { "name": "酸辣土豆丝+锅包肉+韭菜盒子", "price": 70.00 }
                ]
            }
        ],
        "2025-04-11": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "叶黄素+维生素D3鸡蛋15枚*2", "price": 29.91 },
                    { "name": "娃哈哈纯净水 5.5L*4桶", "price": 26.59 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "康师傅鲜虾鱼板面桶面101g", "price": 4.06 },
                    { "name": "康师傅香辣牛肉拌面碗面127g", "price": 5.27 },
                    { "name": "康师傅老陈醋酸辣牛肉面110g*5袋", "price": 12.07 },
                    { "name": "三养泡菜汤面104g*5", "price": 19.90 },
                    { "name": "蓝月亮Q厕宝自动冲洗洁厕剂50g", "price": 0.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "烤包子", "price": 7.00 },
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "支",
                "note": "避风塘(周浦万达店)",
                "items": [
                    { "name": "港式金蒜双人餐：藤椒虾+叉烧+咖喱鸡+红薯条", "price": 99.00 }
                ]
            }, {
                "shop": "支",
                "note": "桂桂茶(上海周浦万达广场店)",
                "items": [
                    { "name": "招牌冻柠茶", "price": 16.00 },
                    { "name": "丝袜奶茶", "price": 15.00 }
                ]
            }
        ],
        "2025-04-12": [
            {
                "shop": "盒马",
                "items": [
                    { "name": "耐米鸡腿香草味雪糕", "price": 7.90 },
                    { "name": "进口365熟甜香蕉1kg", "price": 9.90 },
                    { "name": "现烤奥尔良大鸡腿3个", "price": 26.90 }
                ]
            }, {
                "shop": "微信",
                "note": "米村拌饭(航头浦乐汇店)",
                "items": [
                    { "name": "经典三杯鸡", "price": 26.90 },
                    { "name": "石板肉酱豆腐", "price": 21.90 }
                ]
            }, {
                "shop": "京东",
                "note": "Dettol滴露京东自营旗舰店",
                "items": [
                    { "name": "滴露【迪士尼限定】茉莉绿茶香500g", "price": 6.63 }
                ]
            }, {
                "shop": "京东",
                "note": "得宝京东自营旗舰店",
                "items": [
                    { "name": "德宝4层80抽4包太阳花小雏菊系列", "price": 4.50 }
                ]
            }
        ],
        "2025-04-13": [
            {
                "shop": "美团",
                "note": "谷香稻田上海金航城店",
                "items": [
                    { "name": "酸辣鸡胗+蒸蛋+素排+米饭", "price": 24.51 }
                ]
            }, {
                "shop": "叮咚",
                "items": [
                    { "name": "菲律宾凤梨1个1kg", "price": 19.90 }
                ]
            }
        ],
        "2025-04-14": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "酸菜牛肉面", "price": 18.00 }
                ]
            }, {
                "shop": "美团",
                "note": "塔哈尔周浦万达店",
                "items": [
                    { "name": "沙湾大盘走地鸡(配手工皮带面)", "price": 84.90 }
                ]
            }
        ],
        "2025-04-15": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "中国兰州拉面康沈路店",
                "items": [
                    { "name": "牛肉炒刀削面", "price": 18.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "羊肉烩面", "price": 17.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "养乐多原味活菌型乳酸菌饮品100ml*5瓶", "price": 12.80 },
                    { "name": "MILKDOG每一克4.0有机厚酸奶400g", "price": 9.90 }
                ]
            }, {
                "shop": "美团",
                "note": "热炕头·东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "青椒炒土豆丝", "price": 14.99 },
                    { "name": "酸菜粉", "price": 25.08 },
                    { "name": "东北大拉皮", "price": 21.73 },
                    { "name": "哈尔滨红肠", "price": 14.04 },
                    { "name": "打包费", "price": 4.00 }
                ]
            }
        ],
        "2025-04-16": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "巡面(上海松江车墩店)",
                "items": [
                    { "name": "招牌肉酱拌面", "price": 16.00 },
                    { "name": "农夫山泉", "price": 2.00 }
                ]
            }, {
                "shop": "美团",
                "note": "小菜园新徽菜(上海周浦万达店)",
                "items": [
                    { "name": "园园子经典四人餐(地锅本仔鸡+金汤肥牛+菠萝鸡米花+手工酱萝卜+香锅开心花菜+青桔柠檬汁+红糖发糕(6块)+餐巾纸", "price": 178.75 }
                ]
            }
        ],
        "2025-04-17": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "李老哈·东北菜(长阳创谷店)",
                "items": [
                    { "name": "东北酸菜粉", "price": 15.30 },
                    { "name": "米饭", "price": 0.70 },
                    { "name": "打包费", "price": 2.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 午餐", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "小杨生煎(周浦万达店)",
                "items": [
                    { "name": "荠菜小杨双拼+老鸭粉丝汤", "price": 24.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "【黑猪肉>80%】锋味派原味黑猪肉爆汁烤肠200g(4根) ", "price": 18.90 },
                    { "name": "小象内蒙古河套平原雪花粉2kg", "price": 25.80 },
                    { "name": "【无抗】可生食鲜鸡蛋20枚1kg", "price": 21.90 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }
        ],
        "2025-04-18": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "美团",
                "note": "周潮發·沙茶鲜牛肉火锅(金航城店)",
                "items": [
                    { "name": "牛骨鲜汤锅+吊龙+腱子肉+精选牛腿肉+黑虎虾丸+牛肉熟丸", "price": 198.00 }
                ]
            }
        ],
        "2025-04-19": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌康恒路", "price": 8.00 }
                ]
            }, {
                "shop": "美团",
                "note": "老乡鸡(上海金航城店)",
                "items": [
                    { "name": "毛豆烧鸡+小炒肉+西红柿鸡蛋+红烧茄子+2份米饭", "price": 43.60 }
                ]
            }, {
                "shop": "美团",
                "note": "小杨生煎(周浦哈邻里店)",
                "items": [
                    { "name": "荠菜藤椒大虾小杨三拼生煎+排骨年糕+老鸭粉丝汤+酸辣粉", "price": 48.90 },
                    { "name": "无糖可口可乐", "price": 5.00 },
                    { "name": "雪碧", "price": 4.00 }
                ]
            }, {
                "shop": "微信",
                "note": "有巢(春心当young市集)",
                "items": [
                    { "name": "一串面筋+两个鸡爪+一个鸡架+一串丸子", "price": 10.00 }
                ]
            }
        ],
        "2025-04-20": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "德芙脆香米牛奶巧克力120g", "price": 15.71 },
                    { "name": "农夫山泉桶装水 5L*4桶", "price": 31.60 }
                ]
            }, {
                "shop": "美团",
                "note": "大米先生(浦东航头店)",
                "items": [
                    { "name": "茄子豆角+青椒土豆丝+菌香小煎鸡+白米饭+益生菌", "price": 25.90 },
                    { "name": "配送费", "price": 0.01 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐", "price": 10.00 }
                ]
            }

        ],
        "2025-04-21": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 午餐", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "鸡蛋刀削面", "price": 13.00 }
                ]
            }, {
                "shop": "美团",
                "note": "小杨生煎(周浦哈邻里店)",
                "items": [
                    { "name": "虾肉生煎包4个+里脊肉串2个+酸辣粉", "price": 32.00 },
                    { "name": "配送费", "price": 3.40 }
                ]
            }
        ],
        "2025-04-22": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 午餐", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "青藏小伙牦牛骨汤牛肉面黄兴路店",
                "items": [
                    { "name": "番茄鸡蛋饭", "price": 22.00 }
                ]
            }, {
                "shop": "美团",
                "note": "谷田稻香(上海金航城店)",
                "items": [
                    { "name": "酸辣鸡胗+五香素排+蒸蛋+米饭", "price": 24.50 },
                    { "name": "打包费", "price": 0.01 }
                ]
            }, {
                "shop": "微信",
                "note": "四季水果",
                "items": [
                    { "name": "一个大西瓜", "price": 28.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海市东方医院(同济大学附属东方医院)南院",
                "items": [
                    { "name": "体检费(一般健康体检)", "price": 328.00 }
                ]
            }, {
                "shop": "京东",
                "note": "宝洁京东自营旗舰店",
                "items": [
                    { "name": "护舒宝瞬洁云感卫生巾日夜84片 240mm 60片+加长16+夜用8", "price": 43.39 }
                ]
            }
        ],
        "2025-04-23": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "鸡蛋炒面", "price": 22.00 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "劲丰博士牛筋味240g", "price": 9.90 },
                    { "name": "MILKDOG每一克0蔗糖8.0希腊酸奶400g", "price": 12.90 },
                    { "name": "【无抗】可生食鲜鸡蛋20枚1kg", "price": 21.90 },
                    { "name": "蓝月亮旅行洗衣液(白兰香)80g", "price": 0.00 }
                ]
            }, {
                "shop": "微信",
                "note": "朴大叔拌饭(上海浦东金航城店)",
                "items": [
                    { "name": "镪焖明太鱼", "price": 29.90 },
                    { "name": "石板肉酱茄子", "price": 23.90 }
                ]
            }, {
                "shop": "微信",
                "note": "向正烧记(浦东金航城店)",
                "items": [
                    { "name": "一个猪脚+一串面筋+一根火腿肠", "price": 21.00 }
                ]
            }, {
                "shop": "京东",
                "note": "邦尼世家京东自营旗舰店",
                "items": [
                    { "name": "邦尼世家2双装运动鞋垫 软弹减震 43-44码", "price": 18.28 }
                ]
            }
        ],
        "2025-04-24": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "麦香阁纯汤牛肉面",
                "items": [
                    { "name": "土豆烧牛肉拌面", "price": 19.00 }
                ]
            }, {
                "shop": "支",
                "note": "韩记红烧牛肉面",
                "items": [
                    { "name": "小份羊肉烩面", "price": 17.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "热炕头东北菜铁锅炖(金航城店)",
                "items": [
                    { "name": "小鸡炖蘑菇+地三鲜+米饭2份", "price": 59.18 }
                ]
            }, {
                "shop": "微信",
                "note": "上海市东方医院(同济大学附属东方医院)南院",
                "items": [
                    { "name": "挂号费", "price": 18.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海市东方医院(同济大学附属东方医院)南院",
                "items": [
                    { "name": "化验费 血细胞分析(三分类以上)", "price": 20.00 },
                    { "name": "检查费 心脏彩色多普勒超声", "price": 170.00 },
                    { "name": "检查费 左心功能测定", "price": 55.00 },
                    { "name": "检查费 组织彩普勒显象(TDI)", "price": 40.00 },
                    { "name": "检查费 电脑多导联心电图(检查)", "price": 35.00 },
                ]
            }, {
                "shop": "京东",
                "note": "花王(KAO)京东自营专区>",
                "items": [
                    { "name": "花王牙膏 165g 1支", "price": 7.19 }
                ]
            }
        ],
        "2025-04-25": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "谷田稻香(滨江百联店)",
                "items": [
                    { "name": "肉末茄子+稻花香瓦锅饭", "price": 17.90 }
                ]
            }, {
                "shop": "美团",
                "note": "汉堡王(上海金航广场30635店)",
                "items": [
                    { "name": "芝士牛堡+鸡米花+可乐300ml*2+鸡腿小皇堡", "price": 26.90 }
                ]
            }
        ],
        "2025-04-26": [
            {
                "shop": "美团",
                "note": "大米先生(浦东航头店)",
                "items": [
                    { "name": "米饭*3+三杯鸡+菠萝咕咾肉+青椒鸡丁+清炒时蔬+青椒土豆豆腐+芙蓉炖蛋+乳酸菌+玉米汤", "price": 59.91 }
                ]
            }, {
                "shop": "小象",
                "items": [
                    { "name": "秋林里道斯红肠110g", "price": 15.90 },
                    { "name": "光明优倍有机高品质鲜牛奶950ml", "price": 21.90 }
                ]
            }, {
                "shop": "美团",
                "note": "杨国福麻辣烫·麻辣拌(金航城店)",
                "items": [
                    { "name": "【随心选】23选10优惠套餐", "price": 19.44 }
                ]
            }, {
                "shop": "美团",
                "note": "杨国福麻辣烫·麻辣拌(金航城店)",
                "items": [
                    { "name": "【杨国福力荐】横扫饥饿单人餐", "price": 17.46 }
                ]
            }
        ],
        "2025-04-27": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "支",
                "note": "蘭德香兰州牛肉面上海眉州支路店",
                "items": [
                    { "name": "牛肉刀削面", "price": 15.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 午餐", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "美团",
                "note": "鱼你在一起(上海浦东金航城店)",
                "items": [
                    { "name": "青花椒酸菜巴沙鱼+米饭", "price": 22.90 },
                    { "name": "配送费", "price": 0.01 }
                ]
            }

        ],
        "2025-04-28": [
            {
                "shop": "支",
                "note": "上海公共交通卡股份有限公司",
                "items": [
                    { "name": "上海地铁-鹤涛路⇌宁国路", "price": 10.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海浦东土控资产经营有限公司",
                "items": [
                    { "name": "固定租金(2025/05/01-2025/05/25)上海兴利开发有限公司", "price": 1954.00 }
                ]
            }, {
                "shop": "美团",
                "note": "喜家德虾仁水饺(互联宝地店)",
                "items": [
                    { "name": "喜三鲜水饺+杨梅汁", "price": 35.00 }
                ]
            }, {
                "shop": "微信",
                "note": "上海宜家家居有限公司浦东分公司北蔡商场",
                "items": [
                    { "name": "宜家兼职员工餐 晚餐", "price": 10.00 }
                ]
            }, {
                "shop": "饿了",
                "note": "小满手工粉(上海金航城店)",
                "items": [
                    { "name": "贵州红酸汤牛肉粉", "price": 21.90 }
                ]
            }, {
                "shop": "饿了",
                "note": "读酥世家(上海金航城店)",
                "items": [
                    { "name": "黄油年糕6个", "price": 12.50 },
                    { "name": "桃酥6片", "price": 11.00 },
                    { "name": "配送费", "price": 0.50 }
                ]
            }

        ],
        "2025-04-29": [

        ],



    };


    // 计算每条消费记录的总金额（每项消费的金额为商品价格之和）
    function calculateAmounts() {
        for (const date in expensesData) {
            expensesData[date].forEach(record => {
                // 计算每项消费的金额
                record.totalAmount = parseFloat(record.items.reduce((sum, item) => sum + item.price, 0).toFixed(2)); // 保留两位小数
            });
        }
    }

    // 调用calculateAmounts函数来计算每条消费记录的总金额
    calculateAmounts();

    // 关闭弹窗函数
    const closeModal = function () {
        modal.style.display = "none";
    };

    // 点击弹窗关闭按钮
    modalClose.onclick = function () {
        closeModal();
    };

    // 点击窗口外部区域时也关闭窗口
    window.addEventListener("click", function (event) {
        if (event.target === modal) {
            closeModal();
        }
    });

    // 计算指定年份的总消费
    function calculateTotalExpenditure() {
        const selectedYear = parseInt(yearSelect.value);
        let total = 0;

        Object.keys(expensesData).forEach(date => {
            if (date.startsWith(selectedYear.toString())) {
                expensesData[date].forEach(entry => {
                    total += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                });
            }
        });

        totalExpenditureDisplay.innerHTML = `<a href="#" onclick="showYearDetails(${selectedYear})">${selectedYear}年 总消费：￥${total.toFixed(2)}</a>`; // 保留两位小数
    }

    // 计算指定月份的总消费金额
    function calculateMonthlyTotal(year, month) {
        const monthStr = `${year}-${month.toString().padStart(2, '0')}`;
        let total = 0;

        Object.keys(expensesData).forEach(date => {
            if (date.startsWith(monthStr)) {
                expensesData[date].forEach(entry => {
                    total += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                });
            }
        });

        return parseFloat(total.toFixed(2)); // 保留两位小数
    }

    // 提取当前月份的数据
    function getMonthlyData(year, month) {
        const days = [];
        const dailyTotals = [];

        const lastDay = new Date(year, month, 0).getDate(); // 当月的最后一天

        for (let day = 1; day <= lastDay; day++) {
            const dateStr = `${year}-${month.toString().padStart(2, '0')}-${day.toString().padStart(2, '0')}`;
            const dailyExpenses = expensesData[dateStr] || []; // 当天消费记录

            // 计算当天总消费金额
            const dailyTotal = dailyExpenses.length > 0
                ? dailyExpenses.reduce((sum, entry) => sum + entry.totalAmount, 0).toFixed(2)
                : 0;

            days.push(day); // 添加日期到 X 轴
            dailyTotals.push(dailyTotal); // 添加消费金额到 Y 轴
        }

        return { days, dailyTotals };
    }

    let chartInstance = null; // 用于保存 Chart.js 实例

    // 修改 renderCalendar，加入图表更新逻辑
    function renderCalendar() {
        const year = parseInt(yearSelect.value);
        const month = parseInt(monthSelect.value);
        const lastDay = new Date(year, month, 0).getDate();
        const monthlyTotal = calculateMonthlyTotal(year, month);

        // 动态生成表格 HTML
        let htmlString = `
                        <table class='calendar'>
                        <tr>
                            <th colspan="7">
                                <button id="prev-month" aria-label="上一月">上一月</button>
                                ${year}年${month}月 总消费：￥${monthlyTotal}
                                <button id="next-month" aria-label="下一月">下一月</button>
                            </th>
                        </tr>
                        <tr>
                            <th>日</th><th>一</th><th>二</th><th>三</th><th>四</th><th>五</th><th>六</th>
                        </tr>
                        <tr>`;

        // 补齐月初空白
        let weekDay = new Date(year, month - 1, 1).getDay();
        for (let i = 0; i < weekDay; i++) htmlString += "<td>-</td>";

        // 填充每一天
        for (let day = 1; day <= lastDay; day++) {
            const dateStr = `${year}-${month.toString().padStart(2, '0')}-${day.toString().padStart(2, '0')}`;
            const dailyExpenses = expensesData[dateStr] || [];
            const dailyTotal = dailyExpenses.length > 0
                ? dailyExpenses.reduce((sum, entry) => sum + entry.totalAmount, 0).toFixed(2)
                : "-";

            htmlString += `<td>
                           <a href="#" class="day-cell" onclick="showDetails('${dateStr}')">${day}</a>
                           <div class="daily-expense">${dailyTotal}</div>
                           </td>`;

            if ((weekDay + day) % 7 === 0) htmlString += "</tr><tr>";
        }

        // 补齐月末空白
        htmlString += "</tr></table>";
        calendarContainer.innerHTML = htmlString;

        // 添加上一月和下一月按钮的事件监听
        document.getElementById("prev-month").onclick = function () {
            let newYear = year;
            let newMonth = month - 1;
            if (newMonth === 0) {
                newMonth = 12;
                newYear -= 1;
            }
            if (newYear >= 2023 && newYear <= 2025) {
                yearSelect.value = newYear;
                monthSelect.value = newMonth;
                renderCalendar();
                calculateTotalExpenditure();
            }
        };

        document.getElementById("next-month").onclick = function () {
            let newYear = year;
            let newMonth = month + 1;
            if (newMonth === 13) {
                newMonth = 1;
                newYear += 1;
            }
            if (newYear >= 2023 && newYear <= 2025) {
                yearSelect.value = newYear;
                monthSelect.value = newMonth;
                renderCalendar();
                calculateTotalExpenditure();
            }
        };

        // 获取数据并渲染图表
        const { days, dailyTotals } = getMonthlyData(year, month);
        renderChart(days, dailyTotals);
    }

    // 绘制柱状图
    function renderChart(days, totals) {
        const ctx = document.getElementById("monthlyChart").getContext("2d");

        // 获取当前选择的年份和月份
        const year = parseInt(yearSelect.value);
        const month = parseInt(monthSelect.value);
        const label = `${year}年${month}月 每日消费金额 (元)`; // 动态生成的标签

        // 如果图表实例已存在，则销毁重新绘制
        if (chartInstance) {
            chartInstance.destroy();
        }

        chartInstance = new Chart(ctx, {
            type: "bar",
            data: {
                labels: days, // x 轴：日期
                datasets: [
                    {
                        label: label, // 使用动态生成的标签
                        data: totals, // y 轴：消费金额
                        backgroundColor: "rgba(75, 192, 192, 0.2)",
                        borderColor: "rgba(75, 192, 192, 1)",
                        borderWidth: 1,
                        // categoryPercentage: 0.6, // 控制柱子宽度占整个类别的比例
                        barPercentage: 0.7, // 控制柱子在类别内的占比
                    },
                ],
            },
            options: {
                responsive: true,
                maintainAspectRatio: false,
                scales: {
                    y: {
                        beginAtZero: true,
                    },
                    x: {
                        grid: {
                            display: false, // 禁用横轴网格线
                        },
                    },
                },
                plugins: {
                    legend: {
                        display: true,
                        position: "top",
                        labels: {
                            boxWidth: 20, // 小图块的宽度
                            boxHeight: 6, // 小图块的高度
                            padding: 10, // 图例项与图块之间的间距
                        },
                    },
                },
            },
        });
    }

    // 函数：显示注释
    function showNote(event, note) {
        // 创建注释的弹出层
        const notePopup = document.createElement('div');
        notePopup.classList.add('note-popup');
        notePopup.innerHTML = note;

        // 计算点击平台名的位置
        const rect = event.target.getBoundingClientRect();
        notePopup.style.top = `${rect.bottom + window.scrollY + 10}px`;  // 显示在平台名的下方
        notePopup.style.left = `${rect.left + window.scrollX}px`;  // 显示在平台名的左边

        // 将注释弹窗添加到页面
        document.body.appendChild(notePopup);

        // 设置 2 秒后自动关闭
        const closeTimeout = setTimeout(() => {
            notePopup.remove();
        }, 2000);

        // 点击其他地方关闭注释
        document.addEventListener('click', function closePopup(event) {
            // 检查点击是否在弹窗外部
            if (!notePopup.contains(event.target) && !event.target.closest('.platform-link')) {
                notePopup.remove();  // 移除注释
                clearTimeout(closeTimeout);  // 清除自动关闭的计时器
                document.removeEventListener('click', closePopup);  // 移除关闭事件监听
            }
        });
    }

    // 显示消费详情
    window.showDetails = function (dateStr) {
        const modal = document.getElementById("modal");
        const modalDetails = document.getElementById("modal-details");
        modal.style.display = "block";

        const details = expensesData[dateStr];
        if (details) {
            let contentHTML = `<h3>${dateStr} 总消费：￥${details.reduce((sum, d) => sum + d.totalAmount, 0).toFixed(2)}</h3>`;
            contentHTML += `<table class="modal-table"><thead><tr><th>平台</th><th>总计</th><th>商品</th><th>实付</th></tr></thead><tbody>`;

            details.forEach(d => {
                let platformHTML = d.shop;
                if (d.note) {  // 如果平台有注释，平台名变为链接
                    platformHTML = `<a href="#" class="platform-link" data-note="${d.note}">${d.shop}</a>`;
                }

                contentHTML += `<tr class="platform-row">
                                <td rowspan="${d.items.length}" class="platform-cell">
                                    ${platformHTML}
                                </td>
                                <td rowspan="${d.items.length}" class="platform-amount">￥${d.totalAmount.toFixed(2)}</td>
                                <td class="product-name">${d.items[0].name}</td>
                                <td class="product-amount">￥${d.items[0].price.toFixed(2)}</td>
                            </tr>`;

                for (let i = 1; i < d.items.length; i++) {
                    contentHTML += `<tr class="product-row">
                                    <td class="product-name">${d.items[i].name}</td>
                                    <td class="product-amount">￥${d.items[i].price.toFixed(2)}</td>
                                </tr>`;
                }
            });

            contentHTML += `</tbody></table>`;
            modalDetails.innerHTML = contentHTML;

            // 为每个链接添加点击事件，显示对应的 note
            const platformLinks = document.querySelectorAll('.platform-link');
            platformLinks.forEach(link => {
                link.addEventListener('click', function (event) {
                    event.preventDefault();  // 防止链接跳转
                    const note = this.getAttribute('data-note');
                    showNote(event, note);  // 调用 showNote 函数显示注释
                });
            });
        } else {
            modalDetails.innerHTML = `<p>无消费记录。</p>`;
        }
    };

    // 点击年份总消费超链接显示该年份每个月的消费详情
    window.showYearDetails = function (year) {
        modal.style.display = "block";
        let totalYearlyExpenditure = 0;
        let monthlyExpenditures = [];
        let monthDataHTML = `<h3>
                            <button id="prev-year" aria-label="上一年">←</button>
                            ${year}年 总消费：`;

        // 收集每个月的总消费
        for (let month = 1; month <= 12; month++) {
            const monthStr = `${year}-${month.toString().padStart(2, '0')}`;
            let monthlyTotal = 0;

            // 遍历所有消费记录，计算每个月的消费总金额
            Object.keys(expensesData).forEach(date => {
                if (date.startsWith(monthStr)) {
                    expensesData[date].forEach(entry => {
                        monthlyTotal += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                    });
                }
            });

            // 将每个月的消费金额加入数组
            monthlyExpenditures.push(monthlyTotal);
            totalYearlyExpenditure += monthlyTotal;
        }

        // 更新年总消费金额
        monthDataHTML += `￥${totalYearlyExpenditure.toFixed(2)}
                         <button id="next-year" aria-label="下一年">→</button>
                         </h3>`; // 保留两位小数
        monthDataHTML += `<table border="1" style="width:100%; margin-top:10px;">
                          <tr><th>月份</th><th>总消费金额</th></tr>`;

        // 生成每个月消费的表格
        for (let month = 1; month <= 12; month++) {
            const monthlyTotal = monthlyExpenditures[month - 1];
            monthDataHTML += `<tr>
                              <td><a href="#" onclick="selectMonth(${year}, ${month})">${month}月</a></td>
                              <td>￥${monthlyTotal.toFixed(2)}</td> <!-- 保留两位小数 -->
                              </tr>`;
        }

        monthDataHTML += `</table>`;

        // 添加图表显示区域
        monthDataHTML += `<div>
                          <canvas id="yearlyChart" width="400" height="200"></canvas>
                          </div>`;

        modalDetails.innerHTML = monthDataHTML;

        // 渲染图表
        renderYearlyChart(year, monthlyExpenditures);

        // 添加上一年和下一年按钮的事件监听
        document.getElementById("prev-year").onclick = function () {
            showYearDetails(year - 1); // 显示上一年的消费详情
        };

        document.getElementById("next-year").onclick = function () {
            showYearDetails(year + 1); // 显示下一年的消费详情
        };
    };

    // 渲染图表
    function renderYearlyChart(year, monthlyExpenditures) {
        const ctx = document.getElementById("yearlyChart").getContext("2d");

        // 如果已有图表实例，销毁它再创建一个新图表
        if (window.yearlyChartInstance) {
            window.yearlyChartInstance.destroy();
        }

        window.yearlyChartInstance = new Chart(ctx, {
            type: 'bar',
            data: {
                labels: ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'], // 月份
                datasets: [{
                    label: `${year}年 每月总消费 (元)`, // 图表的标签
                    data: monthlyExpenditures, // 每个月的消费金额
                    backgroundColor: "rgba(75, 192, 192, 0.2)",
                    borderColor: "rgba(75, 192, 192, 1)",
                    borderWidth: 1,
                }]
            },
            options: {
                responsive: true,
                maintainAspectRatio: false,
                scales: {
                    y: {
                        beginAtZero: true,
                        ticks: {
                            callback: function (value) {
                                return `￥${value.toFixed(2)}`; // 格式化 y 轴标签，显示为人民币
                            }
                        }
                    },
                    x: {
                        grid: {
                            display: false, // 隐藏 x 轴的网格线
                        },
                    },
                },
                plugins: {
                    legend: {
                        display: true,
                        position: "top",
                        labels: {
                            boxWidth: 20,
                            boxHeight: 6,
                            padding: 10,
                        }
                    }
                }
            }
        });
    }

    window.selectMonth = function (year, month) {
        modal.style.display = "none";
        yearSelect.value = year;
        monthSelect.value = month;
        renderCalendar();
        calculateTotalExpenditure();
    };

    // 关闭弹窗
    modalClose.onclick = function () {
        modal.style.display = "none";
    };

    // 切换年份或月份时重新渲染
    yearSelect.onchange = function () {
        renderCalendar();
        calculateTotalExpenditure();
    };

    monthSelect.onchange = function () {
        renderCalendar();
    };

    function initializeYearAndMonthOptions() {
        const years = [2022, 2023, 2024, 2025, 2026];
        const months = Array.from({ length: 12 }, (_, i) => i + 1);

        years.forEach(year => {
            const option = document.createElement("option");
            option.value = year;
            option.textContent = `${year}年`;
            yearSelect.appendChild(option);
        });

        months.forEach(month => {
            const option = document.createElement("option");
            option.value = month;
            option.textContent = `${month}月`;
            monthSelect.appendChild(option);
        });

        // 获取当前年份和月份
        const currentDate = new Date();
        const currentYear = currentDate.getFullYear();
        const currentMonth = currentDate.getMonth() + 1; // getMonth() 返回的月份是从 0 开始的，所以需要加 1

        // 设置年份和月份选择框的默认值为当前年份和月份
        yearSelect.value = currentYear;
        monthSelect.value = currentMonth;
    }

    initializeYearAndMonthOptions();
    renderCalendar();
    calculateTotalExpenditure();
});
