document.addEventListener("DOMContentLoaded", function () {
    const calendarContainer = document.getElementById("calendar-container");
    const modal = document.getElementById("modal");
    const modalDetails = document.getElementById("modal-details");
    const modalClose = document.getElementById("modal-close");
    const yearSelect = document.getElementById("year");
    const monthSelect = document.getElementById("month");
    const totalExpenditureDisplay = document.getElementById("total-expenditure");
    const prevMonthButton = document.getElementById("prev-month");
    const nextMonthButton = document.getElementById("next-month");

    // 示例数据
    const expensesData = {
        "2024-01-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "手擀面", "price": 2.51 },
                    { "name": "鸡胸肉", "price": 3.74 },
                    { "name": "杏鲍菇", "price": 2.54 },
                    { "name": "鸡翅中", "price": 11.91 },
                    { "name": "大葱", "price": 1.97 },
                    { "name": "五香干", "price": 2.33 },
                    { "name": "大蒜", "price": 4.24 }
                ]
            }
        ],
        "2024-01-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "宽面", "price": 3.13 },
                    { "name": "老干妈", "price": 11.97 },
                    { "name": "白象方便面", "price": 11.97 },
                    { "name": "挂面", "price": 7.15 },
                    { "name": "鸡蛋", "price": 14.88 },
                    { "name": "小葱", "price": 0.00 }
                ]
            }
        ],
        "2024-01-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "皱皮辣椒", "price": 2.64 },
                    { "name": "撒尿牛丸", "price": 17.49 },
                    { "name": "大白菜", "price": 2.64 },
                    { "name": "大葱", "price": 2.46 },
                    { "name": "土豆", "price": 3.25 }
                ]
            }
        ],
        "2024-02-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "呷哺蘸料", "price": 3.70 },
                    { "name": "土鸡蛋", "price": 0.00 },
                    { "name": "叮咚牛肉酱", "price": 3.20 },
                    { "name": "海底捞蘸料", "price": 3.70 },
                    { "name": "冷冻肥牛卷", "price": 27.15 }
                ]
            }
        ],
        "2024-02-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "西兰花", "price": 5.19 },
                    { "name": "番茄", "price": 6.29 },
                    { "name": "土鸡蛋", "price": 0.00 },
                    { "name": "香糟凤爪", "price": 11.94 },
                    { "name": "虎皮凤爪", "price": 11.88 },
                    { "name": "螺丝椒", "price": 4.19 }
                ]
            }
        ],
        "2024-02-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "水磨糯米粉", "price": 11.61 },
                    { "name": "三全牛肉大葱水饺", "price": 7.66 },
                    { "name": "三全大黄米黑芝麻汤圆", "price": 6.67 },
                    { "name": "旺仔复原乳牛奶", "price": 9.89 },
                    { "name": "娃哈哈AD钙奶", "price": 8.50 },
                    { "name": "思念手打天下姬松茸素三鲜水饺", "price": 14.33 },
                    { "name": "新西兰小公牛天萃庭冷鲜牛腩", "price": 27.13 },
                    { "name": "皱皮青椒", "price": 2.71 },
                    { "name": "新土豆", "price": 4.16 },
                    { "name": "优质番茄", "price": 5.61 },
                    { "name": "海南皱皮蜜宝红心火龙果", "price": 13.52 },
                    { "name": "有豆志手工攸县香干", "price": 4.80 },
                    { "name": "有豆志中百页", "price": 4.99 },
                    { "name": "去根松花菜", "price": 3.53 },
                    { "name": "正大优选鸭腿", "price": 9.89 },
                    { "name": "深海大虾", "price": 10.85 },
                    { "name": "一点小葱", "price": 0.00 }
                ]
            }
        ],
        "2024-02-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水", "price": 23.40 }
                ]
            },
            {
                "shop": "叮咚",
                "items": [
                    { "name": "思念大黄米小小汤圆", "price": 12.90 },
                    { "name": "蒙牛低脂高钙风味酸牛奶", "price": 14.90 },
                    { "name": "海底捞火锅蘸料原味", "price": 7.90 },
                    { "name": "去根松花菜", "price": 4.19 }
                ]
            }
        ],
        "2024-02-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "非转基因大豆有豆志中百页", "price": 5.50 },
                    { "name": "三红胡萝卜", "price": 2.19 },
                    { "name": "北大荒有机酸菜丝", "price": 12.50 },
                    { "name": "白萝卜", "price": 2.99 },
                    { "name": "大白菜", "price": 3.99 },
                    { "name": "新土豆", "price": 4.79 },
                    { "name": "优质番茄", "price": 5.89 },
                    { "name": "老姜", "price": 5.79 },
                    { "name": "统一汤达人酸酸辣辣豚骨拉面", "price": 19.90 },
                    { "name": "精选冷冻肥牛卷", "price": 28.53 },
                    { "name": "白象招牌猪骨汤面", "price": 13.90 },
                    { "name": "无抗保洁鲜鸡蛋", "price": 17.97 },
                    { "name": "统一老坛酸菜面", "price": 12.50 },
                    { "name": "叮咚好食汇红薯粉条", "price": 12.90 },
                    { "name": "杏鲍菇", "price": 3.29 },
                    { "name": "大葱", "price": 3.49 }
                ]
            }
        ],
        "2024-03-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "动物奶油牛奶萌萌软蛋糕", "price": 9.90 },
                    { "name": "金锣肉粒多特级火腿肠", "price": 10.90 },
                    { "name": "超值番茄", "price": 8.99 },
                    { "name": "陈克明鸡蛋龙须挂面", "price": 6.90 },
                    { "name": "精选冷冻肥牛卷", "price": 15.80 },
                    { "name": "怡宝纯净水", "price": 23.40 }
                ]
            }
        ],
        "2024-03-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "西兰花 约600g", "price": 5.49 },
                    { "name": "火锅蘸酱 叮咚定制川崎瑶柱香菇酱 80g/袋", "price": 2.90 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "鲜活净化黑鱼1条 约550g", "price": 14.90 },
                    { "name": "螺丝椒 约300g", "price": 4.39 }
                ]
            }
        ],
        "2024-03-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "良芯匠人土豆粉 180g/袋", "price": 0.00 },
                    { "name": "大葱 约500g", "price": 3.28 },
                    { "name": "紫皮大蒜 约350g", "price": 5.63 },
                    { "name": "螺丝椒 约300g", "price": 4.13 },
                    { "name": "新土豆 约600g", "price": 2.62 },
                    { "name": "新鲜猪带肉汤骨（汤小排）约400g", "price": 7.23 },
                    { "name": "三红胡萝卜 约600g", "price": 1.68 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.62 },
                    { "name": "鲜鸡蛋30枚", "price": 20.60 },
                    { "name": "叮咚定制麦苗芋泥青青青糕 200g/份", "price": 10.16 },
                    { "name": "去根松花菜半颗 约500g", "price": 3.94 },
                    { "name": "小米椒 约50g", "price": 1.92 }
                ]
            }
        ],
        "2024-03-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "白象辣牛肉汤面 111.5g*5/袋", "price": 13.04 },
                    { "name": "白象招牌猪骨汤面 106g*5/袋", "price": 13.98 },
                    { "name": "统一老坛酸菜面 121g*5袋/包 (2包)", "price": 18.77 },
                    { "name": "叮咚买菜×农夫山泉桶装水 5L/桶", "price": 7.97 },
                    { "name": "内蒙羔羊肉卷 200g", "price": 12.39 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 15.86 },
                    { "name": "冷鲜小白鲳鱼 4条 300g", "price": 9.89 }
                ]
            }
        ],
        "2024-03-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "迷你甜甜圈 100g", "price": 5.77 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.85 },
                    { "name": "一点小葱 20g", "price": 0.00 },
                    { "name": "三全猪肉芹菜水饺 1kg/袋", "price": 13.90 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 24.72 },
                    { "name": "全麦黑椒牛肉三明治 155g", "price": 12.13 },
                    { "name": "青菜 约500g", "price": 1.48 },
                    { "name": "进口香蕉 约900g", "price": 8.29 },
                    { "name": "优质番茄 约500g", "price": 3.62 }
                ]
            }
        ],
        "2024-03-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "有你一面手工日晒面 70g/袋", "price": 0.00 },
                    { "name": "紫皮大蒜 约350g", "price": 5.61 },
                    { "name": "大葱 约500g", "price": 3.27 },
                    { "name": "白象辣牛肉汤面 111.5g*5/袋", "price": 13.02 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.87 },
                    { "name": "鲜活更大只南美白对虾（基围虾）500g", "price": 41.81 },
                    { "name": "叮咚家美好空气炸锅纸 50张/盒", "price": 7.42 },
                    { "name": "有友凤爪（山椒味）160g", "price": 10.42 },
                    { "name": "统一老坛酸菜面 121g*5袋/包", "price": 9.41 }
                ]
            }
        ],
        "2024-03-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "澳洲无籽红提 约300g", "price": 9.45 },
                    { "name": "金锣肉粒多特级火腿肠 30g*9根/袋", "price": 10.40 },
                    { "name": "深海大虾 200g/袋", "price": 10.46 },
                    { "name": "蔡长青×久久丫虎皮凤爪 130g/盒", "price": 17.95 },
                    { "name": "会员5日卡", "price": 0.00 },
                    { "name": "伊利巧乐兹经典巧脆棒冰淇淋 75g*5支/盒", "price": 16.04 },
                    { "name": "叮咚定制四色火锅面 400g/袋", "price": 4.67 },
                    { "name": "蒙牛双拼果粒风味酸牛乳圆周杯 90g*8杯/组", "price": 12.31 },
                    { "name": "崇明青菜 350g/份", "price": 3.61 }
                ]
            }
        ],
        "2024-03-31": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 14.90 },
                    { "name": "西葫芦 650g/份", "price": 3.19 },
                    { "name": "去根松花菜半颗 约500g", "price": 4.29 },
                    { "name": "王守义十三香 45g/盒 (2盒)", "price": 7.80 },
                    { "name": "中粮家佳康精装冷鲜梅花肉丝 200g", "price": 7.49 }
                ]
            }
        ],
        "2024-04-03": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0.00 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.40 },
                    { "name": "皱皮青椒 约300g", "price": 2.89 }
                ]
            }
        ],
        "2024-04-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "中粮家佳康精装冷鲜梅花肉丝 200g", "price": 7.00 },
                    { "name": "大葱 约500g", "price": 3.26 },
                    { "name": "新土豆 约1kg", "price": 5.13 },
                    { "name": "有豆志山涧柴火豆腐 400g", "price": 6.36 },
                    { "name": "新鲜切块带筋猪蹄 约500g", "price": 22.26 },
                    { "name": "中粮家佳康精装冷鲜大排 420g", "price": 15.71 },
                    { "name": "新鲜猪小排 约400g", "price": 12.63 },
                    { "name": "伊利巧乐兹经典巧脆棒冰淇淋 75g*5支", "price": 14.82 },
                    { "name": "白萝卜 约1kg", "price": 0.00 }
                ]
            }
        ],
        "2024-04-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蟹味菇 150g/份", "price": 0.00 },
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 15.80 },
                    { "name": "有豆志薄百页 110g/份", "price": 5.09 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 26.50 },
                    { "name": "蒙牛低脂高钙风味酸牛奶 90g*16杯", "price": 14.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.40 },
                    { "name": "一点小葱 20g", "price": 0.00 }
                ]
            }
        ],
        "2024-04-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "白萝卜 约1kg", "price": 2.70 },
                    { "name": "双汇马可波罗特级火腿肠 250g/袋", "price": 9.04 },
                    { "name": "鲜活净化黑鱼1条 约550g", "price": 16.75 },
                    { "name": "青岛经典啤酒 500mL/罐 (2罐)", "price": 7.76 },
                    { "name": "双汇王中王优级火腿肠 400g/袋", "price": 12.11 },
                    { "name": "深海大虾 200g/袋", "price": 10.23 }
                ]
            }
        ],
        "2024-04-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三全牛肉大葱水饺 450g", "price": 11.80 },
                    { "name": "无泪大葱 约350g", "price": 0.00 },
                    { "name": "有豆志冻嫩豆腐 350g", "price": 6.29 },
                    { "name": "叮咚定制鲜奶提子雪糕 420g", "price": 15.84 },
                    { "name": "三全大黄米黑芝麻汤圆 400g", "price": 5.16 }
                ]
            }
        ],
        "2024-05-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 4.17 },
                    { "name": "有友凤爪（山椒味）160g", "price": 10.77 },
                    { "name": "有豆志中百页 150g", "price": 4.82 },
                    { "name": "螺丝椒 约300g", "price": 3.42 },
                    { "name": "严选精品新鲜猪后腿精肉 约300g", "price": 14.68 },
                    { "name": "思念珍味三鲜上汤小云吞 400g/袋", "price": 14.71 }
                ]
            }
        ],
        "2024-05-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "叮咚定制石磨花生酱（挤挤装）200g/袋", "price": 10.14 },
                    { "name": "蔡长青香糟凤爪 240g", "price": 14.82 },
                    { "name": "小米椒 约50g", "price": 0.00 },
                    { "name": "杨过一口生煎（15只）345g/袋", "price": 17.58 },
                    { "name": "坛坛乡精制小米椒 275g/瓶", "price": 7.90 },
                    { "name": "香菜 约100g", "price": 3.24 }
                ]
            }
        ],
        "2024-05-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 17.65 },
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "三红胡萝卜 约600g", "price": 1.86 },
                    { "name": "大葱 约500g", "price": 3.26 },
                    { "name": "秋浦河散养土鸡蛋10枚 400g", "price": 11.13 },
                    { "name": "白象招牌猪骨汤面 106g*5/袋", "price": 11.60 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 11.60 },
                    { "name": "统一老坛酸菜面 121g*5袋/包", "price": 11.15 },
                    { "name": "有豆志百页结 200g/份", "price": 3.29 },
                    { "name": "有豆志油豆腐 130g/份", "price": 2.29 },
                    { "name": "有豆志中百页 150g/份", "price": 3.87 },
                    { "name": "东海冰鲜小黄鱼 500g", "price": 10.07 }
                ]
            }
        ],
        "2024-05-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.30 }
                ]
            }
        ],
        "2024-05-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 5.49 },
                    { "name": "益客冷鲜鸡爪 400g", "price": 20.80 },
                    { "name": "蒙牛优益C活菌型乳酸菌饮品（原味）100mL*5/组", "price": 13.80 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "叮咚买菜×恒顺酿造白醋 500mL/瓶", "price": 5.20 },
                    { "name": "禾煜大料 50g/袋", "price": 7.92 },
                    { "name": "优选四川黄柠檬4个 500g/份", "price": 5.21 },
                    { "name": "禾煜桂皮 50g/袋", "price": 4.72 }
                ]
            }
        ],
        "2024-05-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "舟山海捕冷冻白鲳鱼（4-6条）350g", "price": 6.07 },
                    { "name": "三全鲜食番茄牛肉生饺子（18只）306g", "price": 9.41 },
                    { "name": "老干妈风味鸡油辣椒 280g/瓶", "price": 13.14 },
                    { "name": "俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0.00 },
                    { "name": "香葱 约50g", "price": 0.74 },
                    { "name": "小葱香菜双拼 40g", "price": 1.05 },
                    { "name": "山林大红肠 400g/袋", "price": 18.74 },
                    { "name": "崇明西葫芦 350g/份", "price": 2.62 },
                    { "name": "圣农汁汁嫩香鸡（奥尔良味）275g", "price": 9.37 },
                    { "name": "蒜苔 约300g", "price": 3.75 }
                ]
            }
        ],
        "2024-05-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "雪花清爽啤酒 330mL/罐", "price": 0.00 },
                    { "name": "优质番茄 约500g", "price": 4.59 },
                    { "name": "蔡长青脆脆皮炸鸡（整只）450g", "price": 24.50 },
                    { "name": "上好佳鲜虾片 40g/袋", "price": 4.30 },
                    { "name": "有友凤爪（山椒味）160g", "price": 12.00 }
                ]
            }
        ],
        "2024-05-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜活优养优饲虎背鲈鱼 约350g", "price": 13.50 },
                    { "name": "渔夫保罗生冻巴沙鱼柳 400g", "price": 10.90 },
                    { "name": "蒙牛优益C活菌型乳酸菌饮品（原味）100mL*5/组", "price": 13.80 },
                    { "name": "可口可乐 330mL/罐", "price": 0.00 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.79 },
                    { "name": "有豆志苏北锅香老豆腐 400g/份", "price": 5.90 },
                    { "name": "三全鲜食番茄牛肉生饺子（18只）306g", "price": 17.90 }
                ]
            }
        ],
        "2024-05-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【哈尔滨风味】俄瓦斯号哈尔滨风味红肠 50g/根", "price": 0 },
                    { "name": "迷你人参果 500g/份", "price": 12.50 },
                    { "name": "【平价】新鲜带皮五花肉 约300g", "price": 12.50 },
                    { "name": "老姜 约300g", "price": 6.99 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.79 },
                    { "name": "香葱 约50g", "price": 1.58 },
                    { "name": "螺丝椒 约300g", "price": 2.89 }
                ]
            }
        ],
        "2024-05-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【大枚蛋】土鸡蛋8枚 440g", "price": 6.51 },
                    { "name": "三红胡萝卜 约600g", "price": 0 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 13.75 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.17 },
                    { "name": "和路雪梦龙小青龙香烤碧根果口味冰淇淋 65g*4/盒", "price": 23.96 }
                ]
            }
        ],
        "2024-05-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蔡长青柠香泡椒去骨凤爪 200g/盒", "price": 17.72 },
                    { "name": "娃哈哈AD钙奶 220g*4瓶", "price": 7.45 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 22.94 },
                    { "name": "一点小葱 20g", "price": 0 },
                    { "name": "周黑鸭五香鸭脖趣享装 120g/盒", "price": 0 },
                    { "name": "百事可乐 330mL/罐", "price": 0 },
                    { "name": "原味绿豆糕100g/袋(4枚)", "price": 7.26 },
                    { "name": "周黑鸭五香鸭脖趣享装 120g/盒", "price": 15.84 },
                    { "name": "瑞士卷(原味+伯爵红茶) 560g/8片", "price": 21.59 },
                    { "name": "【大枚蛋】土鸡蛋8枚 440g", "price": 6.59 }
                ]
            }
        ],
        "2024-05-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "香葱 约50g", "price": 0.79 },
                    { "name": "中盐牌未加碘纯精岩盐 400g/袋", "price": 3.90 },
                    { "name": "良芯匠人手擀式面 300g/盒", "price": 3.50 },
                    { "name": "怡宝至本清润菊花茶 450mL/瓶", "price": 0 },
                    { "name": "迷你小菠萝果切 250g/盒", "price": 11.12 },
                    { "name": "普罗旺斯番茄 约500g", "price": 7.59 },
                    { "name": "海天黄豆酱 340g/瓶", "price": 8.80 },
                    { "name": "【内含4小包】叮咚定制鸡蛋鲜面 400g/袋", "price": 6.90 }
                ]
            }
        ],
        "2024-05-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "蔡长青吮指鸭锁骨（微辣）160g", "price": 13.92 },
                    { "name": "【当季现挖】新土豆 约600g", "price": 0 },
                    { "name": "陕西洛川红富士4个 800g", "price": 12.99 },
                    { "name": "【平价】新鲜后腿精肉 约240g", "price": 9.15 },
                    { "name": "螺丝椒 约300g", "price": 2.60 },
                    { "name": "【无抗保洁】鲜鸡蛋30枚 1.59kg", "price": 18.62 },
                    { "name": "一点小葱 20g", "price": 0 }
                ]
            }
        ],
        "2024-05-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 2.79 },
                    { "name": "【平价】新鲜后腿精肉 约240g", "price": 9.79 },
                    { "name": "良芯匠人饺子皮 300g/份", "price": 4.50 },
                    { "name": "韭菜 约300g", "price": 4.39 }
                ]
            }
        ],
        "2024-05-30": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.39 },
                    { "name": "益客冷鲜鸡大胸 400g", "price": 5.69 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.69 },
                    { "name": "良芯匠人火锅扯面 200g/盒", "price": 6.90 },
                    { "name": "螺丝椒 约300g", "price": 2.69 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 }
                ]
            }
        ],
        "2024-06-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "【哈尔滨小食】升元烤冷面 320g/袋", "price": 3.32 },
                    { "name": "【无抗保洁】鲜鸡蛋30枚 1.59kg", "price": 8.41 },
                    { "name": "切片南瓜 约500g", "price": 0 },
                    { "name": "蔡长青香辣素拌菜 180g", "price": 5.85 },
                    { "name": "【儿时豆香味】有豆志苏北锅香老豆腐 400g/份", "price": 2.48 },
                    { "name": "香葱 约50g", "price": 0.33 }
                ]
            }
        ],
        "2024-06-03": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜活黄金鲫鱼1条 约400g", "price": 0 },
                    { "name": "【肉似蒜瓣】鲜活优养优饲虎背鲈鱼 约300g", "price": 12.94 },
                    { "name": "【BAP国际认证】冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 9.28 },
                    { "name": "老干妈风味鸡油辣椒 280g/瓶", "price": 13.04 },
                    { "name": "【低盐】有豆志腐竹 210g/袋", "price": 10.22 },
                    { "name": "【酸辣开胃】叮咚买菜×新希望味业虎皮双椒酱 200g/瓶", "price": 8.91 },
                    { "name": "海底捞火锅蘸料原味 120g/袋", "price": 6.31 }
                ]
            }
        ],
        "2024-06-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 2.68 },
                    { "name": "有豆志薄百页 110g/份", "price": 5.30 },
                    { "name": "源氏大豆筋 200g/袋", "price": 8.00 },
                    { "name": "茄子（精选）约800g", "price": 7.00 },
                    { "name": "大白菜 约2.2kg", "price": 8.62 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 21.87 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "紫皮大蒜 约350g", "price": 6.39 },
                    { "name": "螺丝椒 约300g", "price": 2.69 },
                    { "name": "0盐龙须挂面 900g/袋", "price": 10.80 },
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 13.90 },
                    { "name": "三红胡萝卜 约600g", "price": 2.39 },
                    { "name": "大枚蛋 土鸡蛋8枚 440g", "price": 6.99 }
                ]
            }
        ],
        "2024-06-08": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "猪后腿精肉 约300g", "price": 13.90 },
                    { "name": "螺丝椒 约300g", "price": 2.59 },
                    { "name": "柳州螺蛳粉（加辣加臭）", "price": 12.90 }
                ]
            }
        ],
        "2024-06-09": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "益客冷鲜鸡琵琶腿 400g", "price": 6.99 },
                    { "name": "优质番茄 约500g", "price": 3.79 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "螺丝椒 约300g", "price": 2.59 },
                    { "name": "马可波罗火腿肠 50g*5根/袋", "price": 8.81 },
                    { "name": "双汇特嫩方腿 250g/袋", "price": 5.89 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 19.90 }
                ]
            }
        ],
        "2024-06-11": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "猪后腿肉 约360g", "price": 12.80 },
                    { "name": "优质番茄 约500g", "price": 3.42 },
                    { "name": "香葱 约50g", "price": 0.77 },
                    { "name": "螺丝椒 约300g", "price": 0.00 },
                    { "name": "有豆志苏北锅香老豆腐 400g/份", "price": 4.25 },
                    { "name": "砂锅土豆粉 320g/袋", "price": 11.96 },
                    { "name": "迷你彩虹酸奶蛋糕 120g/盒", "price": 12.89 },
                    { "name": "黄瓜 约600g", "price": 2.77 },
                    { "name": "杏鲍菇 250g/盒", "price": 2.49 }
                ]
            }
        ],
        "2024-06-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 0.00 },
                    { "name": "红洋葱 约750g", "price": 3.99 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "小米椒 约75g", "price": 2.39 },
                    { "name": "冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 9.90 },
                    { "name": "冰鲜优饲虎背鲈鱼（非鲜活）约400g", "price": 8.49 },
                    { "name": "茄子（精选）约800g", "price": 7.69 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 18.65 },
                    { "name": "有豆志香煎家常豆腐 300g/份", "price": 4.47 },
                    { "name": "一点小葱 约20g", "price": 0.00 },
                    { "name": "会员5日卡", "price": 0.00 },
                    { "name": "黑胡椒地道烤肠 300g", "price": 19.59 },
                    { "name": "蔡长青整切眼肉牛排 180g", "price": 12.09 },
                    { "name": "提子雪糕（6支）420g/盒", "price": 9.32 },
                    { "name": "双拼果粒酸牛乳圆周杯 90g*8杯/组", "price": 7.40 },
                    { "name": "麒麟西瓜 1个 约4.3kg", "price": 18.27 }
                ]
            }
        ],
        "2024-06-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "谷饲冷鲜牛腿肉 1kg", "price": 56.66 },
                    { "name": "蒜苔 约300g", "price": 5.29 },
                    { "name": "陕西洛川红富士4个 800g", "price": 10.24 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.05 },
                    { "name": "一点小葱 约20g", "price": 0.00 },
                    { "name": "青肉黄瓜 约1kg", "price": 3.89 },
                    { "name": "优质番茄 约500g", "price": 2.84 },
                    { "name": "螺丝椒 约300g", "price": 1.61 },
                    { "name": "手擀式面 300g/盒", "price": 2.85 }
                ]
            }
        ],
        "2024-06-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "有豆志盐卤五香干 120g/份", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "西兰花 约600g", "price": 5.78 },
                    { "name": "山东红富士苹果4个 860g", "price": 9.90 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-20": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 19.90 },
                    { "name": "源氏大豆筋 200g/袋 (3袋)", "price": 22.69 }
                ]
            }
        ],
        "2024-06-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "泡椒豇豆 25g*10小包/袋", "price": 9.90 },
                    { "name": "茄子（精选）约800g", "price": 7.09 },
                    { "name": "豆瓣酱 300g/盒", "price": 6.90 },
                    { "name": "皱皮青椒 约350g", "price": 2.29 },
                    { "name": "优质番茄 约500g", "price": 3.48 },
                    { "name": "手擀式面 300g/盒", "price": 3.50 },
                    { "name": "海盐鲜牛乳苏打饼干 500g/袋", "price": 10.90 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "金针菇 300g/份", "price": 0.00 },
                    { "name": "螺丝椒 约300g", "price": 1.98 },
                    { "name": "三全牛肉大葱水饺 450g", "price": 8.90 },
                    { "name": "有友凤爪（山椒味）160g", "price": 11.92 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.30 },
                    { "name": "紫皮大蒜 约350g", "price": 6.29 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-06-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "安买牙线棒 50支装", "price": 0.00 },
                    { "name": "黄瓜 约600g", "price": 2.99 },
                    { "name": "良芯匠人手擀式面 300g/盒", "price": 3.50 },
                    { "name": "金锣大食袋蒜味肠 380g/袋", "price": 13.80 },
                    { "name": "新土豆 约1kg", "price": 4.79 },
                    { "name": "螺丝椒 约300g", "price": 1.98 },
                    { "name": "优质番茄 约500g", "price": 3.58 },
                    { "name": "正大冷鲜鸡琵琶腿 450g", "price": 10.50 }
                ]
            }
        ],
        "2024-06-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "阿一波香辣味海带丝 30g/袋", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 22.60 },
                    { "name": "优质番茄 约500g", "price": 3.15 },
                    { "name": "鲜鸡蛋30枚 1.59kg", "price": 18.50 },
                    { "name": "有豆志手工攸县香干 248g/份", "price": 4.82 },
                    { "name": "兰花干160g/份", "price": 4.14 }
                ]
            }
        ],
        "2024-06-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "三红胡萝卜 约600g", "price": 2.23 },
                    { "name": "香葱 约50g", "price": 0.73 },
                    { "name": "黄瓜 约600g", "price": 2.79 },
                    { "name": "皱皮青椒 约350g", "price": 2.13 },
                    { "name": "新鲜后腿精肉 约240g", "price": 10.09 },
                    { "name": "益客冷鲜鸡大胸 400g", "price": 5.40 },
                    { "name": "番茄沙司 330g/袋", "price": 9.24 },
                    { "name": "土鸡蛋8枚 440g", "price": 6.52 },
                    { "name": "优质番茄 约500g", "price": 3.25 },
                    { "name": "吮指鸭锁骨（微辣）160g (2盒)", "price": 14.95 }
                ]
            }
        ],
        "2024-07-02": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 23.30 }
                ]
            }
        ],
        "2024-07-25": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "卫龙78°卤蛋 35g/颗", "price": 0.00 },
                    { "name": "海盐鲜牛乳苏打饼干 500g/袋", "price": 12.63 },
                    { "name": "黄瓜 约600g", "price": 4.62 },
                    { "name": "冰鲜海带丝 200g", "price": 4.35 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.00 },
                    { "name": "优质番茄 约500g", "price": 3.53 },
                    { "name": "香葱 约50g", "price": 0.93 }
                ]
            }
        ],
        "2024-08-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "刺黄瓜 500g/份", "price": 9.77 },
                    { "name": "冷鲜鸡大胸 400g(加赠80g)", "price": 10.70 },
                    { "name": "草莓番茄 300g/份", "price": 8.93 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.60 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-07": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "泡椒去骨凤爪 200g/盒", "price": 10.57 },
                    { "name": "吮指鸭锁骨（微辣）160g", "price": 13.13 },
                    { "name": "一点小葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "优质番茄 约500g", "price": 4.89 },
                    { "name": "黄瓜 约600g", "price": 9.90 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 26.40 }
                ]
            }
        ],
        "2024-08-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "秋浦河散养土鸡蛋10枚 400g", "price": 24.90 },
                    { "name": "益客冷鲜鸡琵琶腿 400g", "price": 7.99 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 12.90 }
                ]
            }
        ],
        "2024-08-15": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "皱皮蜜宝红心火龙果3个 约1kg", "price": 9.90 },
                    { "name": "紫薯 500g/份", "price": 10.90 }
                ]
            }
        ],
        "2024-08-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "紫皮大蒜 约350g", "price": 5.93 },
                    { "name": "冰鲜海带结 200g", "price": 5.19 },
                    { "name": "黄瓜 约600g", "price": 7.46 },
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "有机芹菜 250g", "price": 7.70 },
                    { "name": "雪碧清爽柠檬味汽水 1.25L", "price": 5.11 },
                    { "name": "薄百页 110g", "price": 5.10 },
                    { "name": "黄柠檬 4个 500g", "price": 5.56 },
                    { "name": "西兰花 约600g", "price": 7.34 },
                    { "name": "红洋葱 约750g", "price": 3.23 }
                ]
            }
        ],
        "2024-08-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "知味轩混合坚果果干 20g", "price": 0.00 },
                    { "name": "武威自然熟番茄 约500g", "price": 6.52 },
                    { "name": "翠冠梨 约1kg", "price": 12.87 },
                    { "name": "有机上海青 250g/份", "price": 5.96 },
                    { "name": "光明散养草鸡蛋10枚 400g", "price": 12.59 },
                    { "name": "正大可生食鲜鸡蛋12枚 660g", "price": 12.97 },
                    { "name": "黄瓜 约600g", "price": 8.21 },
                    { "name": "怡宝纯净水 6L/桶 (3桶)", "price": 24.66 }
                ]
            }
        ],
        "2024-08-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "温氏冷鲜岭南皇鸡（整只）900g", "price": 31.90 }
                ]
            }
        ],
        "2024-08-20": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "医用外科口罩 10只/包", "price": 4.90 }
                ]
            }
        ],
        "2024-08-21": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "红洋葱 300g/份", "price": 4.85 },
                    { "name": "猪五花肉 约400g", "price": 22.17 },
                    { "name": "山林大红肠 400g/袋", "price": 27.51 },
                    { "name": "青甘蓝约1kg", "price": 6.50 },
                    { "name": "娃哈哈纯净水 5.5L*4桶/组", "price": 31.50 },
                    { "name": "香葱 约50g", "price": 1.59 },
                    { "name": "土鸡蛋8枚 440g", "price": 6.79 }
                ]
            }
        ],
        "2024-08-22": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "泰森冷冻鸡琵琶腿 500g", "price": 10.37 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 7.83 },
                    { "name": "蜜香橙肉甜薯 500g", "price": 9.99 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-23": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "切片南瓜 约500g", "price": 0.00 },
                    { "name": "香葱 约50g", "price": 1.76 },
                    { "name": "木薯淀粉 200g/袋", "price": 4.85 },
                    { "name": "蒸笼纸23cm 50张/包", "price": 9.23 },
                    { "name": "山林大红肠 400g/袋", "price": 45.91 },
                    { "name": "紫薯 500g", "price": 10.17 },
                    { "name": "黑芝麻汤圆 400g", "price": 12.07 },
                    { "name": "鱼豆腐 240g", "price": 17.80 }
                ]
            }
        ],
        "2024-08-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "面巾纸 30抽", "price": 0.00 },
                    { "name": "熟番茄 约500g", "price": 9.90 },
                    { "name": "青圆椒 约500g", "price": 9.90 },
                    { "name": "新土豆 约600g", "price": 3.49 },
                    { "name": "茄子 约800g", "price": 12.90 },
                    { "name": "切片南瓜 约500g", "price": 2.99 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "崇明青椒 300g", "price": 7.99 }
                ]
            }
        ],
        "2024-08-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "保鲜罩 25只", "price": 0.00 },
                    { "name": "猪前腿 约350g", "price": 11.63 },
                    { "name": "猪五花肉 约400g", "price": 24.11 },
                    { "name": "浓香型白酒 480mL", "price": 10.14 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.22 }
                ]
            }
        ],
        "2024-08-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "卫生湿巾 10片/包", "price": 0.00 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 11.22 },
                    { "name": "甘肃青甘蓝 约1kg", "price": 8.77 },
                    { "name": "韭菜 约300g", "price": 6.13 },
                    { "name": "切片南瓜 约500g", "price": 3.41 },
                    { "name": "紫薯 500g", "price": 10.65 },
                    { "name": "香葱 约20g", "price": 0.00 }
                ]
            }
        ],
        "2024-08-30": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "Rockit乐淇小苹果 40g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.57 },
                    { "name": "新土豆 约600g", "price": 3.40 },
                    { "name": "猪汤骨 约400g", "price": 11.50 },
                    { "name": "猪汤小排 约400g", "price": 15.52 }
                ]
            }
        ],
        "2024-09-01": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "棉柔抹布 28*28cm", "price": 0.00 },
                    { "name": "橘心蜜薯 约750g", "price": 4.87 },
                    { "name": "魔芋爽 50g", "price": 3.53 },
                    { "name": "甜玉米 约1kg", "price": 5.70 },
                    { "name": "草鸡蛋 10枚", "price": 9.58 },
                    { "name": "蜜柑 约550g", "price": 20.51 },
                    { "name": "娃娃菜 3颗", "price": 6.82 },
                    { "name": "中百页 150g", "price": 5.42 },
                    { "name": "牛肉丸 250g", "price": 18.58 },
                    { "name": "牛奶滑鸭血 300g", "price": 9.27 },
                    { "name": "冰鲜海带丝 200g", "price": 4.52 }
                ]
            }
        ],
        "2024-09-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "香冬瓜 约1.2kg", "price": 7.40 },
                    { "name": "千禧小番茄 500g", "price": 6.48 },
                    { "name": "优质番茄 约500g", "price": 5.83 },
                    { "name": "西葫芦 约400g", "price": 5.64 },
                    { "name": "新土豆 约600g", "price": 3.23 },
                    { "name": "怡宝纯净水 6L/桶", "price": 8.16 },
                    { "name": "切片南瓜 约500g", "price": 5.54 },
                    { "name": "当季新藕 500g", "price": 8.74 },
                    { "name": "川藏特色黑猪大里脊 约400g", "price": 15.79 }
                ]
            }
        ],
        "2024-09-10": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "锅香老豆腐 400g", "price": 5.44 },
                    { "name": "甜玉米 约1kg", "price": 6.80 },
                    { "name": "有机南瓜 500g", "price": 6.35 },
                    { "name": "散养谷粮蛋 15枚", "price": 18.08 },
                    { "name": "紫皮大蒜 约350g", "price": 6.16 },
                    { "name": "香冬瓜 约1.2kg", "price": 7.32 }
                ]
            }
        ],
        "2024-09-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "切片南瓜 约500g", "price": 3.79 },
                    { "name": "小里脊 约170g", "price": 18.46 },
                    { "name": "新土豆 约1kg", "price": 5.26 },
                    { "name": "红心蜜柚 1个", "price": 14.54 }
                ]
            }
        ],
        "2024-09-14": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "崇明青茄子 600g", "price": 10.80 },
                    { "name": "螺丝椒 约300g", "price": 8.99 }
                ]
            }
        ],
        "2024-09-18": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "中百页 150g", "price": 5.09 }
                ]
            }
        ],
        "2024-09-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "新土豆 约600g", "price": 0.00 },
                    { "name": "鸡琵琶腿 400g", "price": 22.13 },
                    { "name": "怡宝纯净水 6L/桶", "price": 17.17 }
                ]
            }
        ],
        "2024-09-24": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "散养谷粮蛋 15枚", "price": 18.46 },
                    { "name": "有机生菜 250g", "price": 8.33 },
                    { "name": "怡宝纯净水 6L/桶", "price": 24.50 }
                ]
            }
        ],
        "2024-09-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "谷物鲜鸡蛋 18枚", "price": 17.50 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 11.50 }
                ]
            }
        ],
        "2024-09-28": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "普罗旺斯番茄 约500g", "price": 9.07 },
                    { "name": "白象老母鸡汤面 103.5g*5/袋", "price": 12.75 },
                    { "name": "琯溪三红蜜柚 1个 1.25kg", "price": 13.12 },
                    { "name": "泰森冷鲜去皮上腿肉 400g", "price": 11.82 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 8.74 }
                ]
            }
        ],
        "2024-09-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "红洋葱 约750g", "price": 0.00 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 17.60 },
                    { "name": "泰森冷鲜鸡腿块 550g", "price": 15.80 },
                    { "name": "泰森冷鲜鸡琵琶腿 400g", "price": 12.90 }
                ]
            }
        ],
        "2024-10-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "海底捞浓香牛油火锅底料 150g", "price": 14.22 }
                ]
            }
        ],
        "2024-10-17": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 7.50 }
                ]
            }
        ],
        "2024-10-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土豆（黄心）约1kg", "price": 5.19 },
                    { "name": "三红胡萝卜 约600g", "price": 3.39 }
                ]
            }
        ],
        "2024-11-04": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "香葱 约50g", "price": 1.51 },
                    { "name": "香菜 约100g", "price": 3.50 },
                    { "name": "小米椒 约75g", "price": 2.08 },
                    { "name": "黄瓜 约600g", "price": 3.59 },
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 8.47 }
                ]
            }
        ],
        "2024-11-05": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "怡宝纯净水 6L/桶 (1桶)", "price": 8.39 },
                    { "name": "三红胡萝卜 约600g", "price": 3.19 },
                    { "name": "土豆（黄心）约1kg", "price": 4.90 }
                ]
            }
        ],
        "2024-11-06": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 0.00 },
                    { "name": "21°蜜红薯 750g/份", "price": 14.47 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 21.56 },
                    { "name": "土豆（黄心）约600g", "price": 3.02 }
                ]
            }
        ],
        "2024-11-07": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "土豆（黄心）约600g", "price": 0.00 },
                    { "name": "黑钻世家黑猪火腿午餐肉 198g/罐", "price": 16.90 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 23.80 }
                ]
            }
        ],
        "2024-11-13": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 27.28 }
                ]
            }
        ],
        "2024-11-16": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "三红胡萝卜 约600g", "price": 2.53 },
                    { "name": "红洋葱 约750g", "price": 2.95 },
                    { "name": "进口香蕉 约650g", "price": 11.56 }
                ]
            }
        ],
        "2024-11-19": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "云蕾一次性保鲜罩 25只", "price": 0.00 },
                    { "name": "进口香蕉 约650g", "price": 7.46 },
                    { "name": "卫龙魔芋爽(香辣味) 50g/袋", "price": 3.63 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 16.62 },
                    { "name": "娃哈哈纯净水 5.5L/桶 (2桶)", "price": 14.77 }
                ]
            }
        ],
        "2024-11-26": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "康师傅红烧牛肉面 113g/桶", "price": 4.94 },
                    { "name": "认养一头牛有机纯牛奶 200mL*16盒/箱", "price": 36.61 },
                    { "name": "怡宝纯净水 6L/桶 (2桶)", "price": 11.65 },
                    { "name": "云蕾竹棒棉签 100支装", "price": 0.00 },
                    { "name": "黑钻世家川藏特色黑猪肉糜(3:7) 约350g", "price": 10.93 },
                    { "name": "黑钻世家冷鲜川藏特色黑猪肉丝 约350g", "price": 10.26 },
                    { "name": "无抗黑猪冷鲜汤骨 300g", "price": 10.32 },
                    { "name": "有机黑猪冷鲜通脊 200g", "price": 14.89 }
                ]
            }
        ],
        "2024-11-27": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "娃哈哈纯净水 5.5L/桶 (4桶)", "price": 25.90 }
                ]

            }, {
                "shop": "小象",
                "items": [
                    { "name": "怡宝纯净水 6L（1桶）", "price": 5.90 },
                    { "name": "康师傅番茄鸡蛋牛肉面 115g*5袋", "price": 14.90 }
                ]
            }
        ],
        "2024-11-29": [
            {
                "shop": "叮咚",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 6.89 }
                ]
            }
        ],
        "2024-12-03": [
            {
                "shop": "小象",
                "items": [
                    { "name": "百岁山矿泉水 570ml*6(散装)", "price": 12.06 },
                    { "name": "怡宝纯净水 6L（3桶）", "price": 24.95 },
                    { "name": "新疆库尔勒香梨约 500g", "price": 10.19 },
                    { "name": "新疆库尔勒香梨约 500g（赠品）", "price": 0.00 },
                    { "name": "慢养黑猪冷鲜汤骨(汤小排)350g", "price": 27.75 },
                    { "name": "慢养黑猪冷鲜前排块350g(脊骨+肋排)", "price": 18.50 },
                    { "name": "豆小月响铃卷100g(新老包装随机发货)", "price": 12.99 },
                    { "name": "豆小月响铃卷100g(新老包装随机发货)（赠品）", "price": 0.00 },
                    { "name": "三全撒尿牛肉丸120g（6个）", "price": 7.36 },
                    { "name": "三全撒尿牛肉丸120g（6个）（赠品）", "price": 0.00 }
                ]
            }
        ],
        "2024-12-08": [
            {
                "shop": "小象",
                "items": [
                    { "name": "螺丝椒 约300g", "price": 4.19 },
                    { "name": "新黄心土豆约 600g", "price": 5.20 },
                    { "name": "怡宝纯净水 6L", "price": 8.90 },
                    { "name": "康沙海南蜜薯 500g", "price": 11.99 },
                    { "name": "统一兰州牛肉面 98g*4", "price": 29.90 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-12-10": [
            {
                shop: "叮咚", items: [
                    { "name": "土豆（黄心）约1kg", "price": 4.10 },
                    { "name": "泰森冷鲜鸡大胸 400g", "price": 8.99 },
                    { "name": "进口香蕉 约650g", "price": 6.84 },
                    { "name": "怡宝纯净水 6L/桶", "price": 7.68 },
                    { "name": "螺丝椒 约300g", "price": 7.17 },
                    { "name": "泰森冷冻鸡琵琶腿 500g", "price": 10.10 },
                    { "name": "泰森冷冻鸡爪 500g", "price": 22.18 },
                    { "name": "湘佳鸡小腿 430g", "price": 20.13 },
                    { "name": "娃哈哈纯净水 5.5L/桶", "price": 6.76 },
                    { "name": "娃哈哈纯净水 5.5L*4桶/组", "price": 25.61 }
                ]
            }
        ],
        "2024-12-12": [
            {
                shop: "叮咚", items: [
                    { "name": "哈尔滨风味红肠 50g", "price": 0 },
                    { "name": "有机黑鸡土鸡蛋15枚675g", "price": 14.77 },
                    { "name": "茄子（精选）约800g", "price": 6.54 },
                    { "name": "螺丝椒 约300g", "price": 3.34 },
                    { "name": "怡宝纯净水 6L", "price": 7.13 }
                ]
            }
        ],
        "2024-12-13": [
            {
                "shop": "小象",
                "items": [
                    { "name": "天目山小香薯 500g", "price": 11.44 },
                    { "name": "天目山小香薯 500g（赠品）", "price": 0.00 },
                    { "name": "有机胡萝卜 300g", "price": 4.15 },
                    { "name": "怡宝纯净水 6L", "price": 7.89 },
                    { "name": "康师傅番茄鸡蛋牛肉面 115g*5袋", "price": 14.90 },
                    { "name": "蓝月亮旅行洗衣液（白兰香）80g", "price": 0.00 }
                ]
            }
        ],
        "2024-12-16": [
            {
                shop: "叮咚", items: [
                    { "name": "螺丝椒 约300g", "price": 4.19 }
                ]
            }
        ]
    };

    // 计算每条消费记录的总金额（每项消费的金额为商品价格之和）
    function calculateAmounts() {
        for (const date in expensesData) {
            expensesData[date].forEach(record => {
                // 计算每项消费的金额
                record.totalAmount = parseFloat(record.items.reduce((sum, item) => sum + item.price, 0).toFixed(2)); // 保留两位小数
            });
        }
    }

    // 调用calculateAmounts函数来计算每条消费记录的总金额
    calculateAmounts();

    // 关闭弹窗函数
    const closeModal = function () {
        modal.style.display = "none";
    };

    // 点击弹窗关闭按钮
    modalClose.onclick = function () {
        closeModal();
    };

    // 点击窗口外部区域时也关闭窗口
    window.addEventListener("click", function (event) {
        if (event.target === modal) {
            closeModal();
        }
    });

    // 计算指定年份的总消费
    function calculateTotalExpenditure() {
        const selectedYear = parseInt(yearSelect.value);
        let total = 0;

        Object.keys(expensesData).forEach(date => {
            if (date.startsWith(selectedYear.toString())) {
                expensesData[date].forEach(entry => {
                    total += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                });
            }
        });

        totalExpenditureDisplay.innerHTML = `<a href="#" onclick="showYearDetails(${selectedYear})">${selectedYear}年 总消费：￥${total.toFixed(2)}</a>`; // 保留两位小数
    }

    // 计算指定月份的总消费金额
    function calculateMonthlyTotal(year, month) {
        const monthStr = `${year}-${month.toString().padStart(2, '0')}`;
        let total = 0;

        Object.keys(expensesData).forEach(date => {
            if (date.startsWith(monthStr)) {
                expensesData[date].forEach(entry => {
                    total += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                });
            }
        });

        return parseFloat(total.toFixed(2)); // 保留两位小数
    }

    // 渲染日历
    function renderCalendar() {
        const year = parseInt(yearSelect.value);
        const month = parseInt(monthSelect.value);
        const lastDay = new Date(year, month, 0).getDate();
        const monthlyTotal = calculateMonthlyTotal(year, month); // 获取当前月份的总消费

        // 动态生成表格 HTML，包括左右箭头
        let htmlString = `
        <table class='calendar'>
            <tr>
                <th colspan="7">
                    <button id="prev-month" aria-label="上一月">
                        上一月
                    </button>
                    ${year}年${month}月 总消费：￥${monthlyTotal}
                    <button id="next-month" aria-label="下一月">
                        下一月
                    </button>
                </th>
            </tr>
            <tr>
                <th>日</th><th>一</th><th>二</th><th>三</th><th>四</th><th>五</th><th>六</th>
            </tr>
            <tr>`;


        // 补齐月初空白
        let weekDay = new Date(year, month - 1, 1).getDay();
        for (let i = 0; i < weekDay; i++) htmlString += "<td>-</td>";

        // 填充每一天
        for (let day = 1; day <= lastDay; day++) {
            const dateStr = `${year}-${month.toString().padStart(2, '0')}-${day.toString().padStart(2, '0')}`;
            const dailyExpenses = expensesData[dateStr] || [];
            const dailyTotal = dailyExpenses.length > 0
                ? dailyExpenses.reduce((sum, entry) => sum + entry.totalAmount, 0).toFixed(2)
                : "-"; // 如果没有消费记录显示"-"，否则显示消费金额

            htmlString += `<td>
                         <a href="#" class="day-cell" onclick="showDetails('${dateStr}')">${day}</a>
                         <div class="daily-expense">${dailyTotal}</div>
                       </td>`;

            if ((weekDay + day) % 7 === 0) htmlString += "</tr><tr>";
        }

        // 补齐月末空白
        htmlString += "</tr></table>";
        calendarContainer.innerHTML = htmlString;

        // 添加上一月和下一月按钮的事件监听
        document.getElementById("prev-month").onclick = function () {
            let newYear = year;
            let newMonth = month - 1;
            if (newMonth === 0) {
                newMonth = 12;
                newYear -= 1;
            }
            if (newYear >= 2023 && newYear <= 2025) {
                yearSelect.value = newYear;
                monthSelect.value = newMonth;
                renderCalendar();
                calculateTotalExpenditure();
            }
        };

        document.getElementById("next-month").onclick = function () {
            let newYear = year;
            let newMonth = month + 1;
            if (newMonth === 13) {
                newMonth = 1;
                newYear += 1;
            }
            if (newYear >= 2023 && newYear <= 2025) {
                yearSelect.value = newYear;
                monthSelect.value = newMonth;
                renderCalendar();
                calculateTotalExpenditure();
            }
        };
    }

    // 显示消费详情
    window.showDetails = function (dateStr) {
        modal.style.display = "block";

        const details = expensesData[dateStr];
        if (details) {
            let contentHTML = `<h3>${dateStr} 总消费：￥${details.reduce((sum, d) => sum + d.totalAmount, 0).toFixed(2)}</h3>`; // 使用 totalAmount 而不是 amount
            contentHTML += `<table class="modal-table"><thead><tr><th>平台</th><th>总计</th><th>商品</th><th>实付</th></tr></thead><tbody>`;

            details.forEach(d => {
                contentHTML += `<tr class="platform-row">
                            <td rowspan="${d.items.length}">${d.shop}</td>
                            <td rowspan="${d.items.length}" class="platform-amount">￥${d.totalAmount.toFixed(2)}</td> <!-- 使用 totalAmount -->
                            <td class="product-name">${d.items[0].name}</td>
                            <td class="product-amount">￥${d.items[0].price.toFixed(2)}</td> <!-- 保留两位小数 -->
                        </tr>`;

                for (let i = 1; i < d.items.length; i++) {
                    contentHTML += `<tr class="product-row">
                                <td class="product-name">${d.items[i].name}</td>
                                <td class="product-amount">￥${d.items[i].price.toFixed(2)}</td> <!-- 保留两位小数 -->
                            </tr>`;
                }
            });

            contentHTML += `</tbody></table>`;
            modalDetails.innerHTML = contentHTML;
        } else {
            modalDetails.innerHTML = `<p>无消费记录。</p>`;
        }
    };

    // 点击年份总消费超链接显示该年份每个月的消费详情
    window.showYearDetails = function (year) {
        modal.style.display = "block";
        let totalYearlyExpenditure = 0;
        let monthDataHTML = `<h3>${year}年 总消费：`;

        for (let month = 1; month <= 12; month++) {
            const monthStr = `${year}-${month.toString().padStart(2, '0')}`;
            let monthlyTotal = 0;

            Object.keys(expensesData).forEach(date => {
                if (date.startsWith(monthStr)) {
                    expensesData[date].forEach(entry => {
                        monthlyTotal += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                    });
                }
            });

            totalYearlyExpenditure += monthlyTotal;
        }

        monthDataHTML += `￥${totalYearlyExpenditure.toFixed(2)}</h3>`; // 保留两位小数
        monthDataHTML += `<table border="1" style="width:100%; margin-top:10px;">
                        <tr><th>月份</th><th>总消费金额</th></tr>`;

        for (let month = 1; month <= 12; month++) {
            const monthStr = `${year}-${month.toString().padStart(2, '0')}`;
            let monthlyTotal = 0;

            Object.keys(expensesData).forEach(date => {
                if (date.startsWith(monthStr)) {
                    expensesData[date].forEach(entry => {
                        monthlyTotal += entry.totalAmount;  // 使用 totalAmount 而不是 amount
                    });
                }
            });

            monthDataHTML += `<tr>
                            <td><a href="#" onclick="selectMonth(${year}, ${month})">${month}月</a></td>
                            <td>￥${monthlyTotal.toFixed(2)}</td> <!-- 保留两位小数 -->
                          </tr>`;
        }

        monthDataHTML += `</table>`;
        modalDetails.innerHTML = monthDataHTML;
    };

    window.selectMonth = function (year, month) {
        modal.style.display = "none";
        yearSelect.value = year;
        monthSelect.value = month;
        renderCalendar();
        calculateTotalExpenditure();
    };

    // 关闭弹窗
    modalClose.onclick = function () {
        modal.style.display = "none";
    };

    // 切换年份或月份时重新渲染
    yearSelect.onchange = function () {
        renderCalendar();
        calculateTotalExpenditure();
    };

    monthSelect.onchange = function () {
        renderCalendar();
    };

    function initializeYearAndMonthOptions() {
        const years = [2023, 2024, 2025];
        const months = Array.from({ length: 12 }, (_, i) => i + 1);

        years.forEach(year => {
            const option = document.createElement("option");
            option.value = year;
            option.textContent = `${year}年`;
            yearSelect.appendChild(option);
        });

        months.forEach(month => {
            const option = document.createElement("option");
            option.value = month;
            option.textContent = `${month}月`;
            monthSelect.appendChild(option);
        });

        yearSelect.value = 2024;
        monthSelect.value = 12;
    }

    initializeYearAndMonthOptions();
    renderCalendar();
    calculateTotalExpenditure();
});
